{
    "Blinded": {
        "conditionDescription": "* A blinded creature can't see and automatically\nfails any ability check that requires sight.\n* Attack rolls against the creature have advantage,\nand the creature's attack rolls have disadvantage.\n",
        "conditionName": "Blinded"
    },
    "Charmed": {
        "conditionDescription": "* A charmed creature can't attack the charmer or\ntarget the charmer with harmful abilities or\nmagical effects.\n* The charmer has advantage on any ability check to\ninteract socially with the creature.\n",
        "conditionName": "Charmed"
    },
    "Deafened": {
        "conditionDescription": "* A deafened creature can't hear and automatically\nfails any ability check that requires hearing.\n",
        "conditionName": "Deafened"
    },
    "Exhaustion": {
        "conditionDescription": "Some special abilities and environmental hazards, such as\nstarvation and the long-term effects of freezing or scorching\ntemperatures, can lead to a special condition called\nexhaustion. Exhaustion is measured in six levels. An effect\ncan give a creature one or more levels of exhaustion, as\nspecified in the effect's description.\nLevel Effect\n1 Disadvantage on ability checks\n2 Speed halved\n3 Disadvantage on attack rolls and saving throws\n4 Hit point maximum halved\n5 Speed reduced to 0\n6 Death\nIf an already exhausted creature suffers another effect that\ncauses exhaustion, its current level of exhaustion increases\nby the amount specified in the effect's description.\nA creature suffers the effect of its current level of\nexhaustion as well as all lower levels. For example, a creature\nsuffering level 2 exhaustion has its speed halved and has\ndisadvantage on ability checks.\nAn effect that removes exhaustion reduces its level as\nspecified in the effect's description, with all exhaustion\neffects ending if a creature's exhaustion level is reduced\nbelow 1.\nFinishing a long rest reduces a creature's exhaustion level\nby 1, provided that the creature has also ingested some food\nand drink.\n",
        "conditionName": "Exhaustion"
    },
    "Frightened": {
        "conditionDescription": "* A frightened creature has disadvantage on ability\nchecks and attack rolls while the source of its fear\nis within line of sight.\n* The creature can't willingly move closer to the\nsource of its fear.\n",
        "conditionName": "Frightened"
    },
    "Grappled": {
        "conditionDescription": "* A grappled creature's speed becomes 0, and it\ncan't benefit from any bonus to its speed.\n* The condition ends if the grappler is incapacitated\n(see the condition).\n* The condition also ends if an effect removes the\ngrappled creature from the reach of the grappler\nor grappling effect, such as when a creature is\nhurled away by the thunder-wave spell.\n",
        "conditionName": "Grappled"
    },
    "Incapacitated": {
        "conditionDescription": "* An incapacitated creature can't take actions or\nreactions.\n",
        "conditionName": "Incapacitated"
    },
    "Invisible": {
        "conditionDescription": "* An invisible creature is impossible to see without\nthe aid of magic or a special sense. For the purpose\nof hiding, the creature is heavily obscured. The\ncreature's location can be detected by any noise it\nmakes or any tracks it leaves.\n* Attack rolls against the creature have\ndisadvantage, and the creature's attack rolls have\nadvantage.\n",
        "conditionName": "Invisible"
    },
    "Paralyzed": {
        "conditionDescription": "* A paralyzed creature is incapacitated (see the\ncondition) and can't move or speak.\n* The creature automatically fails Strength and Dexterity saving throws.\n* Attack rolls against the creature have advantage.\n* Any attack that hits the creature is a critical hit if\nthe attacker is within 5 feet of the creature.\n",
        "conditionName": "Paralyzed"
    },
    "Petrified": {
        "conditionDescription": "* A petrified creature is transformed, along with any\nnonmagical object it is wearing or carrying, into a\nsolid inanimate substance (usually stone). Its\nweight increases by a factor of ten, and it ceases\naging.\n* The creature is incapacitated (see the condition),\ncan't move or speak, and is unaware of its\nsurroundings.\n* Attack rolls against the creature have advantage.\n* The creature automatically fails Strength and\nDexterity saving throws.\n* The creature has resistance to all damage.\n* The creature is immune to poison and disease,\nalthough a poison or disease already in its system\nis suspended, not neutralized.\n",
        "conditionName": "Petrified"
    },
    "Poisoned": {
        "conditionDescription": "* A poisoned creature has disadvantage on attack\nrolls and ability checks.\n",
        "conditionName": "Poisoned"
    },
    "Prone": {
        "conditionDescription": "* A prone creature's only movement option is to\ncrawl, unless it stands up and thereby ends the\ncondition.\n* The creature has disadvantage on attack rolls.\n* An attack roll against the creature has advantage if\nthe attacker is within 5 feet of the creature.\nOtherwise, the attack roll has disadvantage.\n",
        "conditionName": "Prone"
    },
    "Restrained": {
        "conditionDescription": "* A restrained creature's speed becomes 0, and it\ncan't benefit from any bonus to its speed.\n* Attack rolls against the creature have advantage,\nand the creature's attack rolls have disadvantage.\n* The creature has disadvantage on Dexterity saving\nthrows.\n",
        "conditionName": "Restrained"
    },
    "Stunned": {
        "conditionDescription": "* A stunned creature is incapacitated (see the\ncondition), can't move, and can speak only\nfalteringly.\n* The creature automatically fails Strength and\nDexterity saving throws.\n* Attack rolls against the creature have advantage.\nUnconscious\n",
        "conditionName": "Stunned"
    }
}