{
    "Adamantine Armor": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This suit of armor is reinforced with adamantine,\none of the hardest substances in existence. While\nyou're wearing it, any critical hit against you\nbecomes a normal hit.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Adamantine Armor", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Armor (medium or heavy but not hide)", 
        "magicItemWeight": 0
    }, 
    "Amulet of Health": {
        "magicItemCharges": 0, 
        "magicItemDescription": "Your Constitution score is 19 while you wear this\namulet. It has no effect on you if your Constitution is\nalready 19 or higher.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Amulet of Health", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Amulet of Proof against Detection and Location": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this amulet, you are hidden from\ndivination magic. You can't be targeted by such\nmagic or perceived through magical scrying sensors.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Amulet of Proof against Detection and Location", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Amulet of the Planes": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this amulet, you can use an action to\nname a location that you are familiar with on\nanother plane of existence. Then make a DC 15\nIntelligence check. On a successful check, you cast\nthe plane shift spell. On a failure, you and each\ncreature and object within 15 feet of you travel to a\nrandom destination. Roll a d100. On a 1–60, you\ntravel to a random location on the plane you named.\nOn a 61–100, you travel to a randomly determined\nplane of existence.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Amulet of the Planes", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Animated Shield": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While holding this shield, you can speak its\ncommand word as a bonus action to cause it to\nanimate. The shield leaps into the air and hovers in\nyour space to protect you as if you were wielding it,\nleaving your hands free. The shield remains\nanimated for 1 minute, until you use a bonus action\nto end this effect, or until you are incapacitated or\ndie, at which point the shield falls to the ground or\ninto your hand if you have one free.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Animated Shield", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Armor (shield)", 
        "magicItemWeight": 0
    }, 
    "Apparatus of the Crab": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This item first appears to be a Large sealed iron\nbarrel weighing 500 pounds. The barrel has a hidden\ncatch, which can be found with a successful DC 20\nIntelligence (Investigation) check. Releasing the\ncatch unlocks a hatch at one end of the barrel,\nallowing two Medium or smaller creatures to crawl\ninside. Ten levers are set in a row at the far end, each\nin a neutral position, able to move either up or down.\nWhen certain levers are used, the apparatus\ntransforms to resemble a giant lobster.\nThe apparatus of the Crab is a Large object with\nthe following statistics:\nArmor Class: 20\nHit Points: 200\nSpeed: 30 ft., swim 30 ft. (or 0 ft. for both if the legs\nand tail aren't extended)\nDamage Immunities: poison, psychic\nTo be used as a vehicle, the apparatus requires one\npilot. While the apparatus's hatch is closed, the\ncompartment is airtight and watertight. The\ncompartment holds enough air for 10 hours of\nbreathing, divided by the number of breathing\ncreatures inside.\nThe apparatus floats on water. It can also go\nunderwater to a depth of 900 feet. Below that, the\nvehicle takes 2d6 bludgeoning damage per minute\nfrom pressure.\nA creature in the compartment can use an action\nto move as many as two of the apparatus's levers up\nor down. After each use, a lever goes back to its\nneutral position. Each lever, from left to right,\nfunctions as shown in the Apparatus of the Crab\nLevers table.\nApparatus of the Crab Levers\nLever Up Down\n1 Legs and tail extend, allowing the apparatus to walk and swim.\nLegs and tail retract, reducing the apparatus's speed to 0 and making it\nunable to benefit from bonuses to speed.\n2 Forward window shutter opens.\nForward window shutter closes.\n3 Side window shutters open (two per side).\nSide window shutters close (two per side).\n4 Two claws extend from the front sides of the apparatus.\nThe claws retract. 5 Each extended claw makes the following melee weapon attack:\n+8 to hit, reach 5 ft., one target. Hit: 7 (2d6) bludgeoning damage.\nEach extended claw makes the following melee weapon attack: +8 to hit, reach 5 ft., one\ntarget. Hit: The target is grappled (escape DC 15).\n6 The apparatus walks or swims forward.\nThe apparatus walks or swims backward.\n7 The apparatus turns 90 degrees left.\nThe apparatus turns 90 degrees right.\n8 Eyelike fixtures emit bright light in a 30-foot radius and dim light for\nan additional 30 feet.\nThe light turns off.\n9 The apparatus sinks as much as 20 feet in liquid.\nThe apparatus rises up to 20 feet in liquid.\n10 The rear hatch unseals and opens.\nThe rear hatch closes and seals.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Apparatus of the Crab", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Armor of Invulnerability": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You have resistance to nonmagical damage while\nyou wear this armor. Additionally, you can use an\naction to make yourself immune to nonmagical\ndamage for 10 minutes or until you are no longer\nwearing the armor. Once this special action is used,\nit can't be used again until the next dawn.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Armor of Invulnerability", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Armor (plate)", 
        "magicItemWeight": 0
    }, 
    "Armor of Resistance": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You have resistance to one type of damage while you\nwear this armor. The GM chooses the type or\ndetermines it randomly from the options below.\nd10 Damage Type d10 Damage Type\n1 Acid 6 Necrotic\n2 Cold 7 Poison\n3 Fire 8 Psychic\n4 Force 9 Radiant\n5 Lightning 10 Thunder\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Armor of Resistance", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Armor (light or medium or heavy)", 
        "magicItemWeight": 0
    }, 
    "Armor of Vulnerability": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this armor, you have resistance to\none of the following damage types: bludgeoning,\npiercing, or slashing. The GM chooses the type or\ndetermines it randomly.\nCurse. This armor is cursed, a fact that is revealed\nonly when an identify spell is cast on the armor or\nyou attune to it. Attuning to the armor curses you\nuntil you are targeted by the remove curse spell or\nsimilar magic; removing the armor fails to end the\ncurse. While cursed, you have vulnerability to two of\nthe three damage types associated with the armor\n(not the one to which it grants resistance).\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Armor of Vulnerability", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Armor (plate)", 
        "magicItemWeight": 0
    }, 
    "Arrow of Slaying": {
        "magicItemCharges": 0, 
        "magicItemDescription": "An arrow of slaying is a magic weapon meant to slay\na particular kind of creature. Some are more focused\nthan others; for example, there are both arrows of\ndragon slaying and arrows of blue dragon slaying. If a\ncreature belonging to the type, race, or group\nassociated with an arrow of slaying takes damage\nfrom the arrow, the creature must make a DC 17\nConstitution saving throw, taking an extra 6d10\npiercing damage on a failed save, or half as much\nextra damage on a successful one.\nOnce an arrow of slaying deals its extra damage to\na creature, it becomes a nonmagical arrow.\nOther types of magic ammunition of this kind exist,\nsuch as bolts of slaying meant for a crossbow, though\narrows are most common.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Arrow of Slaying", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Weapon (arrow)", 
        "magicItemWeight": 0
    }, 
    "Arrow-Catching Shield": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You gain a +2 bonus to AC against ranged attacks\nwhile you wield this shield. This bonus is in addition\nto the shield's normal bonus to AC. In addition,\nwhenever an attacker makes a ranged attack against\na target within 5 feet of you, you can use your\nreaction to become the target of the attack instead.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Arrow-Catching Shield", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Armor (shield)", 
        "magicItemWeight": 0
    }, 
    "Bag of Beans": {
        "magicItemCharges": 0, 
        "magicItemDescription": "Inside this heavy cloth bag are 3d4 dry beans. The\nbag weighs 1/2 pound plus 1/4 pound for each bean\nit contains.\nIf you dump the bag's contents out on the ground,\nthey explode in a 10-foot radius, extending from the\nbeans. Each creature in the area, including you, must\nmake a DC 15 Dexterity saving throw, taking 5d4 fire\ndamage on a failed save, or half as much damage on\na successful one. The fire ignites flammable objects\nin the area that aren't being worn or carried.\nIf you remove a bean from the bag, plant it in dirt\nor sand, and then water it, the bean produces an\neffect 1 minute later from the ground where it was\nplanted. The GM can choose an effect from the\nfollowing table, determine it randomly, or create an\neffect.\nd100 Effect\n01 5d4 toadstools sprout. If a creature eats a\ntoadstool, roll any die. On an odd roll, the eater\nmust succeed on a DC 15 Constitution saving\nthrow or take 5d6 poison damage and become\npoisoned for 1 hour. On an even roll, the eater\ngains 5d6 temporary hit points for 1 hour.\n02–10 A geyser erupts and spouts water, beer, berry\njuice, tea, vinegar, wine, or oil (GM's choice) 30\nfeet into the air for 1d12 rounds.\n11–20 A treant sprouts. There's a 50 percent chance\nthat the treant is chaotic evil and attacks.\n21–30 An animate, immobile stone statue in your\nlikeness rises. It makes verbal threats against\nyou. If you leave it and others come near, it\ndescribes you as the most heinous of villains and\ndirects the newcomers to find and attack you. If\nyou are on the same plane of existence as the\nstatue, it knows where you are. The statue\nbecomes inanimate after 24 hours.\n31–40 A campfire with blue flames springs forth and\nburns for 24 hours (or until it is extinguished).\n41–50 1d6 + 6 shriekers sprout\n51–60 1d4 + 8 bright pink toads crawl forth. Whenever\na toad is touched, it transforms into a Large or\nsmaller monster of the GM's choice. The\nmonster remains for 1 minute, then disappears\nin a puff of bright pink smoke.\n61–70 A hungry bulette burrows up and attacks.\n71–80 A fruit tree grows. It has 1d10 + 20 fruit, 1d8 of\nwhich act as randomly determined magic\npotions, while one acts as an ingested poison of\nthe GM's choice. The tree vanishes after 1 hour.\nPicked fruit remains, retaining any magic for 30\ndays.\n81–90 A nest of 1d4 + 3 eggs springs up. Any creature\nthat eats an egg must make a DC 20 Constitution\nsaving throw. On a successful save, a creature\npermanently increases its lowest ability score by\n1, randomly choosing among equally low scores.\nOn a failed save, the creature takes 10d6 force\ndamage from an internal magical explosion.\n91–99 A pyramid with a 60-foot-square base bursts\nupward. Inside is a sarcophagus containing a\nmummy lord. The pyramid is treated as the\nmummy lord's lair, and its sarcophagus contains\ntreasure of the GM's choice.\n00 A giant beanstalk sprouts, growing to a height of\nthe GM's choice. The top leads where the GM\nchooses, such as to a great view, a cloud giant's\ncastle, or a different plane of existence.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Bag of Beans", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Bag of Devouring": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This bag superficially resembles a bag of holding but\nis a feeding orifice for a gigantic extradimensional\ncreature. Turning the bag inside out closes the\norifice.\nThe extradimensional creature attached to the bag\ncan sense whatever is placed inside the bag. Animal\nor vegetable matter placed wholly in the bag is\ndevoured and lost forever. When part of a living\ncreature is placed in the bag, as happens when\nsomeone reaches inside it, there is a 50 percent\nchance that the creature is pulled inside the bag. A\ncreature inside the bag can use its action to try to\nescape with a successful DC 15 Strength check.\nAnother creature can use its action to reach into the\nbag to pull a creature out, doing so with a successful\nDC 20 Strength check (provided it isn't pulled inside\nthe bag first). Any creature that starts its turn inside\nthe bag is devoured, its body destroyed.\nInanimate objects can be stored in the bag, which\ncan hold a cubic foot of such material. However, once\neach day, the bag swallows any objects inside it and\nspits them out into another plane of existence. The\nGM determines the time and plane.\nIf the bag is pierced or torn, it is destroyed, and\nanything contained within it is transported to a\nrandom location on the Astral Plane.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Bag of Devouring", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Bag of Holding": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This bag has an interior space considerably larger\nthan its outside dimensions, roughly 2 feet in\ndiameter at the mouth and 4 feet deep. The bag can\nhold up to 500 pounds, not exceeding a volume of 64\ncubic feet. The bag weighs 15 pounds, regardless of\nits contents. Retrieving an item from the bag\nrequires an action.\nIf the bag is overloaded, pierced, or torn, it\nruptures and is destroyed, and its contents are\nscattered in the Astral Plane. If the bag is turned\ninside out, its contents spill forth, unharmed, but the\nbag must be put right before it can be used again.\nBreathing creatures inside the bag can survive up to\na number of minutes equal to 10 divided by the\nnumber of creatures (minimum 1 minute), after\nwhich time they begin to suffocate.\nPlacing a bag of holding inside an\nextradimensional space created by a handy\nhaversack, portable hole, or similar item instantly\ndestroys both items and opens a gate to the Astral\nPlane. The gate originates where the one item was\nplaced inside the other. Any creature within 10 feet\nof the gate is sucked through it to a random location\non the Astral Plane. The gate then closes. The gate is\none-way only and can't be reopened.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Bag of Holding", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Bag of Tricks": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This ordinary bag, made from gray, rust, or tan cloth,\nappears empty. Reaching inside the bag, however,\nreveals the presence of a small, fuzzy object. The bag\nweighs 1/2 pound.\nYou can use an action to pull the fuzzy object from\nthe bag and throw it up to 20 feet. When the object\nlands, it transforms into a creature you determine by\nrolling a d8 and consulting the table that\ncorresponds to the bag's color. The creature\nvanishes at the next dawn or when it is reduced to 0\nhit points.\nThe creature is friendly to you and your\ncompanions, and it acts on your turn. You can use a\nbonus action to command how the creature moves\nand what action it takes on its next turn, or to give it\ngeneral orders, such as to attack your enemies. In\nthe absence of such orders, the creature acts in a\nfashion appropriate to its nature.\nOnce three fuzzy objects have been pulled from\nthe bag, the bag can't be used again until the next\ndawn.\nGray Bag of Tricks\nd8 Creature\n1 Weasel\n2 Giant rat\n3 Badger\n4 Boar\n5 Panther\n6 Giant badger\n7 Dire wolf\n8 Giant elk\nRust Bag of Tricks\nd8 Creature\n1 Rat\n2 Owl\n3 Mastiff\n4 Goat\n5 Giant goat\n6 Giant boar\n7 Lion\n8 Brown bear\nTan Bag of Tricks\nd8 Creature\n1 Jackal\n2 Ape\n3 Baboon\n4 Axe beak\n5 Black bear\n6 Giant weasel\n7 Giant hyena\n8 Tiger\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Bag of Tricks", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Bead of Force": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This small black sphere measures 3/4 of an inch in\ndiameter and weighs an ounce. Typically, 1d4 + 4\nbeads of force are found together.\nYou can use an action to throw the bead up to 60\nfeet. The bead explodes on impact and is destroyed.\nEach creature within a 10-foot radius of where the\nbead landed must succeed on a DC 15 Dexterity\nsaving throw or take 5d4 force damage. A sphere of\ntransparent force then encloses the area for 1\nminute. Any creature that failed the save and is\ncompletely within the area is trapped inside this\nsphere. Creatures that succeeded on the save, or are\npartially within the area, are pushed away from the\ncenter of the sphere until they are no longer inside it.\nOnly breathable air can pass through the sphere's\nwall. No attack or other effect can.\nAn enclosed creature can use its action to push\nagainst the sphere's wall, moving the sphere up to\nhalf the creature's walking speed. The sphere can be\npicked up, and its magic causes it to weigh only 1\npound, regardless of the weight of creatures inside.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Bead of Force", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Belt of Dwarvenkind": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this belt, you gain the following\nbenefits:\n* Your Constitution score increases by 2, to a\nmaximum of 20.\n* You have advantage on Charisma (Persuasion)\nchecks made to interact with dwarves.\nIn addition, while attuned to the belt, you have a 50\npercent chance each day at dawn of growing a full\nbeard if you're capable of growing one, or a visibly\nthicker beard if you already have one.\nIf you aren't a dwarf, you gain the following\nadditional benefits while wearing the belt:\n* You have advantage on saving throws against\npoison, and you have resistance against poison\ndamage.\n* You have darkvision out to a range of 60 feet.\n* You can speak, read, and write Dwarvish.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Belt of Dwarvenkind", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Belt of Giant Strength": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this belt, your Strength score changes\nto a score granted by the belt. If your Strength is\nalready equal to or greater than the belt's score, the\nitem has no effect on you.\nSix varieties of this belt exist, corresponding with\nand having rarity according to the six kinds of true\ngiants. The belt of stone giant strength and the belt of\nfrost giant strength look different, but they have the\nsame effect.\nType Strength Rarity\nHill giant 21 Rare\nStone/frost giant 23 Very rare\nFire giant 25 Very rare\nCloud giant 27 Legendary\nStorm giant 29 Legendary\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Belt of Giant Strength", 
        "magicItemRarity": "Rarity Varies", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Berserker Axe": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You gain a +1 bonus to attack and damage rolls\nmade with this magic weapon. In addition, while you\nare attuned to this weapon, your hit point maximum\nincreases by 1 for each level you have attained.\nCurse. This axe is cursed, and becoming attuned to\nit extends the curse to you. As long as you remain\ncursed, you are unwilling to part with the axe,\nkeeping it within reach at all times. You also have\ndisadvantage on attack rolls with weapons other\nthan this one, unless no foe is within 60 feet of you\nthat you can see or hear.\nWhenever a hostile creature damages you while\nthe axe is in your possession, you must succeed on a\nDC 15 Wisdom saving throw or go berserk. While\nberserk, you must use your action each round to\nattack the creature nearest to you with the axe. If\nyou can make extra attacks as part of the Attack\naction, you use those extra attacks, moving to attack\nthe next nearest creature after you fell your current\ntarget. If you have multiple possible targets, you\nattack one at random. You are berserk until you start\nyour turn with no creatures within 60 feet of you\nthat you can see or hear.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Berserker Axe", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Weapon (any axe)", 
        "magicItemWeight": 0
    }, 
    "Boots of Elvenkind": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While you wear these boots, your steps make no\nsound, regardless of the surface you are moving\nacross. You also have advantage on Dexterity\n(Stealth) checks that rely on moving silently.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Boots of Elvenkind", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Boots of Levitation": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While you wear these boots, you can use an action to\ncast the levitate spell on yourself at will.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Boots of Levitation", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Boots of Speed": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While you wear these boots, you can use a bonus\naction and click the boots' heels together. If you do,\nthe boots double your walking speed, and any\ncreature that makes an opportunity attack against\nyou has disadvantage on the attack roll. If you click\nyour heels together again, you end the effect.\nWhen the boots' property has been used for a total\nof 10 minutes, the magic ceases to function until you\nfinish a long rest.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Boots of Speed", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Boots of Striding and Springing": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While you wear these boots, your walking speed\nbecomes 30 feet, unless your walking speed is higher,\nand your speed isn't reduced if you are encumbered\nor wearing heavy armor. In addition, you can jump\nthree times the normal distance, though you can't\njump farther than your remaining movement would\nallow.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Boots of Striding and Springing", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Boots of the Winterlands": {
        "magicItemCharges": 0, 
        "magicItemDescription": "These furred boots are snug and feel quite warm.\nWhile you wear them, you gain the following\nbenefits:\n* You have resistance to cold damage.\n* You ignore difficult terrain created by ice or snow.\n* You can tolerate temperatures as low as -50\ndegrees Fahrenheit without any additional\nprotection. If you wear heavy clothes, you can\ntolerate temperatures as low as -100 degrees\nFahrenheit.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Boots of the Winterlands", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Bowl of Commanding Water Elementals": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While this bowl is filled with water, you can use an\naction to speak the bowl's command word and\nsummon a water elemental, as if you had cast the\nconjure elemental spell. The bowl can't be used this\nway again until the next dawn.\nThe bowl is about 1 foot in diameter and half as\ndeep. It weighs 3 pounds and holds about 3 gallons.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Bowl of Commanding Water Elementals", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Bracers of Archery": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing these bracers, you have proficiency\nwith the longbow and shortbow, and you gain a +2\nbonus to damage rolls on ranged attacks made with\nsuch weapons.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Bracers of Archery", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Bracers of Defense": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing these bracers, you gain a +2 bonus to\nAC if you are wearing no armor and using no shield.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Bracers of Defense", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Brazier of Commanding Fire Elementals": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While a fire burns in this brass brazier, you can use\nan action to speak the brazier's command word and\nsummon a fire elemental, as if you had cast the\nconjure elemental spell. The brazier can't be used\nthis way again until the next dawn.\nThe brazier weighs 5 pounds.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Brazier of Commanding Fire Elementals", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Brooch of Shielding": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this brooch, you have resistance to\nforce damage, and you have immunity to damage\nfrom the magic missile spell.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Brooch of Shielding", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Broom of Flying": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This wooden broom, which weighs 3 pounds,\nfunctions like a mundane broom until you stand\nastride it and speak its command word. It then\nhovers beneath you and can be ridden in the air. It\nhas a flying speed of 50 feet. It can carry up to 400\npounds, but its flying speed becomes 30 feet while\ncarrying over 200 pounds. The broom stops\nhovering when you land.\nYou can send the broom to travel alone to a\ndestination within 1 mile of you if you speak the\ncommand word, name the location, and are familiar\nwith that place. The broom comes back to you when\nyou speak another command word, provided that\nthe broom is still within 1 mile of you.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Broom of Flying", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Candle of Invocation": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This slender taper is dedicated to a deity and shares\nthat deity's alignment. The candle's alignment can be\ndetected with the detect evil and good spell. The GM\nchooses the god and associated alignment or\ndetermines the alignment randomly.\nd20 Alignment\n1–2 Chaotic evil\n3–4 Chaotic neutral\n5–7 Chaotic good\n8–9 Neutral evil\n10–11 Neutral\n12–13 Neutral good\n14–15 Lawful evil\n16–17 Lawful neutral\n18–20 Lawful good\nThe candle's magic is activated when the candle is\nlit, which requires an action. After burning for 4\nhours, the candle is destroyed. You can snuff it out\nearly for use at a later time. Deduct the time it\nburned in increments of 1 minute from the candle's\ntotal burn time.\nWhile lit, the candle sheds dim light in a 30-foot\nradius. Any creature within that light whose\nalignment matches that of the candle makes attack\nrolls, saving throws, and ability checks with\nadvantage. In addition, a cleric or druid in the light\nwhose alignment matches the candle's can cast 1stlevel\nspells he or she has prepared without\nexpending spell slots, though the spell's effect is as if\ncast with a 1st-level slot.\nAlternatively, when you light the candle for the\nfirst time, you can cast the gate spell with it. Doing so\ndestroys the candle.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Candle of Invocation", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Cape of the Mountebank": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This cape smells faintly of brimstone. While wearing\nit, you can use it to cast the dimension door spell as\nan action. This property of the cape can't be used\nagain until the next dawn.\nWhen you disappear, you leave behind a cloud of\nsmoke, and you appear in a similar cloud of smoke at\nyour destination. The smoke lightly obscures the\nspace you left and the space you appear in, and it\ndissipates at the end of your next turn. A light or\nstronger wind disperses the smoke.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Cape of the Mountebank", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Carpet of Flying": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You can speak the carpet's command word as an\naction to make the carpet hover and fly. It moves\naccording to your spoken directions, provided that\nyou are within 30 feet of it.\nFour sizes of carpet of flying exist. The GM chooses\nthe size of a given carpet or determines it randomly.\nd100 Size Capacity Flying Speed\n01–20 3 ft. x 5 ft. 200 lb. 80 feet\n21–55 4 ft. x 6 ft. 400 lb. 60 feet\n56–80 5 ft. x 7 ft. 600 lb. 40 feet\n81–100 6 ft. x 9 ft. 800 lb. 30 feet\nA carpet can carry up to twice the weight shown\non the table, but it flies at half speed if it carries\nmore than its normal capacity.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Carpet of Flying", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Censer of Controlling Air Elementals": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While incense is burning in this censer, you can use\nan action to speak the censer's command word and\nsummon an air elemental, as if you had cast the\nconjure elemental spell. The censer can't be used this\nway again until the next dawn.\nThis 6-inch-wide, 1-foot-high vessel resembles a\nchalice with a decorated lid. It weighs 1 pound.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Censer of Controlling Air Elementals", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Chime of Opening": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This hollow metal tube measures about 1 foot long\nand weighs 1 pound. You can strike it as an action,\npointing it at an object within 120 feet of you that\ncan be opened, such as a door, lid, or lock. The chime\nissues a clear tone, and one lock or latch on the\nobject opens unless the sound can't reach the object.\nIf no locks or latches remain, the object itself opens.\nThe chime can be used ten times. After the tenth\ntime, it cracks and becomes useless.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Chime of Opening", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Circlet of Blasting": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this circlet, you can use an action to\ncast the scorching ray spell with it. When you make\nthe spell's attacks, you do so with an attack bonus of\n+5. The circlet can't be used this way again until the\nnext dawn.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Circlet of Blasting", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Cloak of Arachnida": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This fine garment is made of black silk interwoven\nwith faint silvery threads. While wearing it, you gain\nthe following benefits:\n* You have resistance to poison damage.\n* You have a climbing speed equal to your walking speed.\n* You can move up, down, and across vertical\nsurfaces and upside down along ceilings, while\nleaving your hands free.\n* You can't be caught in webs of any sort and can\nmove through webs as if they were difficult terrain.\n* You can use an action to cast the web spell (save\nDC 13). The web created by the spell fills twice its\nnormal area. Once used, this property of the cloak\ncan't be used again until the next dawn.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Cloak of Arachnida", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Cloak of Displacement": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While you wear this cloak, it projects an illusion that\nmakes you appear to be standing in a place near\nyour actual location, causing any creature to have\ndisadvantage on attack rolls against you. If you take\ndamage, the property ceases to function until the\nstart of your next turn. This property is suppressed\nwhile you are incapacitated, restrained, or otherwise\nunable to move.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Cloak of Displacement", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Cloak of Elvenkind": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While you wear this cloak with its hood up, Wisdom\n(Perception) checks made to see you have\ndisadvantage, and you have advantage on Dexterity\n(Stealth) checks made to hide, as the cloak's color\nshifts to camouflage you. Pulling the hood up or\ndown requires an action.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Cloak of Elvenkind", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Cloak of Protection": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You gain a +1 bonus to AC and saving throws while\nyou wear this cloak.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Cloak of Protection", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Cloak of the Bat": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this cloak, you have advantage on\nDexterity (Stealth) checks. In an area of dim light or\ndarkness, you can grip the edges of the cloak with\nboth hands and use it to fly at a speed of 40 feet. If\nyou ever fail to grip the cloak's edges while flying in\nthis way, or if you are no longer in dim light or\ndarkness, you lose this flying speed.\nWhile wearing the cloak in an area of dim light or\ndarkness, you can use your action to cast polymorph\non yourself, transforming into a bat. While you are in\nthe form of the bat, you retain your Intelligence,\nWisdom, and Charisma scores. The cloak can't be\nused this way again until the next dawn.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Cloak of the Bat", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Cloak of the Manta Ray": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this cloak with its hood up, you can\nbreathe underwater, and you have a swimming\nspeed of 60 feet. Pulling the hood up or down\nrequires an action.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Cloak of the Manta Ray", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Crystal Ball": {
        "magicItemCharges": 0, 
        "magicItemDescription": "The typical crystal ball, a very rare item, is about 6\ninches in diameter. While touching it, you can cast\nthe scrying spell (save DC 17) with it.\nThe following crystal ball variants are legendary\nitems and have additional properties.\nCrystal Ball of Mind Reading. You can use an\naction to cast the detect thoughts spell (save DC 17)\nwhile you are scrying with the crystal ball, targeting\ncreatures you can see within 30 feet of the spell's\nsensor. You don't need to concentrate on this detect\nthoughts to maintain it during its duration, but it\nends if scrying ends.\nCrystal Ball of Telepathy. While scrying with the\ncrystal ball, you can communicate telepathically with\ncreatures you can see within 30 feet of the spell's\nsensor. You can also use an action to cast the\nsuggestion spell (save DC 17) through the sensor on\none of those creatures. You don't need to\nconcentrate on this suggestion to maintain it during\nits duration, but it ends if scrying ends. Once used,\nthe suggestion power of the crystal ball can't be used\nagain until the next dawn.\nCrystal Ball of True Seeing. While scrying with\nthe crystal ball, you have truesight with a radius of\n120 feet centered on the spell's sensor.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Crystal Ball", 
        "magicItemRarity": "Very Rare Or Legendary", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Cube of Force": {
        "magicItemCharges": 36, 
        "magicItemDescription": "This cube is about an inch across. Each face has a\ndistinct marking on it that can be pressed. The cube\nstarts with 36 charges, and it regains 1d20 expended\ncharges daily at dawn.\nYou can use an action to press one of the cube's\nfaces, expending a number of charges based on the\nchosen face, as shown in the Cube of Force Faces\ntable. Each face has a different effect. If the cube has\ninsufficient charges remaining, nothing happens.\nOtherwise, a barrier of invisible force springs into\nexistence, forming a cube 15 feet on a side. The\nbarrier is centered on you, moves with you, and lasts\nfor 1 minute, until you use an action to press the\ncube's sixth face, or the cube runs out of charges.\nYou can change the barrier's effect by pressing a\ndifferent face of the cube and expending the\nrequisite number of charges, resetting the duration.\nIf your movement causes the barrier to come into\ncontact with a solid object that can't pass through\nthe cube, you can't move any closer to that object as\nlong as the barrier remains.\nCube of Force Faces\nFace Charges Effect\n1 1 Gases, wind, and fog can't pass through the barrier.\n2 2 Nonliving matter can't pass through the\nbarrier. Walls, floors, and ceilings can pass\nthrough at your discretion.\n3 3 Living matter can't pass through the\nbarrier.\n4 4 Spell effects can't pass through the barrier.\n5 5 Nothing can pass through the barrier.\nWalls, floors, and ceilings can pass through\nat your discretion.\n6 0 The barrier deactivates.\nThe cube loses charges when the barrier is\ntargeted by certain spells or comes into contact with\ncertain spell or magic item effects, as shown in the\ntable below.\nSpell or Item Charges Lost\nDisintegrate 1d12\nHorn of blasting 1d10\nPasswall 1d6\nPrismatic spray 1d20\nWall of fire 1d4\n", 
        "magicItemMaxCharges": 36, 
        "magicItemName": "Cube of Force", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Cubic Gate": {
        "magicItemCharges": 3, 
        "magicItemDescription": "This cube is 3 inches across and radiates palpable\nmagical energy. The six sides of the cube are each\nkeyed to a different plane of existence, one of which\nis the Material Plane. The other sides are linked to\nplanes determined by the GM.\nYou can use an action to press one side of the cube\nto cast the gate spell with it, opening a portal to the\nplane keyed to that side. Alternatively, if you use an\naction to press one side twice, you can cast the plane\nshift spell (save DC 17) with the cube and transport\nthe targets to the plane keyed to that side.\nThe cube has 3 charges. Each use of the cube\nexpends 1 charge. The cube regains 1d3 expended\ncharges daily at dawn.\n", 
        "magicItemMaxCharges": 3, 
        "magicItemName": "Cubic Gate", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Dagger of Venom": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You gain a +1 bonus to attack and damage rolls\nmade with this magic weapon.\nYou can use an action to cause thick, black poison\nto coat the blade. The poison remains for 1 minute\nor until an attack using this weapon hits a creature.\nThat creature must succeed on a DC 15 Constitution\nsaving throw or take 2d10 poison damage and\nbecome poisoned for 1 minute. The dagger can't be\nused this way again until the next dawn.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Dagger of Venom", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Weapon (dagger)", 
        "magicItemWeight": 0
    }, 
    "Dancing Sword": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You can use a bonus action to toss this magic sword\ninto the air and speak the command word. When you\ndo so, the sword begins to hover, flies up to 30 feet,\nand attacks one creature of your choice within 5 feet\nof it. The sword uses your attack roll and ability\nscore modifier to damage rolls.\nWhile the sword hovers, you can use a bonus\naction to cause it to fly up to 30 feet to another spot\nwithin 30 feet of you. As part of the same bonus\naction, you can cause the sword to attack one\ncreature within 5 feet of it.\nAfter the hovering sword attacks for the fourth\ntime, it flies up to 30 feet and tries to return to your\nhand. If you have no hand free, it falls to the ground\nat your feet. If the sword has no unobstructed path\nto you, it moves as close to you as it can and then\nfalls to the ground. It also ceases to hover if you\ngrasp it or move more than 30 feet away from it.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Dancing Sword", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Weapon (any sword)", 
        "magicItemWeight": 0
    }, 
    "Decanter of Endless Water": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This stoppered flask sloshes when shaken, as if it\ncontains water. The decanter weighs 2 pounds.\nYou can use an action to remove the stopper and\nspeak one of three command words, whereupon an\namount of fresh water or salt water (your choice)\npours out of the flask. The water stops pouring out at\nthe start of your next turn. Choose from the\nfollowing options:\n* “Stream” produces 1 gallon of water.\n* “Fountain” produces 5 gallons of water.\n* “Geyser” produces 30 gallons of water that gushes\nforth in a geyser 30 feet long and 1 foot wide. As a\nbonus action while holding the decanter, you can\naim the geyser at a creature you can see within 30\nfeet of you. The target must succeed on a DC 13\nStrength saving throw or take 1d4 bludgeoning\ndamage and fall prone. Instead of a creature, you\ncan target an object that isn't being worn or\ncarried and that weighs no more than 200 pounds.\nThe object is either knocked over or pushed up to\n15 feet away from you.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Decanter of Endless Water", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Deck of Illusions": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This box contains a set of parchment cards. A full\ndeck has 34 cards. A deck found as treasure is\nusually missing 1d20 - 1 cards.\nThe magic of the deck functions only if cards are\ndrawn at random (you can use an altered deck of\nplaying cards to simulate the deck). You can use an\naction to draw a card at random from the deck and\nthrow it to the ground at a point within 30 feet of\nyou.\nAn illusion of one or more creatures forms over\nthe thrown card and remains until dispelled. An\nillusory creature appears real, of the appropriate\nsize, and behaves as if it were a real creature except\nthat it can do no harm. While you are within 120 feet\nof the illusory creature and can see it, you can use an\naction to move it magically anywhere within 30 feet\nof its card. Any physical interaction with the illusory\ncreature reveals it to be an illusion, because objects\npass through it. Someone who uses an action to\nvisually inspect the creature identifies it as illusory\nwith a successful DC 15 Intelligence (Investigation)\ncheck. The creature then appears translucent.\nThe illusion lasts until its card is moved or the\nillusion is dispelled. When the illusion ends, the\nimage on its card disappears, and that card can't be\nused again.\nPlaying Card Illusion\nAce of hearts Red dragon\nKing of hearts Knight and four guards\nQueen of hearts Succubus or incubus\nJack of hearts Druid\nTen of hearts Cloud giant\nNine of hearts Ettin\nEight of hearts Bugbear\nTwo of hearts Goblin\nAce of diamonds Beholder\nKing of diamonds Archmage and mage apprentice\nQueen of diamonds Night hag\nJack of diamonds Assassin\nTen of diamonds Fire giant\nNine of diamonds Ogre mage\nEight of diamonds Gnoll\nTwo of diamonds Kobold\nAce of spades Lich\nKing of spades Priest and two acolytes\nQueen of spades Medusa\nJack of spades Veteran\nTen of spades Frost giant\nNine of spades Troll\nEight of spades Hobgoblin\nTwo of spades Goblin\nAce of clubs Iron golem\nKing of clubs Bandit captain and three bandits\nQueen of clubs Erinyes\nJack of clubs Berserker\nTen of clubs Hill giant\nNine of clubs Ogre\nEight of clubs Orc\nTwo of clubs Kobold\nJokers (2) You (the deck's owner)\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Deck of Illusions", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Deck of Many Things": {
        "magicItemCharges": 0, 
        "magicItemDescription": "Usually found in a box or pouch, this deck contains a\nnumber of cards made of ivory or vellum. Most (75\npercent) of these decks have only thirteen cards, but\nthe rest have twenty-two.\nBefore you draw a card, you must declare how\nmany cards you intend to draw and then draw them\nrandomly (you can use an altered deck of playing\ncards to simulate the deck). Any cards drawn in\nexcess of this number have no effect. Otherwise, as\nsoon as you draw a card from the deck, its magic\ntakes effect. You must draw each card no more than\n1 hour after the previous draw. If you fail to draw\nthe chosen number, the remaining number of cards\nfly from the deck on their own and take effect all at\nonce.\nOnce a card is drawn, it fades from existence.\nUnless the card is the Fool or the Jester, the card\nreappears in the deck, making it possible to draw the\nsame card twice.\nPlaying Card Card\nAce of diamonds Vizier*\nKing of diamonds Sun\nQueen of diamonds Moon\nJack of diamonds Star\nTwo of diamonds Comet*\nAce of hearts The Fates*\nKing of hearts Throne\nQueen of hearts Key\nJack of hearts Knight\nTwo of hearts Gem*\nAce of clubs Talons*\nKing of clubs The Void\nQueen of clubs Flames\nJack of clubs Skull\nTwo of clubs Idiot*\nAce of spades Donjon*\nKing of spades Ruin\nQueen of spades Euryale\nJack of spades Rogue\nTwo of spades Balance*\nJoker (with TM) Fool*\nJoker (without TM) Jester\n*Found only in a deck with twenty-two cards\nBalance. Your mind suffers a wrenching alteration,\ncausing your alignment to change. Lawful becomes\nchaotic, good becomes evil, and vice versa. If you are\ntrue neutral or unaligned, this card has no effect on\nyou.\nComet. If you single-handedly defeat the next\nhostile monster or group of monsters you encounter,\nyou gain experience points enough to gain one level.\nOtherwise, this card has no effect.\nDonjon. You disappear and become entombed in a\nstate of suspended animation in an extradimensional\nsphere. Everything you were wearing and carrying\nstays behind in the space you occupied when you\ndisappeared. You remain imprisoned until you are\nfound and removed from the sphere. You can't be\nlocated by any divination magic, but a wish spell can\nreveal the location of your prison. You draw no more\ncards.\nEuryale. The card's medusa-like visage curses you.\nYou take a -2 penalty on saving throws while cursed\nin this way. Only a god or the magic of The Fates\ncard can end this curse.\nThe Fates. Reality's fabric unravels and spins\nanew, allowing you to avoid or erase one event as if\nit never happened. You can use the card's magic as\nsoon as you draw the card or at any other time\nbefore you die.\nFlames. A powerful devil becomes your enemy.\nThe devil seeks your ruin and plagues your life,\nsavoring your suffering before attempting to slay\nyou. This enmity lasts until either you or the devil\ndies.\nFool. You lose 10,000 XP, discard this card, and\ndraw from the deck again, counting both draws as\none of your declared draws. If losing that much XP\nwould cause you to lose a level, you instead lose an\namount that leaves you with just enough XP to keep\nyour level.\nGem. Twenty-five pieces of jewelry worth 2,000\ngp each or fifty gems worth 1,000 gp each appear at\nyour feet.\nIdiot. Permanently reduce your Intelligence by\n1d4 + 1 (to a minimum score of 1). You can draw one\nadditional card beyond your declared draws.\nJester. You gain 10,000 XP, or you can draw two\nadditional cards beyond your declared draws.\nKey. A rare or rarer magic weapon with which you\nare proficient appears in your hands. The GM\nchooses the weapon.\nKnight. You gain the service of a 4th-level fighter\nwho appears in a space you choose within 30 feet of\nyou. The fighter is of the same race as you and serves\nyou loyally until death, believing the fates have\ndrawn him or her to you. You control this character.\nMoon. You are granted the ability to cast the wish\nspell 1d3 times.\nRogue. A nonplayer character of the GM's choice\nbecomes hostile toward you. The identity of your\nnew enemy isn't known until the NPC or someone\nelse reveals it. Nothing less than a wish spell or\ndivine intervention can end the NPC's hostility\ntoward you.\nRuin. All forms of wealth that you carry or own,\nother than magic items, are lost to you. Portable\nproperty vanishes. Businesses, buildings, and land\nyou own are lost in a way that alters reality the least.\nAny documentation that proves you should own\nsomething lost to this card also disappears.\nSkull. You summon an avatar of death—a ghostly\nhumanoid skeleton clad in a tattered black robe and\ncarrying a spectral scythe. It appears in a space of\nthe GM's choice within 10 feet of you and attacks you,\nwarning all others that you must win the battle alone.\nThe avatar fights until you die or it drops to 0 hit\npoints, whereupon it disappears. If anyone tries to\nhelp you, the helper summons its own avatar of\ndeath. A creature slain by an avatar of death can't be\nrestored to life.\nAvatar of Death\nMedium undead, neutral evil\nArmor Class 20\nHit Points half the hit point maximum of its summoner\nSpeed 60 ft., fly 60 ft. (hover)\nSTR DEX CON INT WIS CHA\n16 (+3) 16 (+3) 16 (+3) 16 (+3) 16 (+3) 16 (+3)\nDamage Immunities necrotic, poison\nCondition Immunities charmed, frightened, paralyzed,\npetrified, poisoned, unconscious\nSenses darkvision 60 ft., truesight 60 ft., passive\nPerception 13\nLanguages all languages known to its summoner\nChallenge — (0 XP)\nIncorporeal Movement. The avatar can move through\nother creatures and objects as if they were difficult\nterrain. It takes 5 (1d10) force damage if it ends its turn\ninside an object.\nTurning Immunity. The avatar is immune to features\nthat turn undead.\nActions\nReaping Scythe. The avatar sweeps its spectral scythe\nthrough a creature within 5 feet of it, dealing 7 (1d8 +\n3) slashing damage plus 4 (1d8) necrotic damage.\nStar. Increase one of your ability scores by 2. The\nscore can exceed 20 but can't exceed 24.\nSun. You gain 50,000 XP, and a wondrous item\n(which the GM determines randomly) appears in\nyour hands.\nTalons. Every magic item you wear or carry\ndisintegrates. Artifacts in your possession aren't\ndestroyed but do vanish.\nThrone. You gain proficiency in the Persuasion\nskill, and you double your proficiency bonus on\nchecks made with that skill. In addition, you gain\nrightful ownership of a small keep somewhere in the\nworld. However, the keep is currently in the hands of\nmonsters, which you must clear out before you can\nclaim the keep as yours.\nVizier. At any time you choose within one year of\ndrawing this card, you can ask a question in\nmeditation and mentally receive a truthful answer to\nthat question. Besides information, the answer helps\nyou solve a puzzling problem or other dilemma. In\nother words, the knowledge comes with wisdom on\nhow to apply it.\nThe Void. This black card spells disaster. Your soul\nis drawn from your body and contained in an object\nin a place of the GM's choice. One or more powerful\nbeings guard the place. While your soul is trapped in\nthis way, your body is incapacitated. A wish spell\ncan't restore your soul, but the spell reveals the\nlocation of the object that holds it. You draw no more\ncards.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Deck of Many Things", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Defender": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You gain a +3 bonus to attack and damage rolls\nmade with this magic weapon.\nThe first time you attack with the sword on each of\nyour turns, you can transfer some or all of the\nsword's bonus to your Armor Class, instead of using\nthe bonus on any attacks that turn. For example, you\ncould reduce the bonus to your attack and damage\nrolls to +1 and gain a +2 bonus to AC. The adjusted\nbonuses remain in effect until the start of your next\nturn, although you must hold the sword to gain a\nbonus to AC from it.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Defender", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Weapon (any sword)", 
        "magicItemWeight": 0
    }, 
    "Demon Armor": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this armor, you gain a +1 bonus to AC,\nand you can understand and speak Abyssal. In\naddition, the armor's clawed gauntlets turn unarmed\nstrikes with your hands into magic weapons that\ndeal slashing damage, with a +1 bonus to attack rolls\nand damage rolls and a damage die of 1d8.\nCurse. Once you don this cursed armor, you can't\ndoff it unless you are targeted by the remove curse\nspell or similar magic. While wearing the armor, you\nhave disadvantage on attack rolls against demons\nand on saving throws against their spells and special\nabilities.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Demon Armor", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Armor (plate)", 
        "magicItemWeight": 0
    }, 
    "Dimensional Shackles": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You can use an action to place these shackles on an\nincapacitated creature. The shackles adjust to fit a\ncreature of Small to Large size. In addition to serving\nas mundane manacles, the shackles prevent a\ncreature bound by them from using any method of\nextradimensional movement, including teleportation\nor travel to a different plane of existence. They don't\nprevent the creature from passing through an\ninterdimensional portal.\nYou and any creature you designate when you use\nthe shackles can use an action to remove them. Once\nevery 30 days, the bound creature can make a DC 30\nStrength (Athletics) check. On a success, the creature\nbreaks free and destroys the shackles.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Dimensional Shackles", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Dragon Scale Mail": {
        "magicItemCharges": 0, 
        "magicItemDescription": "Dragon scale mail is made of the scales of one kind of\ndragon. Sometimes dragons collect their cast-off\nscales and gift them to humanoids. Other times,\nhunters carefully skin and preserve the hide of a\ndead dragon. In either case, dragon scale mail is\nhighly valued.\nWhile wearing this armor, you gain a +1 bonus to\nAC, you have advantage on saving throws against the\nFrightful Presence and breath weapons of dragons,\nand you have resistance to one damage type that is\ndetermined by the kind of dragon that provided the\nscales (see the table).\nAdditionally, you can focus your senses as an\naction to magically discern the distance and\ndirection to the closest dragon within 30 miles of\nyou that is of the same type as the armor. This\nspecial action can't be used again until the next\ndawn.\nDragon Resistance Dragon Resistance\nBlack Acid Gold Fire\nBlue Lightning Green Poison\nBrass Fire Red Fire\nBronze Lightning Silver Cold\nCopper Acid White Cold\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Dragon Scale Mail", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Armor (scale mail)", 
        "magicItemWeight": 0
    }, 
    "Dragon Slayer": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You gain a +1 bonus to attack and damage rolls\nmade with this magic weapon.\nWhen you hit a dragon with this weapon, the\ndragon takes an extra 3d6 damage of the weapon's\ntype. For the purpose of this weapon, “dragon”\nrefers to any creature with the dragon type,\nincluding dragon turtles and wyverns.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Dragon Slayer", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Weapon (any sword)", 
        "magicItemWeight": 0
    }, 
    "Dust of Disappearance": {
        "magicItemCharges": 0, 
        "magicItemDescription": "Found in a small packet, this powder resembles very\nfine sand. There is enough of it for one use. When\nyou use an action to throw the dust into the air, you\nand each creature and object within 10 feet of you\nbecome invisible for 2d4 minutes. The duration is\nthe same for all subjects, and the dust is consumed\nwhen its magic takes effect. If a creature affected by\nthe dust attacks or casts a spell, the invisibility ends\nfor that creature.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Dust of Disappearance", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Dust of Dryness": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This small packet contains 1d6 + 4 pinches of dust.\nYou can use an action to sprinkle a pinch of it over\nwater. The dust turns a cube of water 15 feet on a\nside into one marble-sized pellet, which floats or\nrests near where the dust was sprinkled. The pellet's\nweight is negligible.\nSomeone can use an action to smash the pellet\nagainst a hard surface, causing the pellet to shatter\nand release the water the dust absorbed. Doing so\nends that pellet's magic.\nAn elemental composed mostly of water that is\nexposed to a pinch of the dust must make a DC 13\nConstitution saving throw, taking 10d6 necrotic\ndamage on a failed save, or half as much damage on\na successful one.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Dust of Dryness", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Dust of Sneezing and Choking": {
        "magicItemCharges": 0, 
        "magicItemDescription": "Found in a small container, this powder resembles\nvery fine sand. It appears to be dust of disappearance,\nand an identify spell reveals it to be such. There is\nenough of it for one use.\nWhen you use an action to throw a handful of the\ndust into the air, you and each creature that needs to\nbreathe within 30 feet of you must succeed on a DC\n15 Constitution saving throw or become unable to\nbreathe, while sneezing uncontrollably. A creature\naffected in this way is incapacitated and suffocating.\nAs long as it is conscious, a creature can repeat the\nsaving throw at the end of each of its turns, ending\nthe effect on it on a success. The lesser restoration\nspell can also end the effect on a creature.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Dust of Sneezing and Choking", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Dwarven Plate": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this armor, you gain a +2 bonus to AC.\nIn addition, if an effect moves you against your will\nalong the ground, you can use your reaction to\nreduce the distance you are moved by up to 10 feet.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Dwarven Plate", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Armor (plate)", 
        "magicItemWeight": 0
    }, 
    "Dwarven Thrower": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You gain a +3 bonus to attack and damage rolls\nmade with this magic weapon. It has the thrown\nproperty with a normal range of 20 feet and a long\nrange of 60 feet. When you hit with a ranged attack\nusing this weapon, it deals an extra 1d8 damage or, if\nthe target is a giant, 2d8 damage. Immediately after\nthe attack, the weapon flies back to your hand.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Dwarven Thrower", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Weapon (warhammer)", 
        "magicItemWeight": 0
    }, 
    "Efficient Quiver": {
        "magicItemCharges": 0, 
        "magicItemDescription": "Each of the quiver's three compartments connects to\nan extradimensional space that allows the quiver to\nhold numerous items while never weighing more\nthan 2 pounds. The shortest compartment can hold\nup to sixty arrows, bolts, or similar objects. The\nmidsize compartment holds up to eighteen javelins\nor similar objects. The longest compartment holds\nup to six long objects, such as bows, quarterstaffs, or\nspears.\nYou can draw any item the quiver contains as if\ndoing so from a regular quiver or scabbard.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Efficient Quiver", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Efreeti Bottle": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This painted brass bottle weighs 1 pound. When you\nuse an action to remove the stopper, a cloud of thick\nsmoke flows out of the bottle. At the end of your turn,\nthe smoke disappears with a flash of harmless fire,\nand an efreeti appears in an unoccupied space\nwithin 30 feet of you.\nThe first time the bottle is opened, the GM rolls to\ndetermine what happens.\nd100 Effect\n01–10 The efreeti attacks you. After fighting for 5\nrounds, the efreeti disappears, and the bottle\nloses its magic.\n11–90 The efreeti serves you for 1 hour, doing as you\ncommand. Then the efreeti returns to the bottle,\nand a new stopper contains it. The stopper can't\nbe removed for 24 hours. The next two times the\nbottle is opened, the same effect occurs. If the\nbottle is opened a fourth time, the efreeti\nescapes and disappears, and the bottle loses its\nmagic.\n91–00 The efreeti can cast the wish spell three times for\nyou. It disappears when it grants the final wish or\nafter 1 hour, and the bottle loses its magic.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Efreeti Bottle", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Elemental Gem": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This gem contains a mote of elemental energy. When\nyou use an action to break the gem, an elemental is\nsummoned as if you had cast the conjure elemental\nspell, and the gem's magic is lost. The type of gem\ndetermines the elemental summoned by the spell.\nGem Summoned Elemental\nBlue sapphire Air elemental\nYellow diamond Earth elemental\nRed corundum Fire elemental\nEmerald Water elemental\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Elemental Gem", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Elven Chain": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You gain a +1 bonus to AC while you wear this armor.\nYou are considered proficient with this armor even if\nyou lack proficiency with medium armor.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Elven Chain", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Armor (chain shirt)", 
        "magicItemWeight": 0
    }, 
    "Eversmoking Bottle": {
        "magicItemCharges": 0, 
        "magicItemDescription": "Smoke leaks from the lead-stoppered mouth of this\nbrass bottle, which weighs 1 pound. When you use\nan action to remove the stopper, a cloud of thick\nsmoke pours out in a 60-foot radius from the bottle.\nThe cloud's area is heavily obscured. Each minute\nthe bottle remains open and within the cloud, the\nradius increases by 10 feet until it reaches its\nmaximum radius of 120 feet.\nThe cloud persists as long as the bottle is open.\nClosing the bottle requires you to speak its\ncommand word as an action. Once the bottle is\nclosed, the cloud disperses after 10 minutes. A\nmoderate wind (11 to 20 miles per hour) can also\ndisperse the smoke after 1 minute, and a strong\nwind (21 or more miles per hour) can do so after 1\nround.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Eversmoking Bottle", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Eyes of Charming": {
        "magicItemCharges": 3, 
        "magicItemDescription": "These crystal lenses fit over the eyes. They have 3\ncharges. While wearing them, you can expend 1\ncharge as an action to cast the charm person spell\n(save DC 13) on a humanoid within 30 feet of you,\nprovided that you and the target can see each other.\nThe lenses regain all expended charges daily at dawn.\n", 
        "magicItemMaxCharges": 3, 
        "magicItemName": "Eyes of Charming", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Eyes of Minute Seeing": {
        "magicItemCharges": 0, 
        "magicItemDescription": "These crystal lenses fit over the eyes. While wearing\nthem, you can see much better than normal out to a\nrange of 1 foot. You have advantage on Intelligence\n(Investigation) checks that rely on sight while\nsearching an area or studying an object within that\nrange.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Eyes of Minute Seeing", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Eyes of the Eagle": {
        "magicItemCharges": 0, 
        "magicItemDescription": "These crystal lenses fit over the eyes. While wearing\nthem, you have advantage on Wisdom (Perception)\nchecks that rely on sight. In conditions of clear\nvisibility, you can make out details of even extremely\ndistant creatures and objects as small as 2 feet\nacross.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Eyes of the Eagle", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Feather Token": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This tiny object looks like a feather. Different types\nof feather tokens exist, each with a different singleuse\neffect. The GM chooses the kind of token or\ndetermines it randomly.\nd100 Feather Token d100 Feather Token\n01–20 Anchor 51–65 Swan boat\n21–35 Bird 66–90 Tree\n36–50 Fan 91–00 Whip\nAnchor. You can use an action to touch the token\nto a boat or ship. For the next 24 hours, the vessel\ncan't be moved by any means. Touching the token to\nthe vessel again ends the effect. When the effect ends,\nthe token disappears.\nBird. You can use an action to toss the token 5 feet\ninto the air. The token disappears and an enormous,\nmulticolored bird takes its place. The bird has the\nstatistics of a roc, but it obeys your simple\ncommands and can't attack. It can carry up to 500\npounds while flying at its maximum speed (16 miles\nan hour for a maximum of 144 miles per day, with a\none-hour rest for every 3 hours of flying), or 1,000\npounds at half that speed. The bird disappears after\nflying its maximum distance for a day or if it drops to\n0 hit points. You can dismiss the bird as an action.\nFan. If you are on a boat or ship, you can use an\naction to toss the token up to 10 feet in the air. The\ntoken disappears, and a giant flapping fan takes its\nplace. The fan floats and creates a wind strong\nenough to fill the sails of one ship, increasing its\nspeed by 5 miles per hour for 8 hours. You can\ndismiss the fan as an action.\nSwan Boat. You can use an action to touch the\ntoken to a body of water at least 60 feet in diameter.\nThe token disappears, and a 50-foot-long, 20-footwide\nboat shaped like a swan takes its place. The\nboat is self-propelled and moves across water at a\nspeed of 6 miles per hour. You can use an action\nwhile on the boat to command it to move or to turn\nup to 90 degrees. The boat can carry up to thirty-two\nMedium or smaller creatures. A Large creature\ncounts as four Medium creatures, while a Huge\ncreature counts as nine. The boat remains for 24\nhours and then disappears. You can dismiss the boat\nas an action.\nTree. You must be outdoors to use this token. You\ncan use an action to touch it to an unoccupied space\non the ground. The token disappears, and in its place\na nonmagical oak tree springs into existence. The\ntree is 60 feet tall and has a 5-foot-diameter trunk,\nand its branches at the top spread out in a 20-foot\nradius.\nWhip. You can use an action to throw the token to\na point within 10 feet of you. The token disappears,\nand a floating whip takes its place. You can then use\na bonus action to make a melee spell attack against a\ncreature within 10 feet of the whip, with an attack\nbonus of +9. On a hit, the target takes 1d6 + 5 force\ndamage.\nAs a bonus action on your turn, you can direct the\nwhip to fly up to 20 feet and repeat the attack\nagainst a creature within 10 feet of it. The whip\ndisappears after 1 hour, when you use an action to\ndismiss it, or when you are incapacitated or die.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Feather Token", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Figurine of Wondrous Power": {
        "magicItemCharges": 24, 
        "magicItemDescription": "A figurine of wondrous power is a statuette of a beast\nsmall enough to fit in a pocket. If you use an action to\nspeak the command word and throw the figurine to\na point on the ground within 60 feet of you, the\nfigurine becomes a living creature. If the space\nwhere the creature would appear is occupied by\nother creatures or objects, or if there isn't enough\nspace for the creature, the figurine doesn't become a\ncreature.\nThe creature is friendly to you and your\ncompanions. It understands your languages and\nobeys your spoken commands. If you issue no\ncommands, the creature defends itself but takes no\nother actions.\nThe creature exists for a duration specific to each\nfigurine. At the end of the duration, the creature\nreverts to its figurine form. It reverts to a figurine\nearly if it drops to 0 hit points or if you use an action\nto speak the command word again while touching it.\nWhen the creature becomes a figurine again, its\nproperty can't be used again until a certain amount\nof time has passed, as specified in the figurine's\ndescription.\nBronze Griffon (Rare). This bronze statuette is of\na griffon rampant. It can become a griffon for up to 6\nhours. Once it has been used, it can't be used again\nuntil 5 days have passed.\nEbony Fly (Rare). This ebony statuette is carved\nin the likeness of a horsefly. It can become a giant fly\nfor up to 12 hours and can be ridden as a mount.\nOnce it has been used, it can't be used again until 2\ndays have passed.\nGiant Fly\nLarge beast, unaligned\nArmor Class 11\nHit Points 19 (3d10 + 3)\nSpeed 30 ft., fly 60 ft.\nSTR DEX CON INT WIS CHA\n14 (+2) 13 (+1) 13 (+1) 2 (-4) 10 (+0) 3 (-4)\nSenses darkvision 60 ft., passive Perception 10\nLanguages —\nGolden Lions (Rare). These gold statuettes of\nlions are always created in pairs. You can use one\nfigurine or both simultaneously. Each can become a\nlion for up to 1 hour. Once a lion has been used, it\ncan't be used again until 7 days have passed.\nIvory Goats (Rare). These ivory statuettes of\ngoats are always created in sets of three. Each goat\nlooks unique and functions differently from the\nothers. Their properties are as follows:\n* The goat of traveling can become a Large goat with\nthe same statistics as a riding horse. It has 24\ncharges, and each hour or portion thereof it\nspends in beast form costs 1 charge. While it has\ncharges, you can use it as often as you wish. When\nit runs out of charges, it reverts to a figurine and\ncan't be used again until 7 days have passed, when\nit regains all its charges.\n* The goat of travail becomes a giant goat for up to 3\nhours. Once it has been used, it can't be used again\nuntil 30 days have passed.\n* The goat of terror becomes a giant goat for up to 3\nhours. The goat can't attack, but you can remove\nits horns and use them as weapons. One horn\nbecomes a +1 lance, and the other becomes a +2\nlongsword. Removing a horn requires an action,\nand the weapons disappear and the horns return\nwhen the goat reverts to figurine form. In addition,\nthe goat radiates a 30-foot-radius aura of terror\nwhile you are riding it. Any creature hostile to you\nthat starts its turn in the aura must succeed on a\nDC 15 Wisdom saving throw or be frightened of\nthe goat for 1 minute, or until the goat reverts to\nfigurine form. The frightened creature can repeat\nthe saving throw at the end of each of its turns,\nending the effect on itself on a success. Once it\nsuccessfully saves against the effect, a creature is\nimmune to the goat's aura for the next 24 hours.\nOnce the figurine has been used, it can't be used\nagain until 15 days have passed.\nMarble Elephant (Rare). This marble statuette is\nabout 4 inches high and long. It can become an\nelephant for up to 24 hours. Once it has been used, it\ncan't be used again until 7 days have passed.\nObsidian Steed (Very Rare). This polished\nobsidian horse can become a nightmare for up to 24\nhours. The nightmare fights only to defend itself.\nOnce it has been used, it can't be used again until 5\ndays have passed.\nIf you have a good alignment, the figurine has a 10\npercent chance each time you use it to ignore your\norders, including a command to revert to figurine\nform. If you mount the nightmare while it is ignoring\nyour orders, you and the nightmare are instantly\ntransported to a random location on the plane of\nHades, where the nightmare reverts to figurine form.\nOnyx Dog (Rare). This onyx statuette of a dog can\nbecome a mastiff for up to 6 hours. The mastiff has\nan Intelligence of 8 and can speak Common. It also\nhas darkvision out to a range of 60 feet and can see\ninvisible creatures and objects within that range.\nOnce it has been used, it can't be used again until 7\ndays have passed.\nSerpentine Owl (Rare). This serpentine statuette\nof an owl can become a giant owl for up to 8 hours.\nOnce it has been used, it can't be used again until 2\ndays have passed. The owl can telepathically\ncommunicate with you at any range if you and it are\non the same plane of existence.\nSilver Raven (Uncommon). This silver statuette of\na raven can become a raven for up to 12 hours. Once\nit has been used, it can't be used again until 2 days\nhave passed. While in raven form, the figurine allows\nyou to cast the animal messenger spell on it at will.\n", 
        "magicItemMaxCharges": 24, 
        "magicItemName": "Figurine of Wondrous Power", 
        "magicItemRarity": "Rarity By Figurine", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Flame Tongue": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You can use a bonus action to speak this magic\nsword's command word, causing flames to erupt\nfrom the blade. These flames shed bright light in a\n40-foot radius and dim light for an additional 40 feet.\nWhile the sword is ablaze, it deals an extra 2d6 fire\ndamage to any target it hits. The flames last until you\nuse a bonus action to speak the command word\nagain or until you drop or sheathe the sword.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Flame Tongue", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Weapon (any sword)", 
        "magicItemWeight": 0
    }, 
    "Folding Boat": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This object appears as a wooden box that measures\n12 inches long, 6 inches wide, and 6 inches deep. It\nweighs 4 pounds and floats. It can be opened to store\nitems inside. This item also has three command\nwords, each requiring you to use an action to speak\nit.\nOne command word causes the box to unfold into\na boat 10 feet long, 4 feet wide, and 2 feet deep. The\nboat has one pair of oars, an anchor, a mast, and a\nlateen sail. The boat can hold up to four Medium\ncreatures comfortably.\nThe second command word causes the box to\nunfold into a ship 24 feet long, 8 feet wide, and 6 feet\ndeep. The ship has a deck, rowing seats, five sets of\noars, a steering oar, an anchor, a deck cabin, and a\nmast with a square sail. The ship can hold fifteen\nMedium creatures comfortably.\nWhen the box becomes a vessel, its weight\nbecomes that of a normal vessel its size, and\nanything that was stored in the box remains in the\nboat.\nThe third command word causes the folding boat\nto fold back into a box, provided that no creatures\nare aboard. Any objects in the vessel that can't fit\ninside the box remain outside the box as it folds. Any\nobjects in the vessel that can fit inside the box do so.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Folding Boat", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Frost Brand": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you hit with an attack using this magic sword,\nthe target takes an extra 1d6 cold damage. In\naddition, while you hold the sword, you have\nresistance to fire damage.\nIn freezing temperatures, the blade sheds bright\nlight in a 10-foot radius and dim light for an\nadditional 10 feet.\nWhen you draw this weapon, you can extinguish\nall nonmagical flames within 30 feet of you. This\nproperty can be used no more than once per hour.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Frost Brand", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Weapon (any sword)", 
        "magicItemWeight": 0
    }, 
    "Gauntlets of Ogre Power": {
        "magicItemCharges": 0, 
        "magicItemDescription": "Your Strength score is 19 while you wear these\ngauntlets. They have no effect on you if your\nStrength is already 19 or higher.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Gauntlets of Ogre Power", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Gem of Brightness": {
        "magicItemCharges": 50, 
        "magicItemDescription": "This prism has 50 charges. While you are holding it,\nyou can use an action to speak one of three\ncommand words to cause one of the following\neffects:\n* The first command word causes the gem to shed\nbright light in a 30-foot radius and dim light for an\nadditional 30 feet. This effect doesn't expend a\ncharge. It lasts until you use a bonus action to\nrepeat the command word or until you use\nanother function of the gem.\n* The second command word expends 1 charge and\ncauses the gem to fire a brilliant beam of light at\none creature you can see within 60 feet of you. The\ncreature must succeed on a DC 15 Constitution\nsaving throw or become blinded for 1 minute. The\ncreature can repeat the saving throw at the end of\neach of its turns, ending the effect on itself on a\nsuccess.\n* The third command word expends 5 charges and\ncauses the gem to flare with blinding light in a 30-\nfoot cone originating from it. Each creature in the\ncone must make a saving throw as if struck by the\nbeam created with the second command word.\nWhen all of the gem's charges are expended, the gem\nbecomes a nonmagical jewel worth 50 gp.\n", 
        "magicItemMaxCharges": 50, 
        "magicItemName": "Gem of Brightness", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Gem of Seeing": {
        "magicItemCharges": 3, 
        "magicItemDescription": "This gem has 3 charges. As an action, you can speak\nthe gem's command word and expend 1 charge. For\nthe next 10 minutes, you have truesight out to 120\nfeet when you peer through the gem.\nThe gem regains 1d3 expended charges daily at\ndawn.\n", 
        "magicItemMaxCharges": 3, 
        "magicItemName": "Gem of Seeing", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Giant Slayer": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You gain a +1 bonus to attack and damage rolls\nmade with this magic weapon.\nWhen you hit a giant with it, the giant takes an\nextra 2d6 damage of the weapon's type and must\nsucceed on a DC 15 Strength saving throw or fall\nprone. For the purpose of this weapon, “giant” refers\nto any creature with the giant type, including ettins\nand trolls.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Giant Slayer", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Weapon (any axe or sword)", 
        "magicItemWeight": 0
    }, 
    "Glamoured Studded Leather": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this armor, you gain a +1 bonus to AC.\nYou can also use a bonus action to speak the armor's\ncommand word and cause the armor to assume the\nappearance of a normal set of clothing or some other\nkind of armor. You decide what it looks like,\nincluding color, style, and accessories, but the armor\nretains its normal bulk and weight. The illusory\nappearance lasts until you use this property again or\nremove the armor.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Glamoured Studded Leather", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Armor (studded leather)", 
        "magicItemWeight": 0
    }, 
    "Gloves of Missile Snaring": {
        "magicItemCharges": 0, 
        "magicItemDescription": "These gloves seem to almost meld into your hands\nwhen you don them. When a ranged weapon attack\nhits you while you're wearing them, you can use\nyour reaction to reduce the damage by 1d10 + your\nDexterity modifier, provided that you have a free\nhand. If you reduce the damage to 0, you can catch\nthe missile if it is small enough for you to hold in that\nhand.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Gloves of Missile Snaring", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Gloves of Swimming and Climbing": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing these gloves, climbing and swimming\ndon't cost you extra movement, and you gain a +5\nbonus to Strength (Athletics) checks made to climb\nor swim.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Gloves of Swimming and Climbing", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Goggles of Night": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing these dark lenses, you have\ndarkvision out to a range of 60 feet. If you already\nhave darkvision, wearing the goggles increases its\nrange by 60 feet.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Goggles of Night", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Hammer of Thunderbolts": {
        "magicItemCharges": 5, 
        "magicItemDescription": "You gain a +1 bonus to attack and damage rolls\nmade with this magic weapon.\nGiant's Bane (Requires Attunement). You must\nbe wearing a belt of giant strength (any variety) and\ngauntlets of ogre power to attune to this weapon. The\nattunement ends if you take off either of those items.\nWhile you are attuned to this weapon and holding it,\nyour Strength score increases by 4 and can exceed\n20, but not 30. When you roll a 20 on an attack roll\nmade with this weapon against a giant, the giant\nmust succeed on a DC 17 Constitution saving throw\nor die.\nThe hammer also has 5 charges. While attuned to\nit, you can expend 1 charge and make a ranged\nweapon attack with the hammer, hurling it as if it\nhad the thrown property with a normal range of 20\nfeet and a long range of 60 feet. If the attack hits, the\nhammer unleashes a thunderclap audible out to 300\nfeet. The target and every creature within 30 feet of\nit must succeed on a DC 17 Constitution saving\nthrow or be stunned until the end of your next turn.\nThe hammer regains 1d4 + 1 expended charges daily\nat dawn.\n", 
        "magicItemMaxCharges": 5, 
        "magicItemName": "Hammer of Thunderbolts", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Weapon (maul)", 
        "magicItemWeight": 0
    }, 
    "Handy Haversack": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This backpack has a central pouch and two side\npouches, each of which is an extradimensional space.\nEach side pouch can hold up to 20 pounds of\nmaterial, not exceeding a volume of 2 cubic feet. The\nlarge central pouch can hold up to 8 cubic feet or 80\npounds of material. The backpack always weighs 5\npounds, regardless of its contents.\nPlacing an object in the haversack follows the\nnormal rules for interacting with objects. Retrieving\nan item from the haversack requires you to use an\naction. When you reach into the haversack for a\nspecific item, the item is always magically on top.\nThe haversack has a few limitations. If it is\noverloaded, or if a sharp object pierces it or tears it,\nthe haversack ruptures and is destroyed. If the\nhaversack is destroyed, its contents are lost forever,\nalthough an artifact always turns up again\nsomewhere. If the haversack is turned inside out, its\ncontents spill forth, unharmed, and the haversack\nmust be put right before it can be used again. If a\nbreathing creature is placed within the haversack,\nthe creature can survive for up to 10 minutes, after\nwhich time it begins to suffocate.\nPlacing the haversack inside an extradimensional\nspace created by a bag of holding, portable hole, or\nsimilar item instantly destroys both items and opens\na gate to the Astral Plane. The gate originates where\nthe one item was placed inside the other. Any\ncreature within 10 feet of the gate is sucked through\nit and deposited in a random location on the Astral\nPlane. The gate then closes. The gate is one-way only\nand can't be reopened.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Handy Haversack", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Hat of Disguise": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this hat, you can use an action to cast\nthe disguise self spell from it at will. The spell ends if\nthe hat is removed.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Hat of Disguise", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Headband of Intellect": {
        "magicItemCharges": 0, 
        "magicItemDescription": "Your Intelligence score is 19 while you wear this\nheadband. It has no effect on you if your Intelligence\nis already 19 or higher.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Headband of Intellect", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Helm of Brilliance": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This dazzling helm is set with 1d10 diamonds, 2d10\nrubies, 3d10 fire opals, and 4d10 opals. Any gem\npried from the helm crumbles to dust. When all the\ngems are removed or destroyed, the helm loses its\nmagic.\nYou gain the following benefits while wearing it:\n* You can use an action to cast one of the following\nspells (save DC 18), using one of the helm's gems\nof the specified type as a component: daylight\n(opal), fireball (fire opal), prismatic spray\n(diamond), or wall of fire (ruby). The gem is\ndestroyed when the spell is cast and disappears\nfrom the helm.\n* As long as it has at least one diamond, the helm\nemits dim light in a 30-foot radius when at least\none undead is within that area. Any undead that\nstarts its turn in that area takes 1d6 radiant\ndamage.\n* As long as the helm has at least one ruby, you have\nresistance to fire damage.\n* As long as the helm has at least one fire opal, you\ncan use an action and speak a command word to\ncause one weapon you are holding to burst into\nflames. The flames emit bright light in a 10-foot\nradius and dim light for an additional 10 feet. The\nflames are harmless to you and the weapon. When\nyou hit with an attack using the blazing weapon,\nthe target takes an extra 1d6 fire damage. The\nflames last until you use a bonus action to speak\nthe command word again or until you drop or\nstow the weapon.\nRoll a d20 if you are wearing the helm and take\nfire damage as a result of failing a saving throw\nagainst a spell. On a roll of 1, the helm emits beams\nof light from its remaining gems. Each creature\nwithin 60 feet of the helm other than you must\nsucceed on a DC 17 Dexterity saving throw or be\nstruck by a beam, taking radiant damage equal to the\nnumber of gems in the helm. The helm and its gems\nare then destroyed.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Helm of Brilliance", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Helm of Comprehending Languages": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this helm, you can use an action to\ncast the comprehend languages spell from it at will.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Helm of Comprehending Languages", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Helm of Telepathy": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this helm, you can use an action to\ncast the detect thoughts spell (save DC 13) from it. As\nlong as you maintain concentration on the spell, you\ncan use a bonus action to send a telepathic message\nto a creature you are focused on. It can reply—using\na bonus action to do so—while your focus on it\ncontinues.\nWhile focusing on a creature with detect thoughts,\nyou can use an action to cast the suggestion spell\n(save DC 13) from the helm on that creature. Once\nused, the suggestion property can't be used again\nuntil the next dawn.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Helm of Telepathy", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Helm of Teleportation": {
        "magicItemCharges": 3, 
        "magicItemDescription": "This helm has 3 charges. While wearing it, you can\nuse an action and expend 1 charge to cast the\nteleport spell from it. The helm regains 1d3\nexpended charges daily at dawn.\n", 
        "magicItemMaxCharges": 3, 
        "magicItemName": "Helm of Teleportation", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Holy Avenger": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You gain a +3 bonus to attack and damage rolls\nmade with this magic weapon. When you hit a fiend\nor an undead with it, that creature takes an extra\n2d10 radiant damage.\nWhile you hold the drawn sword, it creates an\naura in a 10-foot radius around you. You and all\ncreatures friendly to you in the aura have advantage\non saving throws against spells and other magical\neffects. If you have 17 or more levels in the paladin\nclass, the radius of the aura increases to 30 feet.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Holy Avenger", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Weapon (any sword)", 
        "magicItemWeight": 0
    }, 
    "Horn of Blasting": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You can use an action to speak the horn's command\nword and then blow the horn, which emits a\nthunderous blast in a 30-foot cone that is audible\n600 feet away. Each creature in the cone must make\na DC 15 Constitution saving throw. On a failed save, a\ncreature takes 5d6 thunder damage and is deafened\nfor 1 minute. On a successful save, a creature takes\nhalf as much damage and isn't deafened. Creatures\nand objects made of glass or crystal have\ndisadvantage on the saving throw and take 10d6\nthunder damage instead of 5d6.\nEach use of the horn's magic has a 20 percent\nchance of causing the horn to explode. The explosion\ndeals 10d6 fire damage to the blower and destroys\nthe horn.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Horn of Blasting", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Horn of Valhalla": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You can use an action to blow this horn. In response,\nwarrior spirits from the Valhalla appear within 60\nfeet of you. They use the statistics of a berserker.\nThey return to Valhalla after 1 hour or when they\ndrop to 0 hit points. Once you use the horn, it can't\nbe used again until 7 days have passed.\nFour types of horn of Valhalla are known to exist,\neach made of a different metal. The horn's type\ndetermines how many berserkers answer its\nsummons, as well as the requirement for its use. The\nGM chooses the horn's type or determines it\nrandomly.\nd100 Horn\nType\nBerserkers\nSummoned\nRequirement\n01–40 Silver 2d4 + 2 None\n41–75 Brass 3d4 + 3 Proficiency with all\nsimple weapons\n76–90 Bronze 4d4 + 4 Proficiency with all\nmedium armor\n91–00 Iron 5d4 + 5 Proficiency with all\nmartial weapons\nIf you blow the horn without meeting its\nrequirement, the summoned berserkers attack you.\nIf you meet the requirement, they are friendly to you\nand your companions and follow your commands.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Horn of Valhalla", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Horseshoes of Speed": {
        "magicItemCharges": 0, 
        "magicItemDescription": "These iron horseshoes come in a set of four. While\nall four shoes are affixed to the hooves of a horse or\nsimilar creature, they increase the creature's\nwalking speed by 30 feet.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Horseshoes of Speed", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Horseshoes of a Zephyr": {
        "magicItemCharges": 0, 
        "magicItemDescription": "These iron horseshoes come in a set of four. While\nall four shoes are affixed to the hooves of a horse or\nsimilar creature, they allow the creature to move\nnormally while floating 4 inches above the ground.\nThis effect means the creature can cross or stand\nabove nonsolid or unstable surfaces, such as water\nor lava. The creature leaves no tracks and ignores\ndifficult terrain. In addition, the creature can move\nat normal speed for up to 12 hours a day without\nsuffering exhaustion from a forced march.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Horseshoes of a Zephyr", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Immovable Rod": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This flat iron rod has a button on one end. You can\nuse an action to press the button, which causes the\nrod to become magically fixed in place. Until you or\nanother creature uses an action to push the button\nagain, the rod doesn't move, even if it is defying\ngravity. The rod can hold up to 8,000 pounds of\nweight. More weight causes the rod to deactivate\nand fall. A creature can use an action to make a DC\n30 Strength check, moving the fixed rod up to 10 feet\non a success.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Immovable Rod", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Rod", 
        "magicItemWeight": 0
    }, 
    "Instant Fortress": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You can use an action to place this 1-inch metal cube\non the ground and speak its command word. The\ncube rapidly grows into a fortress that remains until\nyou use an action to speak the command word that\ndismisses it, which works only if the fortress is\nempty.\nThe fortress is a square tower, 20 feet on a side\nand 30 feet high, with arrow slits on all sides and a\nbattlement atop it. Its interior is divided into two\nfloors, with a ladder running along one wall to\nconnect them. The ladder ends at a trapdoor leading\nto the roof. When activated, the tower has a small\ndoor on the side facing you. The door opens only at\nyour command, which you can speak as a bonus\naction. It is immune to the knock spell and similar\nmagic, such as that of a chime of opening.\nEach creature in the area where the fortress\nappears must make a DC 15 Dexterity saving throw,\ntaking 10d10 bludgeoning damage on a failed save,\nor half as much damage on a successful one. In either\ncase, the creature is pushed to an unoccupied space\noutside but next to the fortress. Objects in the area\nthat aren't being worn or carried take this damage\nand are pushed automatically.\nThe tower is made of adamantine, and its magic\nprevents it from being tipped over. The roof, the\ndoor, and the walls each have 100 hit points,\nimmunity to damage from nonmagical weapons\nexcluding siege weapons, and resistance to all other\ndamage. Only a wish spell can repair the fortress\n(this use of the spell counts as replicating a spell of\n8th level or lower). Each casting of wish causes the\nroof, the door, or one wall to regain 50 hit points.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Instant Fortress", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Ioun Stone": {
        "magicItemCharges": 0, 
        "magicItemDescription": "An Ioun stone is named after Ioun, a god of\nknowledge and prophecy revered on some worlds.\nMany types of Ioun stone exist, each type a distinct\ncombination of shape and color.\nWhen you use an action to toss one of these stones\ninto the air, the stone orbits your head at a distance\nof 1d3 feet and confers a benefit to you. Thereafter,\nanother creature must use an action to grasp or net\nthe stone to separate it from you, either by making a\nsuccessful attack roll against AC 24 or a successful\nDC 24 Dexterity (Acrobatics) check. You can use an\naction to seize and stow the stone, ending its effect.\nA stone has AC 24, 10 hit points, and resistance to\nall damage. It is considered to be an object that is\nbeing worn while it orbits your head.\nAbsorption (Very Rare). While this pale lavender\nellipsoid orbits your head, you can use your reaction\nto cancel a spell of 4th level or lower cast by a\ncreature you can see and targeting only you.\nOnce the stone has canceled 20 levels of spells, it\nburns out and turns dull gray, losing its magic. If you\nare targeted by a spell whose level is higher than the\nnumber of spell levels the stone has left, the stone\ncan't cancelit.\nAgility (Very Rare). Your Dexterity score\nincreases by 2, to a maximum of 20, while this deep\nred sphere orbits your head.\nAwareness (Rare). You can't be surprised while\nthis dark blue rhomboid orbits your head.\nFortitude (Very Rare). Your Constitution score\nincreases by 2, to a maximum of 20, while this pink\nrhomboid orbits your head.\nGreater Absorption (Legendary). While this\nmarbled lavender and green ellipsoid orbits your\nhead, you can use your reaction to cancel a spell of\n8th level or lower cast by a creature you can see and\ntargeting only you.\nOnce the stone has canceled 50 levels of spells, it\nburns out and turns dull gray, losing its magic. If you\nare targeted by a spell whose level is higher than the\nnumber of spell levels the stone has left, the stone\ncan't cancel it.\nInsight (Very Rare). Your Wisdom score\nincreases by 2, to a maximum of 20, while this\nincandescent blue sphere orbits your head.\nIntellect (Very Rare). Your Intelligence score\nincreases by 2, to a maximum of 20, while this\nmarbled scarlet and blue sphere orbits your head.\nLeadership (Very Rare). Your Charisma score\nincreases by 2, to a maximum of 20, while this\nmarbled pink and green sphere orbits your head.\nMastery (Legendary). Your proficiency bonus\nincreases by 1 while this pale green prism orbits\nyour head.\nProtection (Rare). You gain a +1 bonus to AC\nwhile this dusty rose prism orbits your head.\nRegeneration (Legendary). You regain 15 hit\npoints at the end of each hour this pearly white\nspindle orbits your head, provided that you have at\nleast 1 hit point.\nReserve (Rare). This vibrant purple prism stores\nspells cast into it, holding them until you use them.\nThe stone can store up to 3 levels worth of spells at a\ntime. When found, it contains 1d4 - 1 levels of\nstored spells chosen by the GM.\nAny creature can cast a spell of 1st through 3rd\nlevel into the stone by touching it as the spell is cast.\nThe spell has no effect, other than to be stored in the\nstone. If the stone can't hold the spell, the spell is\nexpended without effect. The level of the slot used to\ncast the spell determines how much space it uses.\nWhile this stone orbits your head, you can cast any\nspell stored in it. The spell uses the slot level, spell\nsave DC, spell attack bonus, and spellcasting ability\nof the original caster, but is otherwise treated as if\nyou cast the spell. The spell cast from the stone is no\nlonger stored in it, freeing up space.\nStrength (Very Rare). Your Strength score\nincreases by 2, to a maximum of 20, while this pale\nblue rhomboid orbits your head.\nSustenance (Rare). You don't need to eat or drink\nwhile this clear spindle orbits your head.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Ioun Stone", 
        "magicItemRarity": "Rarity Varies", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Iron Bands of Binding": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This rusty iron sphere measures 3 inches in\ndiameter and weighs 1 pound. You can use an action\nto speak the command word and throw the sphere at\na Huge or smaller creature you can see within 60\nfeet of you. As the sphere moves through the air, it\nopens into a tangle of metal bands.\nMake a ranged attack roll with an attack bonus\nequal to your Dexterity modifier plus your\nproficiency bonus. On a hit, the target is restrained\nuntil you take a bonus action to speak the command\nword again to release it. Doing so, or missing with\nthe attack, causes the bands to contract and become\na sphere once more.\nA creature, including the one restrained, can use\nan action to make a DC 20 Strength check to break\nthe iron bands. On a success, the item is destroyed,\nand the restrained creature is freed. If the check fails,\nany further attempts made by that creature\nautomatically fail until 24 hours have elapsed.\nOnce the bands are used, they can't be used again\nuntil the next dawn.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Iron Bands of Binding", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Iron Flask": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This iron bottle has a brass stopper. You can use an\naction to speak the flask's command word, targeting\na creature that you can see within 60 feet of you. If\nthe target is native to a plane of existence other than\nthe one you're on, the target must succeed on a DC\n17 Wisdom saving throw or be trapped in the flask.\nIf the target has been trapped by the flask before, it\nhas advantage on the saving throw. Once trapped, a\ncreature remains in the flask until released. The flask\ncan hold only one creature at a time. A creature\ntrapped in the flask doesn't need to breathe, eat, or\ndrink and doesn't age.\nYou can use an action to remove the flask's\nstopper and release the creature the flask contains.\nThe creature is friendly to you and your companions\nfor 1 hour and obeys your commands for that\nduration. If you give no commands or give it a\ncommand that is likely to result in its death, it\ndefends itself but otherwise takes no actions. At the\nend of the duration, the creature acts in accordance\nwith its normal disposition and alignment.\nAn identify spell reveals that a creature is inside\nthe flask, but the only way to determine the type of\ncreature is to open the flask. A newly discovered\nbottle might already contain a creature chosen by\nthe GM or determined randomly.\nd100 Contents\n1-50 Empty\n51-54 Demon (type 1)\n55-58 Demon (type 2)\n59-62 Demon (type 3)\n63-64 Demon (type 4)\n65 Demon (type 5)\n66 Demon (type 6)\n67 Deva\n68-69 Devil (greater)\n70-73 Devil (lesser)\n74-75 Djinni\n76-77 Efreeti\n78-83 Elemental (any)\n84-86 Invisible stalker\n87-90 Night hag\n91 Planetar\n92-95 Salamander\n96 Solar\n97-99 Succubus/incubus\n100 Xorn\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Iron Flask", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Javelin of Lightning": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This javelin is a magic weapon. When you hurl it and\nspeak its command word, it transforms into a bolt of\nlightning, forming a line 5 feet wide that extends out\nfrom you to a target within 120 feet. Each creature in\nthe line excluding you and the target must make a\nDC 13 Dexterity saving throw, taking 4d6 lightning\ndamage on a failed save, and half as much damage on\na successful one. The lightning bolt turns back into a\njavelin when it reaches the target. Make a ranged\nweapon attack against the target. On a hit, the target\ntakes damage from the javelin plus 4d6 lightning\ndamage.\nThe javelin's property can't be used again until the\nnext dawn. In the meantime, the javelin can still be\nused as a magic weapon.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Javelin of Lightning", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Weapon (javelin)", 
        "magicItemWeight": 0
    }, 
    "Lantern of Revealing": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While lit, this hooded lantern burns for 6 hours on 1\npint of oil, shedding bright light in a 30-foot radius\nand dim light for an additional 30 feet. Invisible\ncreatures and objects are visible as long as they are\nin the lantern's bright light. You can use an action to\nlower the hood, reducing the light to dim light in a 5-\nfoot radius.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Lantern of Revealing", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Luck Blade": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You gain a +1 bonus to attack and damage rolls\nmade with this magic weapon. While the sword is on\nyour person, you also gain a +1 bonus to saving\nthrows.\nLuck. If the sword is on your person, you can call\non its luck (no action required) to reroll one attack\nroll, ability check, or saving throw you dislike. You\nmust use the second roll. This property can't be used\nagain until the next dawn.\nWish. The sword has 1d4 – 1 charges. While\nholding it, you can use an action to expend 1 charge\nand cast the wish spell from it. This property can't be\nused again until the next dawn. The sword loses this\nproperty if it has no charges.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Luck Blade", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Weapon (any sword)", 
        "magicItemWeight": 0
    }, 
    "Mace of Disruption": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you hit a fiend or an undead with this magic\nweapon, that creature takes an extra 2d6 radiant\ndamage. If the target has 25 hit points or fewer after\ntaking this damage, it must succeed on a DC 15\nWisdom saving throw or be destroyed. On a\nsuccessful save, the creature becomes frightened of\nyou until the end of your next turn.\nWhile you hold this weapon, it sheds bright light in\na 20-foot radius and dim light for an additional 20\nfeet.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Mace of Disruption", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Weapon (mace)", 
        "magicItemWeight": 0
    }, 
    "Mace of Smiting": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You gain a +1 bonus to attack and damage rolls\nmade with this magic weapon. The bonus increases\nto +3 when you use the mace to attack a construct.\nWhen you roll a 20 on an attack roll made with\nthis weapon, the target takes an extra 2d6\nbludgeoning damage, or 4d6 bludgeoning damage if\nit's a construct. If a construct has 25 hit points or\nfewer after taking this damage, it is destroyed.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Mace of Smiting", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Weapon (mace)", 
        "magicItemWeight": 0
    }, 
    "Mace of Terror": {
        "magicItemCharges": 3, 
        "magicItemDescription": "This magic weapon has 3 charges. While holding it,\nyou can use an action and expend 1 charge to release\na wave of terror. Each creature of your choice in a\n30-foot radius extending from you must succeed on\na DC 15 Wisdom saving throw or become frightened\nof you for 1 minute. While it is frightened in this way,\na creature must spend its turns trying to move as far\naway from you as it can, and it can't willingly move\nto a space within 30 feet of you. It also can't take\nreactions. For its action, it can use only the Dash\naction or try to escape from an effect that prevents it\nfrom moving. If it has nowhere it can move, the\ncreature can use the Dodge action. At the end of each\nof its turns, a creature can repeat the saving throw,\nending the effect on itself on a success.\nThe mace regains 1d3 expended charges daily at\ndawn.\n", 
        "magicItemMaxCharges": 3, 
        "magicItemName": "Mace of Terror", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Weapon (mace)", 
        "magicItemWeight": 0
    }, 
    "Mantle of Spell Resistance": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You have advantage on saving throws against spells\nwhile you wear this cloak.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Mantle of Spell Resistance", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Manual of Bodily Health": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This book contains health and diet tips, and its\nwords are charged with magic. If you spend 48 hours\nover a period of 6 days or fewer studying the book's\ncontents and practicing its guidelines, your\nConstitution score increases by 2, as does your\nmaximum for that score. The manual then loses its\nmagic, but regains it in a century.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Manual of Bodily Health", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Manual of Gainful Exercise": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This book describes fitness exercises, and its words\nare charged with magic. If you spend 48 hours over a\nperiod of 6 days or fewer studying the book's\ncontents and practicing its guidelines, your Strength\nscore increases by 2, as does your maximum for that\nscore. The manual then loses its magic, but regains it\nin a century.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Manual of Gainful Exercise", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Manual of Golems": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This tome contains information and incantations\nnecessary to make a particular type of golem. The\nGM chooses the type or determines it randomly. To\ndecipher and use the manual, you must be a\nspellcaster with at least two 5th-level spell slots. A\ncreature that can't use a manual of golems and\nattempts to read it takes 6d6 psychic damage.\nd20 Golem Time Cost\n1–5 Clay 30 days 65,000 gp\n6–17 Flesh 60 days 50,000 gp\n18 Iron 120 days 100,000 gp\n19–20 Stone 90 days 80,000 gp\nTo create a golem, you must spend the time shown\non the table, working without interruption with the\nmanual at hand and resting no more than 8 hours\nper day. You must also pay the specified cost to\npurchase supplies.\nOnce you finish creating the golem, the book is\nconsumed in eldritch flames. The golem becomes\nanimate when the ashes of the manual are sprinkled\non it. It is under your control, and it understands and\nobeys your spoken commands.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Manual of Golems", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Manual of Quickness of Action": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This book contains coordination and balance\nexercises, and its words are charged with magic. If\nyou spend 48 hours over a period of 6 days or fewer\nstudying the book's contents and practicing its\nguidelines, your Dexterity score increases by 2, as\ndoes your maximum for that score. The manual then\nloses its magic, but regains it in a century.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Manual of Quickness of Action", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Marvelous Pigments": {
        "magicItemCharges": 0, 
        "magicItemDescription": "Typically found in 1d4 pots inside a fine wooden box\nwith a brush (weighing 1 pound in total), these\npigments allow you to create three-dimensional\nobjects by painting them in two dimensions. The\npaint flows from the brush to form the desired\nobject as you concentrate on its image.\nEach pot of paint is sufficient to cover 1,000\nsquare feet of a surface, which lets you create\ninanimate objects or terrain features—such as a\ndoor, a pit, flowers, trees, cells, rooms, or weapons—\nthat are up to 10,000 cubic feet. It takes 10 minutes\nto cover 100 square feet.\nWhen you complete the painting, the object or\nterrain feature depicted becomes a real, nonmagical\nobject. Thus, painting a door on a wall creates an\nactual door that can be opened to whatever is\nbeyond. Painting a pit on a floor creates a real pit,\nand its depth counts against the total area of objects\nyou create.\nNothing created by the pigments can have a value\ngreater than 25 gp. If you paint an object of greater\nvalue (such as a diamond or a pile of gold), the object\nlooks authentic, but close inspection reveals it is\nmade from paste, bone, or some other worthless\nmaterial.\nIf you paint a form of energy such as fire or\nlightning, the energy appears but dissipates as soon\nas you complete the painting, doing no harm to\nanything.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Marvelous Pigments", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Medallion of Thoughts": {
        "magicItemCharges": 3, 
        "magicItemDescription": "The medallion has 3 charges. While wearing it, you\ncan use an action and expend 1 charge to cast the\ndetect thoughts spell (save DC 13) from it. The\nmedallion regains 1d3 expended charges daily at\ndawn.\n", 
        "magicItemMaxCharges": 3, 
        "magicItemName": "Medallion of Thoughts", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Mirror of Life Trapping": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When this 4-foot-tall mirror is viewed indirectly, its\nsurface shows faint images of creatures. The mirror\nweighs 50 pounds, and it has AC 11, 10 hit points,\nand vulnerability to bludgeoning damage. It shatters\nand is destroyed when reduced to 0 hit points.\nIf the mirror is hanging on a vertical surface and\nyou are within 5 feet of it, you can use an action to\nspeak its command word and activate it. It remains\nactivated until you use an action to speak the\ncommand word again.\nAny creature other than you that sees its reflection\nin the activated mirror while within 30 feet of it\nmust succeed on a DC 15 Charisma saving throw or\nbe trapped, along with anything it is wearing or\ncarrying, in one of the mirror's twelve\nextradimensional cells. This saving throw is made\nwith advantage if the creature knows the mirror's\nnature, and constructs succeed on the saving throw\nautomatically.\nAn extradimensional cell is an infinite expanse\nfilled with thick fog that reduces visibility to 10 feet.\nCreatures trapped in the mirror's cells don't age, and\nthey don't need to eat, drink, or sleep. A creature\ntrapped within a cell can escape using magic that\npermits planar travel. Otherwise, the creature is\nconfined to the cell until freed.\nIf the mirror traps a creature but its twelve\nextradimensional cells are already occupied, the\nmirror frees one trapped creature at random to\naccommodate the new prisoner. A freed creature\nappears in an unoccupied space within sight of the\nmirror but facing away from it. If the mirror is\nshattered, all creatures it contains are freed and\nappear in unoccupied spaces near it.\nWhile within 5 feet of the mirror, you can use an\naction to speak the name of one creature trapped in\nit or call out a particular cell by number. The\ncreature named or contained in the named cell\nappears as an image on the mirror's surface. You and\nthe creature can then communicate normally.\nIn a similar way, you can use an action to speak a\nsecond command word and free one creature\ntrapped in the mirror. The freed creature appears,\nalong with its possessions, in the unoccupied space\nnearest to the mirror and facing away from it.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Mirror of Life Trapping", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Mithral Armor": {
        "magicItemCharges": 0, 
        "magicItemDescription": "Mithral is a light, flexible metal. A mithral chain shirt\nor breastplate can be worn under normal clothes. If\nthe armor normally imposes disadvantage on\nDexterity (Stealth) checks or has a Strength\nrequirement, the mithral version of the armor\ndoesn't.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Mithral Armor", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Armor (medium or heavy but not hide)", 
        "magicItemWeight": 0
    }, 
    "Necklace of Adaptation": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this necklace, you can breathe\nnormally in any environment, and you have\nadvantage on saving throws made against harmful\ngases and vapors (such as cloudkill and stinking\ncloud effects, inhaled poisons, and the breath\nweapons of some dragons).\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Necklace of Adaptation", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Necklace of Fireballs": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This necklace has 1d6 + 3 beads hanging from it. You\ncan use an action to detach a bead and throw it up to\n60 feet away. When it reaches the end of its\ntrajectory, the bead detonates as a 3rd-level fireball\nspell (save DC 15).\nYou can hurl multiple beads, or even the whole\nnecklace, as one action. When you do so, increase the\nlevel of the fireball by 1 for each bead beyond the\nfirst.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Necklace of Fireballs", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Necklace of Prayer Beads": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This necklace has 1d4 + 2 magic beads made from\naquamarine, black pearl, or topaz. It also has many\nnonmagical beads made from stones such as amber,\nbloodstone, citrine, coral, jade, pearl, or quartz. If a\nmagic bead is removed from the necklace, that bead\nloses its magic.\nSix types of magic beads exist. The GM decides the\ntype of each bead on the necklace or determines it\nrandomly. A necklace can have more than one bead\nof the same type. To use one, you must be wearing\nthe necklace. Each bead contains a spell that you can\ncast from it as a bonus action (using your spell save\nDC if a save is necessary). Once a magic bead's spell\nis cast, that bead can't be used again until the next\ndawn.\nd20 Bead of … Spell\n1–6 Blessing Bless\n7–12 Curing Cure wounds (2nd level) or lesser\nrestoration\n13–16 Favor Greater restoration\n17–18 Smiting Branding smite\n19 Summons Planar ally\n20 Wind\nwalking\nWind walk\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Necklace of Prayer Beads", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Nine Lives Stealer": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You gain a +2 bonus to attack and damage rolls\nmade with this magic weapon.\nThe sword has 1d8 + 1 charges. If you score a\ncritical hit against a creature that has fewer than 100\nhit points, it must succeed on a DC 15 Constitution\nsaving throw or be slain instantly as the sword tears\nits life force from its body (a construct or an undead\nis immune). The sword loses 1 charge if the creature\nis slain. When the sword has no charges remaining,\nit loses this property.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Nine Lives Stealer", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Weapon (any sword)", 
        "magicItemWeight": 0
    }, 
    "Oathbow": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you nock an arrow on this bow, it whispers in\nElvish, “Swift defeat to my enemies.” When you use\nthis weapon to make a ranged attack, you can, as a\ncommand phrase, say, “Swift death to you who have\nwronged me.” The target of your attack becomes\nyour sworn enemy until it dies or until dawn seven\ndays later. You can have only one such sworn enemy\nat a time. When your sworn enemy dies, you can\nchoose a new one after the next dawn.\nWhen you make a ranged attack roll with this\nweapon against your sworn enemy, you have\nadvantage on the roll. In addition, your target gains\nno benefit from cover, other than total cover, and\nyou suffer no disadvantage due to long range. If the\nattack hits, your sworn enemy takes an extra 3d6\npiercing damage.\nWhile your sworn enemy lives, you have\ndisadvantage on attack rolls with all other weapons.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Oathbow", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Weapon (longbow)", 
        "magicItemWeight": 0
    }, 
    "Oil of Etherealness": {
        "magicItemCharges": 0, 
        "magicItemDescription": "Beads of this cloudy gray oil form on the outside of\nits container and quickly evaporate. The oil can\ncover a Medium or smaller creature, along with the\nequipment it's wearing and carrying (one additional\nvial is required for each size category above\nMedium). Applying the oil takes 10 minutes. The\naffected creature then gains the effect of the\netherealness spell for 1 hour.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Oil of Etherealness", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Oil of Sharpness": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This clear, gelatinous oil sparkles with tiny, ultrathin\nsilver shards. The oil can coat one slashing or\npiercing weapon or up to 5 pieces of slashing or\npiercing ammunition. Applying the oil takes 1\nminute. For 1 hour, the coated item is magical and\nhas a +3 bonus to attack and damage rolls.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Oil of Sharpness", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Oil of Slipperiness": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This sticky black unguent is thick and heavy in the\ncontainer, but it flows quickly when poured. The oil\ncan cover a Medium or smaller creature, along with\nthe equipment it's wearing and carrying (one\nadditional vial is required for each size category\nabove Medium). Applying the oil takes 10 minutes.\nThe affected creature then gains the effect of a\nfreedom of movement spell for 8 hours.\nAlternatively, the oil can be poured on the ground\nas an action, where it covers a 10-foot square,\nduplicating the effect of the grease spell in that area\nfor 8 hours.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Oil of Slipperiness", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Pearl of Power": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While this pearl is on your person, you can use an\naction to speak its command word and regain one\nexpended spell slot. If the expended slot was of 4th\nlevel or higher, the new slot is 3rd level. Once you\nuse the pearl, it canʼt be used again until the next\ndawn.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Pearl of Power", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Periapt of Health": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You are immune to contracting any disease while\nyou wear this pendant. If you are already infected\nwith a disease, the effects of the disease are\nsuppressed you while you wear the pendant.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Periapt of Health", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Periapt of Proof against Poison": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This delicate silver chain has a brilliant-cut black\ngem pendant. While you wear it, poisons have no\neffect on you. You are immune to the poisoned\ncondition and have immunity to poison damage.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Periapt of Proof against Poison", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Periapt of Wound Closure": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While you wear this pendant, you stabilize whenever\nyou are dying at the start of your turn. In addition,\nwhenever you roll a Hit Die to regain hit points,\ndouble the number of hit points it restores.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Periapt of Wound Closure", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Philter of Love": {
        "magicItemCharges": 0, 
        "magicItemDescription": "The next time you see a creature within 10 minutes\nafter drinking this philter, you become charmed by\nthat creature for 1 hour. If the creature is of a species\nand gender you are normally attracted to, you\nregard it as your true love while you are charmed.\nThis potion's rose-hued, effervescent liquid contains\none easy-to-miss bubble shaped like a heart.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Philter of Love", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Pipes of Haunting": {
        "magicItemCharges": 3, 
        "magicItemDescription": "You must be proficient with wind instruments to use\nthese pipes. They have 3 charges. You can use an\naction to play them and expend 1 charge to create an\neerie, spellbinding tune. Each creature within 30 feet\nof you that hears you play must succeed on a DC 15\nWisdom saving throw or become frightened of you\nfor 1 minute. If you wish, all creatures in the area\nthat aren't hostile toward you automatically succeed\non the saving throw. A creature that fails the saving\nthrow can repeat it at the end of each of its turns,\nending the effect on itself on a success. A creature\nthat succeeds on its saving throw is immune to the\neffect of these pipes for 24 hours. The pipes regain\n1d3 expended charges daily at dawn.\n", 
        "magicItemMaxCharges": 3, 
        "magicItemName": "Pipes of Haunting", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Pipes of the Sewers": {
        "magicItemCharges": 3, 
        "magicItemDescription": "You must be proficient with wind instruments to use\nthese pipes. While you are attuned to the pipes,\nordinary rats and giant rats are indifferent toward\nyou and will not attack you unless you threaten or\nharm them.\nThe pipes have 3 charges. If you play the pipes as\nan action, you can use a bonus action to expend 1 to\n3 charges, calling forth one swarm of rats with each\nexpended charge, provided that enough rats are\nwithin half a mile of you to be called in this fashion\n(as determined by the GM). If there aren't enough\nrats to form a swarm, the charge is wasted. Called\nswarms move toward the music by the shortest\navailable route but aren't under your control\notherwise. The pipes regain 1d3 expended charges\ndaily at dawn.\nWhenever a swarm of rats that isn't under another\ncreature's control comes within 30 feet of you while\nyou are playing the pipes, you can make a Charisma\ncheck contested by the swarm's Wisdom check. If\nyou lose the contest, the swarm behaves as it\nnormally would and can't be swayed by the pipes'\nmusic for the next 24 hours. If you win the contest,\nthe swarm is swayed by the pipes' music and\nbecomes friendly to you and your companions for as\nlong as you continue to play the pipes each round as\nan action. A friendly swarm obeys your commands. If\nyou issue no commands to a friendly swarm, it\ndefends itself but otherwise takes no actions. If a\nfriendly swarm starts its turn and can't hear the\npipes' music, your control over that swarm ends, and\nthe swarm behaves as it normally would and can't be\nswayed by the pipes' music for the next 24 hours.\n", 
        "magicItemMaxCharges": 3, 
        "magicItemName": "Pipes of the Sewers", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Plate Armor of Etherealness": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While you're wearing this armor, you can speak its\ncommand word as an action to gain the effect of the\netherealness spell, which last for 10 minutes or until\nyou remove the armor or use an action to speak the\ncommand word again. This property of the armor\ncan't be used again until the next dawn.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Plate Armor of Etherealness", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Armor (plate)", 
        "magicItemWeight": 0
    }, 
    "Portable Hole": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This fine black cloth, soft as silk, is folded up to the\ndimensions of a handkerchief. It unfolds into a\ncircular sheet 6 feet in diameter.\nYou can use an action to unfold a portable hole and\nplace it on or against a solid surface, whereupon the\nportable hole creates an extradimensional hole 10\nfeet deep. The cylindrical space within the hole\nexists on a different plane, so it can't be used to\ncreate open passages. Any creature inside an open\nportable hole can exit the hole by climbing out of it.\nYou can use an action to close a portable hole by\ntaking hold of the edges of the cloth and folding it up.\nFolding the cloth closes the hole, and any creatures\nor objects within remain in the extradimensional\nspace. No matter what's in it, the hole weighs next to\nnothing.\nIf the hole is folded up, a creature within the hole's\nextradimensional space can use an action to make a\nDC 10 Strength check. On a successful check, the\ncreature forces its way out and appears within 5 feet\nof the portable hole or the creature carrying it. A\nbreathing creature within a closed portable hole can\nsurvive for up to 10 minutes, after which time it\nbegins to suffocate.\nPlacing a portable hole inside an extradimensional\nspace created by a bag of holding, handy haversack,\nor similar item instantly destroys both items and\nopens a gate to the Astral Plane. The gate originates\nwhere the one item was placed inside the other. Any\ncreature within 10 feet of the gate is sucked through\nit and deposited in a random location on the Astral\nPlane. The gate then closes. The gate is one-way only\nand can't be reopened.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Portable Hole", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Potion of Animal Friendship": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you drink this potion, you can cast the animal\nfriendship spell (save DC 13) for 1 hour at will.\nAgitating this muddy liquid brings little bits into\nview: a fish scale, a hummingbird tongue, a cat claw,\nor a squirrel hair.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Potion of Animal Friendship", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Potion of Clairvoyance": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you drink this potion, you gain the effect of the\nclairvoyance spell. An eyeball bobs in this yellowish\nliquid but vanishes when the potion is opened.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Potion of Clairvoyance", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Potion of Climbing": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you drink this potion, you gain a climbing\nspeed equal to your walking speed for 1 hour.\nDuring this time, you have advantage on Strength\n(Athletics) checks you make to climb. The potion is\nseparated into brown, silver, and gray layers\nresembling bands of stone. Shaking the bottle fails to\nmix the colors.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Potion of Climbing", 
        "magicItemRarity": "Common", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Potion of Diminution": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you drink this potion, you gain the “reduce”\neffect of the enlarge/reduce spell for 1d4 hours (no\nconcentration required). The red in the potion's\nliquid continuously contracts to a tiny bead and then\nexpands to color the clear liquid around it. Shaking\nthe bottle fails to interrupt this process.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Potion of Diminution", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Potion of Flying": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you drink this potion, you gain a flying speed\nequal to your walking speed for 1 hour and can\nhover. If you're in the air when the potion wears off,\nyou fall unless you have some other means of staying\naloft. This potion's clear liquid floats at the top of its\ncontainer and has cloudy white impurities drifting in\nit.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Potion of Flying", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Potion of Gaseous Form": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you drink this potion, you gain the effect of the\ngaseous form spell for 1 hour (no concentration\nrequired) or until you end the effect as a bonus\naction. This potion's container seems to hold fog that\nmoves and pours like water.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Potion of Gaseous Form", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Potion of Giant Strength": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you drink this potion, your Strength score\nchanges for 1 hour. The type of giant determines the\nscore (see the table below). The potion has no effect\non you if your Strength is equal to or greater than\nthat score.\nThis potion's transparent liquid has floating in it a\nsliver of fingernail from a giant of the appropriate\ntype. The potion of frost giant strength and the potion\nof stone giant strength have the same effect.\nType of Giant Strength Rarity\nHill giant 21 Uncommon\nFrost/stone giant 23 Rare\nFire giant 25 Rare\nCloud giant 27 Very rare\nStorm giant 29 Legendary\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Potion of Giant Strength", 
        "magicItemRarity": "Rarity Varies", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Potion of Growth": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you drink this potion, you gain the “enlarge”\neffect of the enlarge/reduce spell for 1d4 hours (no\nconcentration required). The red in the potion's\nliquid continuously expands from a tiny bead to\ncolor the clear liquid around it and then contracts.\nShaking the bottle fails to interrupt this process.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Potion of Growth", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Potion of Healing": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You regain hit points when you drink this potion.\nThe number of hit points depends on the potion's\nrarity, as shown in the Potions of Healing table.\nWhatever its potency, the potion's red liquid\nglimmers when agitated.\nPotions of Healing\nPotion of … Rarity HP Regained\nHealing Common 2d4 + 2\nGreater healing Uncommon 4d4 + 4\nSuperior healing Rare 8d4 + 8\nSupreme healing Very rare 10d4 + 20\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Potion of Healing", 
        "magicItemRarity": "Rarity Varies", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Potion of Heroism": {
        "magicItemCharges": 0, 
        "magicItemDescription": "For 1 hour after drinking it, you gain 10 temporary\nhit points that last for 1 hour. For the same duration,\nyou are under the effect of the bless spell (no\nconcentration required). This blue potion bubbles\nand steams as if boiling.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Potion of Heroism", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Potion of Invisibility": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This potion's container looks empty but feels as\nthough it holds liquid. When you drink it, you\nbecome invisible for 1 hour. Anything you wear or\ncarry is invisible with you. The effect ends early if\nyou attack or cast a spell.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Potion of Invisibility", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Potion of Mind Reading": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you drink this potion, you gain the effect of the\ndetect thoughts spell (save DC 13). The potion's\ndense, purple liquid has an ovoid cloud of pink\nfloating in it.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Potion of Mind Reading", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Potion of Poison": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This concoction looks, smells, and tastes like a potion\nof healing or other beneficial potion. However, it is\nactually poison masked by illusion magic. An identify\nspell reveals its true nature.\nIf you drink it, you take 3d6 poison damage, and\nyou must succeed on a DC 13 Constitution saving\nthrow or be poisoned. At the start of each of your\nturns while you are poisoned in this way, you take\n3d6 poison damage. At the end of each of your turns,\nyou can repeat the saving throw. On a successful\nsave, the poison damage you take on your\nsubsequent turns decreases by 1d6. The poison ends\nwhen the damage decreases to 0.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Potion of Poison", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Potion of Resistance": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you drink this potion, you gain resistance to\none type of damage for 1 hour. The GM chooses the\ntype or determines it randomly from the options\nbelow.\nd10 Damage Type d10 Damage Type\n1 Acid 6 Necrotic\n2 Cold 7 Poison\n3 Fire 8 Psychic\n4 Force 9 Radiant\n5 Lightning 10 Thunder\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Potion of Resistance", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Potion of Speed": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you drink this potion, you gain the effect of the\nhaste spell for 1 minute (no concentration required).\nThe potion's yellow fluid is streaked with black and\nswirls on its own.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Potion of Speed", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Potion of Water Breathing": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You can breathe underwater for 1 hour after\ndrinking this potion. Its cloudy green fluid smells of\nthe sea and has a jellyfish-like bubble floating in it.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Potion of Water Breathing", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Potion", 
        "magicItemWeight": 0
    }, 
    "Restorative Ointment": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This glass jar, 3 inches in diameter, contains 1d4 + 1\ndoses of a thick mixture that smells faintly of aloe.\nThe jar and its contents weigh 1/2 pound.\nAs an action, one dose of the ointment can be\nswallowed or applied to the skin. The creature that\nreceives it regains 2d8 + 2 hit points, ceases to be\npoisoned, and is cured of any disease.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Restorative Ointment", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Ring of Animal Influence": {
        "magicItemCharges": 3, 
        "magicItemDescription": "This ring has 3 charges, and it regains 1d3 expended\ncharges daily at dawn. While wearing the ring, you\ncan use an action to expend 1 of its charges to cast\none of the following spells:\n* Animal friendship (save DC 13)\n* Fear (save DC 13), targeting only beasts that have\nan Intelligence of 3 or lower\n* Speak with animals\n", 
        "magicItemMaxCharges": 3, 
        "magicItemName": "Ring of Animal Influence", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Djinni Summoning": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this ring, you can speak its command\nword as an action to summon a particular djinni\nfrom the Elemental Plane of Air. The djinni appears\nin an unoccupied space you choose within 120 feet\nof you. It remains as long as you concentrate (as if\nconcentrating on a spell), to a maximum of 1 hour, or\nuntil it drops to 0 hit points. It then returns to its\nhome plane.\nWhile summoned, the djinni is friendly to you and\nyour companions. It obeys any commands you give it,\nno matter what language you use. If you fail to\ncommand it, the djinni defends itself against\nattackers but takes no other actions.\nAfter the djinni departs, it can't be summoned\nagain for 24 hours, and the ring becomes nonmagical\nif the djinni dies.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Ring of Djinni Summoning", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Elemental Command": {
        "magicItemCharges": 5, 
        "magicItemDescription": "This ring is linked to one of the four Elemental\nPlanes. The GM chooses or randomly determines the\nlinked plane.\nWhile wearing this ring, you have advantage on\nattack rolls against elementals from the linked plane,\nand they have disadvantage on attack rolls against\nyou. In addition, you have access to properties based\non the linked plane.\nThe ring has 5 charges. It regains 1d4 + 1\nexpended charges daily at dawn. Spells cast from the\nring have a save DC of 17.\nRing of Air Elemental Command. You can expend\n2 of the ring's charges to cast dominate monster on\nan air elemental. In addition, when you fall, you\ndescend 60 feet per round and take no damage from\nfalling. You can also speak and understand Auran.\nIf you help slay an air elemental while attuned to\nthe ring, you gain access to the following additional\nproperties:\n* You have resistance to lightning damage.\n* You have a flying speed equal to your walking\nspeed and can hover.\n* You can cast the following spells from the ring,\nexpending the necessary number of charges: chain\nlightning (3 charges), gust of wind (2 charges), or\nwind wall (1 charge).\nRing of Earth Elemental Command. You can\nexpend 2 of the ring's charges to cast dominate\nmonster on an earth elemental. In addition, you can\nmove in difficult terrain that is composed of rubble,\nrocks, or dirt as if it were normal terrain. You can\nalso speak and understand Terran.\nIf you help slay an earth elemental while attuned\nto the ring, you gain access to the following\nadditional properties:\n* You have resistance to acid damage.\n* You can move through solid earth or rock as if\nthose areas were difficult terrain. If you end your\nturn there, you are shunted out to the nearest\nunoccupied space you last occupied.\n* You can cast the following spells from the ring,\nexpending the necessary number of charges: stone\nshape (2 charges), stoneskin (3 charges), or wall of\nstone (3 charges).\nRing of Fire Elemental Command. You can\nexpend 2 of the ring's charges to cast dominate\nmonster on a fire elemental. In addition, you have\nresistance to fire damage. You can also speak and\nunderstand Ignan.\nIf you help slay a fire elemental while attuned to\nthe ring, you gain access to the following additional\nproperties:\n* You are immune to fire damage.\n* You can cast the following spells from the ring,\nexpending the necessary number of charges:\nburning hands (1 charge), fireball (2 charges), and\nwall of fire (3 charges).\nRing of Water Elemental Command. You can\nexpend 2 of the ring's charges to cast dominate\nmonster on a water elemental. In addition, you can\nstand on and walk across liquid surfaces as if they\nwere solid ground. You can also speak and\nunderstand Aquan.\nIf you help slay a water elemental while attuned to\nthe ring, you gain access to the following additional\nproperties:\n* You can breathe underwater and have a\nswimming speed equal to your walking speed.\n* You can cast the following spells from the ring,\nexpending the necessary number of charges:\ncreate or destroy water (1 charge), control water (3\ncharges), ice storm (2 charges), or wall of ice (3\ncharges).\n", 
        "magicItemMaxCharges": 5, 
        "magicItemName": "Ring of Elemental Command", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Evasion": {
        "magicItemCharges": 3, 
        "magicItemDescription": "This ring has 3 charges, and it regains 1d3 expended\ncharges daily at dawn. When you fail a Dexterity\nsaving throw while wearing it, you can use your\nreaction to expend 1 of its charges to succeed on that\nsaving throw instead.\n", 
        "magicItemMaxCharges": 3, 
        "magicItemName": "Ring of Evasion", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Feather Falling": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you fall while wearing this ring, you descend\n60 feet per round and take no damage from falling.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Ring of Feather Falling", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Free Action": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While you wear this ring, difficult terrain doesn't\ncost you extra movement. In addition, magic can\nneither reduce your speed nor cause you to be\nparalyzed or restrained.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Ring of Free Action", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Invisibility": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this ring, you can turn invisible as an\naction. Anything you are wearing or carrying is\ninvisible with you. You remain invisible until the\nring is removed, until you attack or cast a spell, or\nuntil you use a bonus action to become visible again.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Ring of Invisibility", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Jumping": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this ring, you can cast the jump spell\nfrom it as a bonus action at will, but can target only\nyourself when you do so.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Ring of Jumping", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Mind Shielding": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this ring, you are immune to magic\nthat allows other creatures to read your thoughts,\ndetermine whether you are lying, know your\nalignment, or know your creature type. Creatures\ncan telepathically communicate with you only if you\nallow it.\nYou can use an action to cause the ring to become\ninvisible until you use another action to make it\nvisible, until you remove the ring, or until you die.\nIf you die while wearing the ring, your soul enters\nit, unless it already houses a soul. You can remain in\nthe ring or depart for the afterlife. As long as your\nsoul is in the ring, you can telepathically\ncommunicate with any creature wearing it. A wearer\ncan't prevent this telepathic communication.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Ring of Mind Shielding", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Protection": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You gain a +1 bonus to AC and saving throws while\nwearing this ring.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Ring of Protection", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Regeneration": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this ring, you regain 1d6 hit points\nevery 10 minutes, provided that you have at least 1\nhit point. If you lose a body part, the ring causes the\nmissing part to regrow and return to full\nfunctionality after 1d6 + 1 days if you have at least 1\nhit point the whole time.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Ring of Regeneration", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Resistance": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You have resistance to one damage type while\nwearing this ring. The gem in the ring indicates the\ntype, which the GM chooses or determines randomly.\nd10 Damage Type Gem\n1 Acid Pearl\n2 Cold Tourmaline\n3 Fire Garnet\n4 Force Sapphire\n5 Lightning Citrine\n6 Necrotic Jet\n7 Poison Amethyst\n8 Psychic Jade\n9 Radiant Topaz\n10 Thunder Spinel\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Ring of Resistance", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Shooting Stars": {
        "magicItemCharges": 6, 
        "magicItemDescription": "While wearing this ring in dim light or darkness, you\ncan cast dancing lights and light from the ring at will.\nCasting either spell from the ring requires an action.\nThe ring has 6 charges for the following other\nproperties. The ring regains 1d6 expended charges\ndaily at dawn.\nFaerie Fire. You can expend 1 charge as an action\nto cast faerie fire from the ring.\nBall Lightning. You can expend 2 charges as an\naction to create one to four 3-foot-diameter spheres\nof lightning. The more spheres you create, the less\npowerful each sphere is individually.\nEach sphere appears in an unoccupied space you\ncan see within 120 feet of you. The spheres last as\nlong as you concentrate (as if concentrating on a\nspell), up to 1 minute. Each sphere sheds dim light in\na 30-foot radius.\nAs a bonus action, you can move each sphere up to\n30 feet, but no farther than 120 feet away from you.\nWhen a creature other than you comes within 5 feet\nof a sphere, the sphere discharges lightning at that\ncreature and disappears. That creature must make a\nDC 15 Dexterity saving throw. On a failed save, the\ncreature takes lightning damage based on the\nnumber of spheres you created.\nSpheres Lightning Damage\n4 2d4\n3 2d6\n2 5d4\n1 4d12\nShooting Stars. You can expend 1 to 3 charges as\nan action. For every charge you expend, you launch a\nglowing mote of light from the ring at a point you\ncan see within 60 feet of you. Each creature within a\n15-foot cube originating from that point is showered\nin sparks and must make a DC 15 Dexterity saving\nthrow, taking 5d4 fire damage on a failed save, or\nhalf as much damage on a successful one.\n", 
        "magicItemMaxCharges": 6, 
        "magicItemName": "Ring of Shooting Stars", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Spell Storing": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This ring stores spells cast into it, holding them until\nthe attuned wearer uses them. The ring can store up\nto 5 levels worth of spells at a time. When found, it\ncontains 1d6 - 1 levels of stored spells chosen by the\nGM.\nAny creature can cast a spell of 1st through 5th\nlevel into the ring by touching the ring as the spell is\ncast. The spell has no effect, other than to be stored\nin the ring. If the ring can't hold the spell, the spell is\nexpended without effect. The level of the slot used to\ncast the spell determines how much space it uses.\nWhile wearing this ring, you can cast any spell\nstored in it. The spell uses the slot level, spell save\nDC, spell attack bonus, and spellcasting ability of the\noriginal caster, but is otherwise treated as if you cast\nthe spell. The spell cast from the ring is no longer\nstored in it, freeing up space.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Ring of Spell Storing", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Spell Turning": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this ring, you have advantage on\nsaving throws against any spell that targets only you\n(not in an area of effect). In addition, if you roll a 20\nfor the save and the spell is 7th level or lower, the\nspell has no effect on you and instead targets the\ncaster, using the slot level, spell save DC, attack\nbonus, and spellcasting ability of the caster.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Ring of Spell Turning", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Swimming": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You have a swimming speed of 40 feet while wearing\nthis ring.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Ring of Swimming", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Telekinesis": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this ring, you can cast the telekinesis\nspell at will, but you can target only objects that\naren't being worn or carried.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Ring of Telekinesis", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Three Wishes": {
        "magicItemCharges": 3, 
        "magicItemDescription": "While wearing this ring, you can use an action to\nexpend 1 of its 3 charges to cast the wish spell from\nit. The ring becomes nonmagical when you use the\nlast charge.\n", 
        "magicItemMaxCharges": 3, 
        "magicItemName": "Ring of Three Wishes", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Warmth": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this ring, you have resistance to cold\ndamage. In addition, you and everything you wear\nand carry are unharmed by temperatures as low as\n-50 degrees Fahrenheit.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Ring of Warmth", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of Water Walking": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this ring, you can stand on and move\nacross any liquid surface as if it were solid ground.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Ring of Water Walking", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of X-ray Vision": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While wearing this ring, you can use an action to\nspeak its command word. When you do so, you can\nsee into and through solid matter for 1 minute. This\nvision has a radius of 30 feet. To you, solid objects\nwithin that radius appear transparent and don't\nprevent light from passing through them. The vision\ncan penetrate 1 foot of stone, 1 inch of common\nmetal, or up to 3 feet of wood or dirt. Thicker\nsubstances block the vision, as does a thin sheet of\nlead.\nWhenever you use the ring again before taking a\nlong rest, you must succeed on a DC 15 Constitution\nsaving throw or gain one level of exhaustion.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Ring of X-ray Vision", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Ring of the Ram": {
        "magicItemCharges": 3, 
        "magicItemDescription": "This ring has 3 charges, and it regains 1d3 expended\ncharges daily at dawn. While wearing the ring, you\ncan use an action to expend 1 to 3 of its charges to\nattack one creature you can see within 60 feet of you.\nThe ring produces a spectral ram's head and makes\nits attack roll with a +7 bonus. On a hit, for each\ncharge you spend, the target takes 2d10 force\ndamage and is pushed 5 feet away from you.\nAlternatively, you can expend 1 to 3 of the ring's\ncharges as an action to try to break an object you can\nsee within 60 feet of you that isn't being worn or\ncarried. The ring makes a Strength check with a +5\nbonus for each charge you spend.\n", 
        "magicItemMaxCharges": 3, 
        "magicItemName": "Ring of the Ram", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Ring", 
        "magicItemWeight": 0
    }, 
    "Robe of Eyes": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This robe is adorned with eyelike patterns. While\nyou wear the robe, you gain the following benefits:\n* The robe lets you see in all directions, and you\nhave advantage on Wisdom (Perception) checks\nthat rely on sight.\n* You have darkvision out to a range of 120 feet.\n* You can see invisible creatures and objects, as well\nas see into the Ethereal Plane, out to a range of\n120 feet.\nThe eyes on the robe can't be closed or averted.\nAlthough you can close or avert your own eyes, you\nare never considered to be doing so while wearing\nthis robe.\nA light spell cast on the robe or a daylight spell\ncast within 5 feet of the robe causes you to be\nblinded for 1 minute. At the end of each of your\nturns, you can make a Constitution saving throw (DC\n11 for light or DC 15 for daylight), ending the\nblindness on a success.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Robe of Eyes", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Robe of Scintillating Colors": {
        "magicItemCharges": 3, 
        "magicItemDescription": "This robe has 3 charges, and it regains 1d3 expended\ncharges daily at dawn. While you wear it, you can\nuse an action and expend 1 charge to cause the\ngarment to display a shifting pattern of dazzling\nhues until the end of your next turn. During this time,\nthe robe sheds bright light in a 30-foot radius and\ndim light for an additional 30 feet. Creatures that can\nsee you have disadvantage on attack rolls against\nyou. In addition, any creature in the bright light that\ncan see you when the robe's power is activated must\nsucceed on a DC 15 Wisdom saving throw or become\nstunned until the effect ends.\n", 
        "magicItemMaxCharges": 3, 
        "magicItemName": "Robe of Scintillating Colors", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Robe of Stars": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This black or dark blue robe is embroidered with\nsmall white or silver stars. You gain a +1 bonus to\nsaving throws while you wear it.\nSix stars, located on the robe's upper front portion,\nare particularly large. While wearing this robe, you\ncan use an action to pull off one of the stars and use\nit to cast magic missile as a 5th-level spell. Daily at\ndusk, 1d6 removed stars reappear on the robe.\nWhile you wear the robe, you can use an action to\nenter the Astral Plane along with everything you are\nwearing and carrying. You remain there until you\nuse an action to return to the plane you were on. You\nreappear in the last space you occupied, or if that\nspace is occupied, the nearest unoccupied space.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Robe of Stars", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Robe of Useful Items": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This robe has cloth patches of various shapes and\ncolors covering it. While wearing the robe, you can\nuse an action to detach one of the patches, causing it\nto become the object or creature it represents. Once\nthe last patch is removed, the robe becomes an\nordinary garment.\nThe robe has two of each of the following patches:\n* Dagger\n* Bullseye lantern (filled and lit)\n* Steel mirror\n* 10-foot pole\n* Hempen rope (50 feet, coiled)\n* Sack\nIn addition, the robe has 4d4 other patches. The\nGM chooses the patches or determines them\nrandomly.\nd100 Patch\n01–08 Bag of 100 gp\n09–15 Silver coffer (1 foot long, 6 inches wide and\ndeep) worth 500 gp\n16–22 Iron door (up to 10 feet wide and 10 feet high,\nbarred on one side of your choice), which you\ncan place in an opening you can reach; it\nconforms to fit the opening, attaching and\nhinging itself\n23–30 10 gems worth 100 gp each\n31–44 Wooden ladder (24 feet long)\n45–51 A riding horse with saddle bags\n52–59 Pit (a cube 10 feet on a side), which you can\nplace on the ground within 10 feet of you\n60–68 4 potions of healing\n69–75 Rowboat (12 feet long)\n76–83 Spell scroll containing one spell of 1st to 3rd\nlevel\n84–90 2 mastiffs\n91–96 Window (2 feet by 4 feet, up to 2 feet deep),\nwhich you can place on a vertical surface you\ncan reach\n97–00 Portable ram\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Robe of Useful Items", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Robe of the Archmagi": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This elegant garment is made from exquisite cloth of\nwhite, gray, or black and adorned with silvery runes.\nThe robe's color corresponds to the alignment for\nwhich the item was created. A white robe was made\nfor good, gray for neutral, and black for evil. You\ncan't attune to a robe of the archmagi that doesn't\ncorrespond to your alignment.\nYou gain these benefits while wearing the robe:\n* If you aren't wearing armor, your base Armor\nClass is 15 + your Dexterity modifier.\n* You have advantage on saving throws against\nspells and other magical effects.\n* Your spell save DC and spell attack bonus each\nincrease by 2.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Robe of the Archmagi", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Rod of Absorption": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While holding this rod, you can use your reaction to\nabsorb a spell that is targeting only you and not with\nan area of effect. The absorbed spell's effect is\ncanceled, and the spell's energy—not the spell\nitself—is stored in the rod. The energy has the same\nlevel as the spell when it was cast. The rod can\nabsorb and store up to 50 levels of energy over the\ncourse of its existence. Once the rod absorbs 50\nlevels of energy, it can't absorb more. If you are\ntargeted by a spell that the rod can't store, the rod\nhas no effect on that spell.\nWhen you become attuned to the rod, you know\nhow many levels of energy the rod has absorbed\nover the course of its existence, and how many levels\nof spell energy it currently has stored.\nIf you are a spellcaster holding the rod, you can\nconvert energy stored in it into spell slots to cast\nspells you have prepared or know. You can create\nspell slots only of a level equal to or lower than your\nown spell slots, up to a maximum of 5th level. You\nuse the stored levels in place of your slots, but\notherwise cast the spell as normal. For example, you\ncan use 3 levels stored in the rod as a 3rd-level spell\nslot.\nA newly found rod has 1d10 levels of spell energy\nstored in it already. A rod that can no longer absorb\nspell energy and has no energy remaining becomes\nnonmagical.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Rod of Absorption", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Rod", 
        "magicItemWeight": 0
    }, 
    "Rod of Alertness": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This rod has a flanged head and the following\nproperties.\nAlertness. While holding the rod, you have\nadvantage on Wisdom (Perception) checks and on\nrolls for initiative.\nSpells. While holding the rod, you can use an\naction to cast one of the following spells from it:\ndetect evil and good, detect magic, detect poison and\ndisease, or see invisibility.\nProtective Aura. As an action, you can plant the\nhaft end of the rod in the ground, whereupon the\nrod's head sheds bright light in a 60-foot radius and\ndim light for an additional 60 feet. While in that\nbright light, you and any creature that is friendly to\nyou gain a +1 bonus to AC and saving throws and can\nsense the location of any invisible hostile creature\nthat is also in the bright light.\nThe rod's head stops glowing and the effect ends\nafter 10 minutes, or when a creature uses an action\nto pull the rod from the ground. This property can't\nbe used again until the next dawn.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Rod of Alertness", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Rod", 
        "magicItemWeight": 0
    }, 
    "Rod of Lordly Might": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This rod has a flanged head, and it functions as a\nmagic mace that grants a +3 bonus to attack and\ndamage rolls made with it. The rod has properties\nassociated with six different buttons that are set in a\nrow along the haft. It has three other properties as\nwell, detailed below.\nSix Buttons. You can press one of the rod's six\nbuttons as a bonus action. A button's effect lasts\nuntil you push a different button or until you push\nthe same button again, which causes the rod to\nrevert to its normal form.\nIf you press button 1, the rod becomes a flame\ntongue, as a fiery blade sprouts from the end\nopposite the rod's flanged head.\nIf you press button 2, the rod's flanged head folds\ndown and two crescent-shaped blades spring out,\ntransforming the rod into a magic battleaxe that\ngrants a +3 bonus to attack and damage rolls made\nwith it.\nIf you press button 3, the rod's flanged head folds\ndown, a spear point springs from the rod's tip, and\nthe rod's handle lengthens into a 6-foot haft,\ntransforming the rod into a magic spear that grants a\n+3 bonus to attack and damage rolls made with it.\nIf you press button 4, the rod transforms into a\nclimbing pole up to 50 feet long, as you specify. In\nsurfaces as hard as granite, a spike at the bottom and\nthree hooks at the top anchor the pole. Horizontal\nbars 3 inches long fold out from the sides, 1 foot\napart, forming a ladder. The pole can bear up to\n4,000 pounds. More weight or lack of solid\nanchoring causes the rod to revert to its normal\nform.\nIf you press button 5, the rod transforms into a\nhandheld battering ram and grants its user a +10\nbonus to Strength checks made to break through\ndoors, barricades, and other barriers.\nIf you press button 6, the rod assumes or remains\nin its normal form and indicates magnetic north.\n(Nothing happens if this function of the rod is used\nin a location that has no magnetic north.) The rod\nalso gives you knowledge of your approximate depth\nbeneath the ground or your height above it.\nDrain Life. When you hit a creature with a melee\nattack using the rod, you can force the target to\nmake a DC 17 Constitution saving throw. On a failure,\nthe target takes an extra 4d6 necrotic damage, and\nyou regain a number of hit points equal to half that\nnecrotic damage. This property can't be used again\nuntil the next dawn.\nParalyze. When you hit a creature with a melee\nattack using the rod, you can force the target to\nmake a DC 17 Strength saving throw. On a failure,\nthe target is paralyzed for 1 minute. The target can\nrepeat the saving throw at the end of each of its\nturns, ending the effect on a success. This property\ncan't be used again until the next dawn.\nTerrify. While holding the rod, you can use an\naction to force each creature you can see within 30\nfeet of you to make a DC 17 Wisdom saving throw.\nOn a failure, a target is frightened of you for 1\nminute. A frightened target can repeat the saving\nthrow at the end of each of its turns, ending the\neffect on itself on a success. This property can't be\nused again until the next dawn.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Rod of Lordly Might", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Rod", 
        "magicItemWeight": 0
    }, 
    "Rod of Rulership": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You can use an action to present the rod and\ncommand obedience from each creature of your\nchoice that you can see within 120 feet of you. Each\ntarget must succeed on a DC 15 Wisdom saving\nthrow or be charmed by you for 8 hours. While\ncharmed in this way, the creature regards you as its\ntrusted leader. If harmed by you or your companions,\nor commanded to do something contrary to its\nnature, a target ceases to be charmed in this way.\nThe rod can't be used again until the next dawn.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Rod of Rulership", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Rod", 
        "magicItemWeight": 0
    }, 
    "Rod of Security": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While holding this rod, you can use an action to\nactivate it. The rod then instantly transports you and\nup to 199 other willing creatures you can see to a\nparadise that exists in an extraplanar space. You\nchoose the form that the paradise takes. It could be a\ntranquil garden, lovely glade, cheery tavern,\nimmense palace, tropical island, fantastic carnival, or\nwhatever else you can imagine. Regardless of its\nnature, the paradise contains enough water and food\nto sustain its visitors. Everything else that can be\ninteracted with inside the extraplanar space can\nexist only there. For example, a flower picked from a\ngarden in the paradise disappears if it is taken\noutside the extraplanar space.\nFor each hour spent in the paradise, a visitor\nregains hit points as if it had spent 1 Hit Die. Also,\ncreatures don't age while in the paradise, although\ntime passes normally. Visitors can remain in the\nparadise for up to 200 days divided by the number\nof creatures present (round down).\nWhen the time runs out or you use an action to\nend it, all visitors reappear in the location they\noccupied when you activated the rod, or an\nunoccupied space nearest that location. The rod\ncan't be used again until ten days have passed.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Rod of Security", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Rod", 
        "magicItemWeight": 0
    }, 
    "Rope of Climbing": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This 60-foot length of silk rope weighs 3 pounds and\ncan hold up to 3,000 pounds. If you hold one end of\nthe rope and use an action to speak the command\nword, the rope animates. As a bonus action, you can\ncommand the other end to move toward a\ndestination you choose. That end moves 10 feet on\nyour turn when you first command it and 10 feet on\neach of your turns until reaching its destination, up\nto its maximum length away, or until you tell it to\nstop. You can also tell the rope to fasten itself\nsecurely to an object or to unfasten itself, to knot or\nunknot itself, or to coil itself for carrying.\nIf you tell the rope to knot, large knots appear at 1-\nfoot intervals along the rope. While knotted, the rope\nshortens to a 50-foot length and grants advantage on\nchecks made to climb it.\nThe rope has AC 20 and 20 hit points. It regains 1\nhit point every 5 minutes as long as it has at least 1\nhit point. If the rope drops to 0 hit points, it is\ndestroyed.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Rope of Climbing", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Rope of Entanglement": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This rope is 30 feet long and weighs 3 pounds. If you\nhold one end of the rope and use an action to speak\nits command word, the other end darts forward to\nentangle a creature you can see within 20 feet of you.\nThe target must succeed on a DC 15 Dexterity saving\nthrow or become restrained.\nYou can release the creature by using a bonus\naction to speak a second command word. A target\nrestrained by the rope can use an action to make a\nDC 15 Strength or Dexterity check (target's choice).\nOn a success, the creature is no longer restrained by\nthe rope.\nThe rope has AC 20 and 20 hit points. It regains 1\nhit point every 5 minutes as long as it has at least 1\nhit point. If the rope drops to 0 hit points, it is\ndestroyed.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Rope of Entanglement", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Scarab of Protection": {
        "magicItemCharges": 12, 
        "magicItemDescription": "If you hold this beetle-shaped medallion in your\nhand for 1 round, an inscription appears on its\nsurface revealing its magical nature. It provides two\nbenefits while it is on your person:\n* You have advantage on saving throws against\nspells.\n* The scarab has 12 charges. If you fail a saving\nthrow against a necromancy spell or a harmful\neffect originating from an undead creature, you\ncan use your reaction to expend 1 charge and turn\nthe failed save into a successful one. The scarab\ncrumbles into powder and is destroyed when its\nlast charge is expended.\n", 
        "magicItemMaxCharges": 12, 
        "magicItemName": "Scarab of Protection", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Scimitar of Speed": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You gain a +2 bonus to attack and damage rolls\nmade with this magic weapon. In addition, you can\nmake one attack with it as a bonus action on each of\nyour turns.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Scimitar of Speed", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Weapon (scimitar)", 
        "magicItemWeight": 0
    }, 
    "Shield of Missile Attraction": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While holding this shield, you have resistance to\ndamage from ranged weapon attacks.\nCurse. This shield is cursed. Attuning to it curses\nyou until you are targeted by the remove curse spell\nor similar magic. Removing the shield fails to end the\ncurse on you. Whenever a ranged weapon attack is\nmade against a target within 10 feet of you, the curse\ncauses you to become the target instead.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Shield of Missile Attraction", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Armor (shield)", 
        "magicItemWeight": 0
    }, 
    "Slippers of Spider Climbing": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While you wear these light shoes, you can move up,\ndown, and across vertical surfaces and upside down\nalong ceilings, while leaving your hands free. You\nhave a climbing speed equal to your walking speed.\nHowever, the slippers don't allow you to move this\nway on a slippery surface, such as one covered by ice\nor oil.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Slippers of Spider Climbing", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Sovereign Glue": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This viscous, milky-white substance can form a\npermanent adhesive bond between any two objects.\nIt must be stored in a jar or flask that has been\ncoated inside with oil of slipperiness. When found, a\ncontainer contains 1d6 + 1 ounces.\nOne ounce of the glue can cover a 1-foot square\nsurface. The glue takes 1 minute to set. Once it has\ndone so, the bond it creates can be broken only by\nthe application of universal solvent or oil of\netherealness, or with a wish spell.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Sovereign Glue", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Spell Scroll": {
        "magicItemCharges": 0, 
        "magicItemDescription": "A spell scroll bears the words of a single spell,\nwritten in a mystical cipher. If the spell is on your\nclass's spell list, you can read the scroll and cast its\nspell without providing any material components.\nOtherwise, the scroll is unintelligible. Casting the\nspell by reading the scroll requires the spell's normal\ncasting time. Once the spell is cast, the words on the\nscroll fade, and it crumbles to dust. If the casting is\ninterrupted, the scroll is not lost.\nIf the spell is on your class's spell list but of a\nhigher level than you can normally cast, you must\nmake an ability check using your spellcasting ability\nto determine whether you cast it successfully. The\nDC equals 10 + the spell's level. On a failed check, the\nspell disappears from the scroll with no other effect.\nThe level of the spell on the scroll determines the\nspell's saving throw DC and attack bonus, as well as\nthe scroll's rarity, as shown in the Spell Scroll table.\nSpell Scroll\nSpell Level Rarity Save DC Attack Bonus\nCantrip Common 13 +5\n1st Common 13 +5\n2nd Uncommon 13 +5\n3rd Uncommon 15 +7\n4th Rare 15 +7\n5th Rare 17 +9\n6th Very rare 17 +9\n7th Very rare 18 +10\n8th Very rare 18 +10\n9th Legendary 19 +11\nA wizard spell on a spell scroll can be copied just as\nspells in spellbooks can be copied. When a spell is\ncopied from a spell scroll, the copier must succeed on\nan Intelligence (Arcana) check with a DC equal to 10\n+ the spell's level. If the check succeeds, the spell is\nsuccessfully copied. Whether the check succeeds or\nfails, the spell scroll is destroyed.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Spell Scroll", 
        "magicItemRarity": "Varies", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Scroll", 
        "magicItemWeight": 0
    }, 
    "Spellguard Shield": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While holding this shield, you have advantage on\nsaving throws against spells and other magical\neffects, and spell attacks have disadvantage against\nyou.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Spellguard Shield", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Armor (shield)", 
        "magicItemWeight": 0
    }, 
    "Sphere of Annihilation": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This 2-foot-diameter black sphere is a hole in the\nmultiverse, hovering in space and stabilized by a\nmagical field surrounding it.\nThe sphere obliterates all matter it passes through\nand all matter that passes through it. Artifacts are\nthe exception. Unless an artifact is susceptible to\ndamage from a sphere of annihilation, it passes\nthrough the sphere unscathed. Anything else that\ntouches the sphere but isn't wholly engulfed and\nobliterated by it takes 4d10 force damage.\nThe sphere is stationary until someone controls it.\nIf you are within 60 feet of an uncontrolled sphere,\nyou can use an action to make a DC 25 Intelligence\n(Arcana) check. On a success, the sphere levitates in\none direction of your choice, up to a number of feet\nequal to 5 x your Intelligence modifier (minimum 5\nfeet). On a failure, the sphere moves 10 feet toward\nyou. A creature whose space the sphere enters must\nsucceed on a DC 13 Dexterity saving throw or be\ntouched by it, taking 4d10 force damage.\nIf you attempt to control a sphere that is under\nanother creature's control, you make an Intelligence\n(Arcana) check contested by the other creature's\nIntelligence (Arcana) check. The winner of the\ncontest gains control of the sphere and can levitate it\nas normal.\nIf the sphere comes into contact with a planar\nportal, such as that created by the gate spell, or an\nextradimensional space, such as that within a\nportable hole, the GM determines randomly what\nhappens, using the following table.\nd100 Result\n01–50 The sphere is destroyed.\n51–85 The sphere moves through the portal or into\nthe extradimensional space.\n86–00 A spatial rift sends each creature and object\nwithin 180 feet of the sphere, including the\nsphere, to a random plane of existence.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Sphere of Annihilation", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Staff of Charming": {
        "magicItemCharges": 10, 
        "magicItemDescription": "While holding this staff, you can use an action to\nexpend 1 of its 10 charges to cast charm person,\ncommand, or comprehend languages from it using\nyour spell save DC. The staff can also be used as a\nmagic quarterstaff.\nIf you are holding the staff and fail a saving throw\nagainst an enchantment spell that targets only you,\nyou can turn your failed save into a successful one.\nYou can't use this property of the staff again until the\nnext dawn. If you succeed on a save against an\nenchantment spell that targets only you, with or\nwithout the staff's intervention, you can use your\nreaction to expend 1 charge from the staff and turn\nthe spell back on its caster as if you had cast the spell.\nThe staff regains 1d8 + 2 expended charges daily\nat dawn. If you expend the last charge, roll a d20. On\na 1, the staff becomes a nonmagical quarterstaff.\n", 
        "magicItemMaxCharges": 10, 
        "magicItemName": "Staff of Charming", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Staff", 
        "magicItemWeight": 0
    }, 
    "Staff of Fire": {
        "magicItemCharges": 10, 
        "magicItemDescription": "You have resistance to fire damage while you hold\nthis staff.\nThe staff has 10 charges. While holding it, you can\nuse an action to expend 1 or more of its charges to\ncast one of the following spells from it, using your\nspell save DC: burning hands (1 charge), fireball (3\ncharges), or wall of fire (4 charges).\nThe staff regains 1d6 + 4 expended charges daily\nat dawn. If you expend the last charge, roll a d20. On\na 1, the staff blackens, crumbles into cinders, and is\ndestroyed.\n", 
        "magicItemMaxCharges": 10, 
        "magicItemName": "Staff of Fire", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Staff", 
        "magicItemWeight": 0
    }, 
    "Staff of Frost": {
        "magicItemCharges": 10, 
        "magicItemDescription": "You have resistance to cold damage while you hold\nthis staff.\nThe staff has 10 charges. While holding it, you can\nuse an action to expend 1 or more of its charges to\ncast one of the following spells from it, using your\nspell save DC: cone of cold (5 charges), fog cloud (1\ncharge), ice storm (4 charges), or wall of ice (4\ncharges).\nThe staff regains 1d6 + 4 expended charges daily\nat dawn. If you expend the last charge, roll a d20. On\na 1, the staff turns to water and is destroyed.\n", 
        "magicItemMaxCharges": 10, 
        "magicItemName": "Staff of Frost", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Staff", 
        "magicItemWeight": 0
    }, 
    "Staff of Healing": {
        "magicItemCharges": 10, 
        "magicItemDescription": "This staff has 10 charges. While holding it, you can\nuse an action to expend 1 or more of its charges to\ncast one of the following spells from it, using your\nspell save DC and spellcasting ability modifier: cure\nwounds (1 charge per spell level, up to 4th), lesser\nrestoration (2 charges), or mass cure wounds (5\ncharges).\nThe staff regains 1d6 + 4 expended charges daily\nat dawn. If you expend the last charge, roll a d20. On\na 1, the staff vanishes in a flash of light, lost forever.\n", 
        "magicItemMaxCharges": 10, 
        "magicItemName": "Staff of Healing", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Staff", 
        "magicItemWeight": 0
    }, 
    "Staff of Power": {
        "magicItemCharges": 20, 
        "magicItemDescription": "This staff can be wielded as a magic quarterstaff that\ngrants a +2 bonus to attack and damage rolls made\nwith it. While holding it, you gain a +2 bonus to\nArmor Class, saving throws, and spell attack rolls.\nThe staff has 20 charges for the following\nproperties. The staff regains 2d8 + 4 expended\ncharges daily at dawn. If you expend the last charge,\nroll a d20. On a 1, the staff retains its +2 bonus to\nattack and damage rolls but loses all other\nproperties. On a 20, the staff regains 1d8 + 2 charges.\nPower Strike. When you hit with a melee attack\nusing the staff, you can expend 1 charge to deal an\nextra 1d6 force damage to the target.\nSpells. While holding this staff, you can use an\naction to expend 1 or more of its charges to cast one\nof the following spells from it, using your spell save\nDC and spell attack bonus: cone of cold (5 charges),\nfireball (5th-level version, 5 charges), globe of\ninvulnerability (6 charges), hold monster (5 charges),\nlevitate (2 charges), lightning bolt (5th-level version,\n5 charges), magic missile (1 charge), ray of\nenfeeblement (1 charge), or wall of force (5 charges).\nRetributive Strike. You can use an action to break\nthe staff over your knee or against a solid surface,\nperforming a retributive strike. The staff is\ndestroyed and releases its remaining magic in an\nexplosion that expands to fill a 30-foot-radius sphere\ncentered on it.\nYou have a 50 percent chance to instantly travel to\na random plane of existence, avoiding the explosion.\nIf you fail to avoid the effect, you take force damage\nequal to 16 x the number of charges in the staff.\nEvery other creature in the area must make a DC 17\nDexterity saving throw. On a failed save, a creature\ntakes an amount of damage based on how far away it\nis from the point of origin, as shown in the following\ntable. On a successful save, a creature takes half as\nmuch damage.\nDistance from Origin Damage\n10 ft. away or closer 8 x the number of charges in the staff\n11 to 20 ft. away 6 x the number of charges in the staff\n21 to 30 ft. away 4 x the number of charges in the staff\n", 
        "magicItemMaxCharges": 20, 
        "magicItemName": "Staff of Power", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Staff", 
        "magicItemWeight": 0
    }, 
    "Staff of Striking": {
        "magicItemCharges": 10, 
        "magicItemDescription": "This staff can be wielded as a magic quarterstaff that\ngrants a +3 bonus to attack and damage rolls made\nwith it.\nThe staff has 10 charges. When you hit with a\nmelee attack using it, you can expend up to 3 of its\ncharges. For each charge you expend, the target\ntakes an extra 1d6 force damage. The staff regains\n1d6 + 4 expended charges daily at dawn. If you\nexpend the last charge, roll a d20. On a 1, the staff\nbecomes a nonmagical quarterstaff.\n", 
        "magicItemMaxCharges": 10, 
        "magicItemName": "Staff of Striking", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Staff", 
        "magicItemWeight": 0
    }, 
    "Staff of Swarming Insects": {
        "magicItemCharges": 10, 
        "magicItemDescription": "This staff has 10 charges and regains 1d6 + 4\nexpended charges daily at dawn. If you expend the\nlast charge, roll a d20. On a 1, a swarm of insects\nconsumes and destroys the staff, then disperses.\nSpells. While holding the staff, you can use an\naction to expend some of its charges to cast one of\nthe following spells from it, using your spell save DC:\ngiant insect (4 charges) or insect plague (5 charges).\nInsect Cloud. While holding the staff, you can use\nan action and expend 1 charge to cause a swarm of\nharmless flying insects to spread out in a 30-foot\nradius from you. The insects remain for 10 minutes,\nmaking the area heavily obscured for creatures\nother than you. The swarm moves with you,\nremaining centered on you. A wind of at least 10\nmiles per hour disperses the swarm and ends the\neffect.\n", 
        "magicItemMaxCharges": 10, 
        "magicItemName": "Staff of Swarming Insects", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Staff", 
        "magicItemWeight": 0
    }, 
    "Staff of Thunder and Lightning": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This staff can be wielded as a magic quarterstaff that\ngrants a +2 bonus to attack and damage rolls made\nwith it. It also has the following additional\nproperties. When one of these properties is used, it\ncan't be used again until the next dawn.\nLightning. When you hit with a melee attack using\nthe staff, you can cause the target to take an extra\n2d6 lightning damage.\nThunder. When you hit with a melee attack using\nthe staff, you can cause the staff to emit a crack of\nthunder, audible out to 300 feet. The target you hit\nmust succeed on a DC 17 Constitution saving throw\nor become stunned until the end of your next turn.\nLightning Strike. You can use an action to cause a\nbolt of lightning to leap from the staff's tip in a line\nthat is 5 feet wide and 120 feet long. Each creature in\nthat line must make a DC 17 Dexterity saving throw,\ntaking 9d6 lightning damage on a failed save, or half\nas much damage on a successful one.\nThunderclap. You can use an action to cause the\nstaff to issue a deafening thunderclap, audible out to\n600 feet. Each creature within 60 feet of you (not\nincluding you) must make a DC 17 Constitution\nsaving throw. On a failed save, a creature takes 2d6\nthunder damage and becomes deafened for 1 minute.\nOn a successful save, a creature takes half damage\nand isn't deafened.\nThunder and Lightning. You can use an action to\nuse the Lightning Strike and Thunderclap properties\nat the same time. Doing so doesn't expend the daily\nuse of those properties, only the use of this one.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Staff of Thunder and Lightning", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Staff", 
        "magicItemWeight": 0
    }, 
    "Staff of Withering": {
        "magicItemCharges": 3, 
        "magicItemDescription": "This staff has 3 charges and regains 1d3 expended\ncharges daily at dawn.\nThe staff can be wielded as a magic quarterstaff.\nOn a hit, it deals damage as a normal quarterstaff,\nand you can expend 1 charge to deal an extra 2d10\nnecrotic damage to the target. In addition, the target\nmust succeed on a DC 15 Constitution saving throw\nor have disadvantage for 1 hour on any ability check\nor saving throw that uses Strength or Constitution.\n", 
        "magicItemMaxCharges": 3, 
        "magicItemName": "Staff of Withering", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Staff", 
        "magicItemWeight": 0
    }, 
    "Staff of the Magi": {
        "magicItemCharges": 50, 
        "magicItemDescription": "This staff can be wielded as a magic quarterstaff that\ngrants a +2 bonus to attack and damage rolls made\nwith it. While you hold it, you gain a +2 bonus to\nspell attack rolls.\nThe staff has 50 charges for the following\nproperties. It regains 4d6 + 2 expended charges\ndaily at dawn. If you expend the last charge, roll a\nd20. On a 20, the staff regains 1d12 + 1 charges.\nSpell Absorption. While holding the staff, you\nhave advantage on saving throws against spells. In\naddition, you can use your reaction when another\ncreature casts a spell that targets only you. If you do,\nthe staff absorbs the magic of the spell, canceling its\neffect and gaining a number of charges equal to the\nabsorbed spell's level. However, if doing so brings\nthe staff's total number of charges above 50, the staff\nexplodes as if you activated its retributive strike (see\nbelow).\nSpells. While holding the staff, you can use an\naction to expend some of its charges to cast one of\nthe following spells from it, using your spell save DC\nand spellcasting ability: conjure elemental (7\ncharges), dispel magic (3 charges), fireball (7th-level\nversion, 7 charges), flaming sphere (2 charges), ice\nstorm (4 charges), invisibility (2 charges), knock (2\ncharges), lightning bolt (7th-level version, 7 charges),\npasswall (5 charges), plane shift (7 charges),\ntelekinesis (5 charges), wall of fire (4 charges), or\nweb (2 charges).\nYou can also use an action to cast one of the\nfollowing spells from the staff without using any\ncharges: arcane lock, detect magic, enlarge/reduce,\nlight, mage hand, or protection from evil and good.\nRetributive Strike. You can use an action to break\nthe staff over your knee or against a solid surface,\nperforming a retributive strike. The staff is\ndestroyed and releases its remaining magic in an\nexplosion that expands to fill a 30-foot-radius sphere\ncentered on it.\nYou have a 50 percent chance to instantly travel to\na random plane of existence, avoiding the explosion.\nIf you fail to avoid the effect, you take force damage\nequal to 16 x the number of charges in the staff.\nEvery other creature in the area must make a DC 17\nDexterity saving throw. On a failed save, a creature\ntakes an amount of damage based on how far away it\nis from the point of origin, as shown in the following\ntable. On a successful save, a creature takes half as\nmuch damage.\nDistance from Origin Damage\n10 ft. away or closer 8 x the number of charges in the staff\n11 to 20 ft. away 6 x the number of charges in the staff\n21 to 30 ft. away 4 x the number of charges in the staff\nStaff of the Python\nStaff, uncommon (requires attunement by a cleric,\ndruid, or warlock)\nYou can use an action to speak this staff's command\nword and throw the staff on the ground within 10\nfeet of you. The staff becomes a giant constrictor\nsnake under your control and acts on its own\ninitiative count. By using a bonus action to speak the\ncommand word again, you return the staff to its\nnormal form in a space formerly occupied by the\nsnake.\nOn your turn, you can mentally command the\nsnake if it is within 60 feet of you and you aren't\nincapacitated. You decide what action the snake\ntakes and where it moves during its next turn, or you\ncan issue it a general command, such as to attack\nyour enemies or guard a location.\nIf the snake is reduced to 0 hit points, it dies and\nreverts to its staff form. The staff then shatters and is\ndestroyed. If the snake reverts to staff form before\nlosing all its hit points, it regains all of them.\n", 
        "magicItemMaxCharges": 50, 
        "magicItemName": "Staff of the Magi", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Staff", 
        "magicItemWeight": 0
    }, 
    "Staff of the Woodlands": {
        "magicItemCharges": 10, 
        "magicItemDescription": "This staff can be wielded as a magic quarterstaff that\ngrants a +2 bonus to attack and damage rolls made\nwith it. While holding it, you have a +2 bonus to spell\nattack rolls.\nThe staff has 10 charges for the following\nproperties. It regains 1d6 + 4 expended charges\ndaily at dawn. If you expend the last charge, roll a\nd20. On a 1, the staff loses its properties and\nbecomes a nonmagical quarterstaff.\nSpells. You can use an action to expend 1 or more\nof the staff's charges to cast one of the following\nspells from it, using your spell save DC: animal\nfriendship (1 charge), awaken (5 charges), barkskin\n(2 charges), locate animals or plants (2 charges),\nspeak with animals (1 charge), speak with plants (3\ncharges), or wall of thorns (6 charges).\nYou can also use an action to cast the pass without\ntrace spell from the staff without using any charges.\nTree Form. You can use an action to plant one end\nof the staff in fertile earth and expend 1 charge to\ntransform the staff into a healthy tree. The tree is 60\nfeet tall and has a 5-foot-diameter trunk, and its\nbranches at the top spread out in a 20-foot radius.\nThe tree appears ordinary but radiates a faint aura\nof transmutation magic if targeted by detect magic.\nWhile touching the tree and using another action to\nspeak its command word, you return the staff to its\nnormal form. Any creature in the tree falls when it\nreverts to a staff.\n", 
        "magicItemMaxCharges": 10, 
        "magicItemName": "Staff of the Woodlands", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Staff", 
        "magicItemWeight": 0
    }, 
    "Stone of Controlling Earth Elementals": {
        "magicItemCharges": 0, 
        "magicItemDescription": "If the stone is touching the ground, you can use an\naction to speak its command word and summon an\nearth elemental, as if you had cast the conjure\nelemental spell. The stone can't be used this way\nagain until the next dawn. The stone weighs 5\npounds.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Stone of Controlling Earth Elementals", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Stone of Good Luck (Luckstone)": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While this polished agate is on your person, you gain\na +1 bonus to ability checks and saving throws.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Stone of Good Luck (Luckstone)", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Sun Blade": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This item appears to be a longsword hilt. While\ngrasping the hilt, you can use a bonus action to cause\na blade of pure radiance to spring into existence, or\nmake the blade disappear. While the blade exists,\nthis magic longsword has the finesse property. If you\nare proficient with shortswords or longswords, you\nare proficient with the sun blade.\nYou gain a +2 bonus to attack and damage rolls\nmade with this weapon, which deals radiant damage\ninstead of slashing damage. When you hit an undead\nwith it, that target takes an extra 1d8 radiant\ndamage.\nThe sword's luminous blade emits bright light in a\n15-foot radius and dim light for an additional 15 feet.\nThe light is sunlight. While the blade persists, you\ncan use an action to expand or reduce its radius of\nbright and dim light by 5 feet each, to a maximum of\n30 feet each or a minimum of 10 feet each.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Sun Blade", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Weapon (longsword)", 
        "magicItemWeight": 0
    }, 
    "Sword of Life Stealing": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you attack a creature with this magic weapon\nand roll a 20 on the attack roll, that target takes an\nextra 3d6 necrotic damage, provided that the target\nisn't a construct or an undead. You gain temporary\nhit points equal to the extra damage dealt.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Sword of Life Stealing", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Weapon (any sword)", 
        "magicItemWeight": 0
    }, 
    "Sword of Sharpness": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you attack an object with this magic sword\nand hit, maximize your weapon damage dice against\nthe target.\nWhen you attack a creature with this weapon and\nroll a 20 on the attack roll, that target takes an extra\n4d6 slashing damage. Then roll another d20. If you\nroll a 20, you lop off one of the target's limbs, with\nthe effect of such loss determined by the GM. If the\ncreature has no limb to sever, you lop off a portion of\nits body instead.\nIn addition, you can speak the sword's command\nword to cause the blade to shed bright light in a 10-\nfoot radius and dim light for an additional 10 feet.\nSpeaking the command word again or sheathing the\nsword puts out the light.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Sword of Sharpness", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Weapon (any sword that deals slashing damage)", 
        "magicItemWeight": 0
    }, 
    "Sword of Wounding": {
        "magicItemCharges": 0, 
        "magicItemDescription": "Hit points lost to this weapon's damage can be\nregained only through a short or long rest, rather\nthan by regeneration, magic, or any other means.\nOnce per turn, when you hit a creature with an\nattack using this magic weapon, you can wound the\ntarget. At the start of each of the wounded creature's\nturns, it takes 1d4 necrotic damage for each time\nyou've wounded it, and it can then make a DC 15\nConstitution saving throw, ending the effect of all\nsuch wounds on itself on a success. Alternatively, the\nwounded creature, or a creature within 5 feet of it,\ncan use an action to make a DC 15 Wisdom\n(Medicine) check, ending the effect of such wounds\non it on a success.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Sword of Wounding", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Weapon (any sword)", 
        "magicItemWeight": 0
    }, 
    "Talisman of Pure Good": {
        "magicItemCharges": 7, 
        "magicItemDescription": "This talisman is a mighty symbol of goodness. A\ncreature that is neither good nor evil in alignment\ntakes 6d6 radiant damage upon touching the\ntalisman. An evil creature takes 8d6 radiant damage\nupon touching the talisman. Either sort of creature\ntakes the damage again each time it ends its turn\nholding or carrying the talisman.\nIf you are a good cleric or paladin, you can use the\ntalisman as a holy symbol, and you gain a +2 bonus\nto spell attack rolls while you wear or hold it.\nThe talisman has 7 charges. If you are wearing or\nholding it, you can use an action to expend 1 charge\nfrom it and choose one creature you can see on the\nground within 120 feet of you. If the target is of evil\nalignment, a flaming fissure opens under it. The\ntarget must succeed on a DC 20 Dexterity saving\nthrow or fall into the fissure and be destroyed,\nleaving no remains. The fissure then closes, leaving\nno trace of its existence. When you expend the last\ncharge, the talisman disperses into motes of golden\nlight and is destroyed.\n", 
        "magicItemMaxCharges": 7, 
        "magicItemName": "Talisman of Pure Good", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Talisman of Ultimate Evil": {
        "magicItemCharges": 6, 
        "magicItemDescription": "This item symbolizes unrepentant evil. A creature\nthat is neither good nor evil in alignment takes 6d6\nnecrotic damage upon touching the talisman. A good\ncreature takes 8d6 necrotic damage upon touching\nthe talisman. Either sort of creature takes the\ndamage again each time it ends its turn holding or\ncarrying the talisman.\nIf you are an evil cleric or paladin, you can use the\ntalisman as a holy symbol, and you gain a +2 bonus\nto spell attack rolls while you wear or hold it.\nThe talisman has 6 charges. If you are wearing or\nholding it, you can use an action to expend 1 charge\nfrom the talisman and choose one creature you can\nsee on the ground within 120 feet of you. If the\ntarget is of good alignment, a flaming fissure opens\nunder it. The target must succeed on a DC 20\nDexterity saving throw or fall into the fissure and be\ndestroyed, leaving no remains. The fissure then\ncloses, leaving no trace of its existence. When you\nexpend the last charge, the talisman dissolves into\nfoul-smelling slime and is destroyed.\n", 
        "magicItemMaxCharges": 6, 
        "magicItemName": "Talisman of Ultimate Evil", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Talisman of the Sphere": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you make an Intelligence (Arcana) check to\ncontrol a sphere of annihilation while you are\nholding this talisman, you double your proficiency\nbonus on the check. In addition, when you start your\nturn with control over a sphere of annihilation, you\ncan use an action to levitate it 10 feet plus a number\nof additional feet equal to 10 x your Intelligence\nmodifier.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Talisman of the Sphere", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Tome of Clear Thought": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This book contains memory and logic exercises, and\nits words are charged with magic. If you spend 48\nhours over a period of 6 days or fewer studying the\nbook's contents and practicing its guidelines, your\nIntelligence score increases by 2, as does your\nmaximum for that score. The manual then loses its\nmagic, but regains it in a century.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Tome of Clear Thought", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Tome of Leadership and Influence": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This book contains guidelines for influencing and\ncharming others, and its words are charged with\nmagic. If you spend 48 hours over a period of 6 days\nor fewer studying the book's contents and practicing\nits guidelines, your Charisma score increases by 2, as\ndoes your maximum for that score. The manual then\nloses its magic, but regains it in a century.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Tome of Leadership and Influence", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Tome of Understanding": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This book contains intuition and insight exercises,\nand its words are charged with magic. If you spend\n48 hours over a period of 6 days or fewer studying\nthe book's contents and practicing its guidelines,\nyour Wisdom score increases by 2, as does your\nmaximum for that score. The manual then loses its\nmagic, but regains it in a century.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Tome of Understanding", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Trident of Fish Command": {
        "magicItemCharges": 3, 
        "magicItemDescription": "This trident is a magic weapon. It has 3 charges.\nWhile you carry it, you can use an action and expend\n1 charge to cast dominate beast (save DC 15) from it\non a beast that has an innate swimming speed. The\ntrident regains 1d3 expended charges daily at dawn.\n", 
        "magicItemMaxCharges": 3, 
        "magicItemName": "Trident of Fish Command", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Weapon (trident)", 
        "magicItemWeight": 0
    }, 
    "Universal Solvent": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This tube holds milky liquid with a strong alcohol\nsmell. You can use an action to pour the contents of\nthe tube onto a surface within reach. The liquid\ninstantly dissolves up to 1 square foot of adhesive it\ntouches, including sovereign glue.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Universal Solvent", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Vicious Weapon": {
        "magicItemCharges": 0, 
        "magicItemDescription": "When you roll a 20 on your attack roll with this\nmagic weapon, your critical hit deals an extra 2d6\ndamage of the weapon's type.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Vicious Weapon", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Weapon (any)", 
        "magicItemWeight": 0
    }, 
    "Vorpal Sword": {
        "magicItemCharges": 0, 
        "magicItemDescription": "You gain a +3 bonus to attack and damage rolls\nmade with this magic weapon. In addition, the\nweapon ignores resistance to slashing damage.\nWhen you attack a creature that has at least one\nhead with this weapon and roll a 20 on the attack\nroll, you cut off one of the creature's heads. The\ncreature dies if it can't survive without the lost head.\nA creature is immune to this effect if it is immune to\nslashing damage, doesn't have or need a head, has\nlegendary actions, or the GM decides that the\ncreature is too big for its head to be cut off with this\nweapon. Such a creature instead takes an extra 6d8\nslashing damage from the hit.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Vorpal Sword", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Weapon (any sword that deals slashing damage)", 
        "magicItemWeight": 0
    }, 
    "Wand of Binding": {
        "magicItemCharges": 7, 
        "magicItemDescription": "This wand has 7 charges for the following properties.\nIt regains 1d6 + 1 expended charges daily at dawn. If\nyou expend the wand's last charge, roll a d20. On a 1,\nthe wand crumbles into ashes and is destroyed.\nSpells. While holding the wand, you can use an\naction to expend some of its charges to cast one of\nthe following spells (save DC 17): hold monster (5\ncharges) or hold person (2 charges).\nAssisted Escape. While holding the wand, you can\nuse your reaction to expend 1 charge and gain\nadvantage on a saving throw you make to avoid\nbeing paralyzed or restrained, or you can expend 1\ncharge and gain advantage on any check you make to\nescape a grapple.\n", 
        "magicItemMaxCharges": 7, 
        "magicItemName": "Wand of Binding", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wand", 
        "magicItemWeight": 0
    }, 
    "Wand of Enemy Detection": {
        "magicItemCharges": 7, 
        "magicItemDescription": "This wand has 7 charges. While holding it, you can\nuse an action and expend 1 charge to speak its\ncommand word. For the next minute, you know the\ndirection of the nearest creature hostile to you\nwithin 60 feet, but not its distance from you. The\nwand can sense the presence of hostile creatures\nthat are ethereal, invisible, disguised, or hidden, as\nwell as those in plain sight. The effect ends if you\nstop holding the wand.\nThe wand regains 1d6 + 1 expended charges daily\nat dawn. If you expend the wand's last charge, roll a\nd20. On a 1, the wand crumbles into ashes and is\ndestroyed.\n", 
        "magicItemMaxCharges": 7, 
        "magicItemName": "Wand of Enemy Detection", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wand", 
        "magicItemWeight": 0
    }, 
    "Wand of Fear": {
        "magicItemCharges": 7, 
        "magicItemDescription": "This wand has 7 charges for the following properties.\nIt regains 1d6 + 1 expended charges daily at dawn. If\nyou expend the wand's last charge, roll a d20. On a 1,\nthe wand crumbles into ashes and is destroyed.\nCommand. While holding the wand, you can use\nan action to expend 1 charge and command another\ncreature to flee or grovel, as with the command spell\n(save DC 15).\nCone of Fear. While holding the wand, you can use\nan action to expend 2 charges, causing the wand's tip\nto emit a 60-foot cone of amber light. Each creature\nin the cone must succeed on a DC 15 Wisdom saving\nthrow or become frightened of you for 1 minute.\nWhile it is frightened in this way, a creature must\nspend its turns trying to move as far away from you\nas it can, and it can't willingly move to a space within\n30 feet of you. It also can't take reactions. For its\naction, it can use only the Dash action or try to\nescape from an effect that prevents it from moving. If\nit has nowhere it can move, the creature can use the\nDodge action. At the end of each of its turns, a\ncreature can repeat the saving throw, ending the\neffect on itself on a success.\n", 
        "magicItemMaxCharges": 7, 
        "magicItemName": "Wand of Fear", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wand", 
        "magicItemWeight": 0
    }, 
    "Wand of Fireballs": {
        "magicItemCharges": 7, 
        "magicItemDescription": "This wand has 7 charges. While holding it, you can\nuse an action to expend 1 or more of its charges to\ncast the fireball spell (save DC 15) from it. For 1\ncharge, you cast the 3rd-level version of the spell.\nYou can increase the spell slot level by one for each\nadditional charge you expend.\nThe wand regains 1d6 + 1 expended charges daily\nat dawn. If you expend the wand's last charge, roll a\nd20. On a 1, the wand crumbles into ashes and is\ndestroyed.\n", 
        "magicItemMaxCharges": 7, 
        "magicItemName": "Wand of Fireballs", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wand", 
        "magicItemWeight": 0
    }, 
    "Wand of Lightning Bolts": {
        "magicItemCharges": 7, 
        "magicItemDescription": "This wand has 7 charges. While holding it, you can\nuse an action to expend 1 or more of its charges to\ncast the lightning bolt spell (save DC 15) from it. For\n1 charge, you cast the 3rd-level version of the spell.\nYou can increase the spell slot level by one for each\nadditional charge you expend.\nThe wand regains 1d6 + 1 expended charges daily\nat dawn. If you expend the wand's last charge, roll a\nd20. On a 1, the wand crumbles into ashes and is\ndestroyed.\n", 
        "magicItemMaxCharges": 7, 
        "magicItemName": "Wand of Lightning Bolts", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wand", 
        "magicItemWeight": 0
    }, 
    "Wand of Magic Detection": {
        "magicItemCharges": 3, 
        "magicItemDescription": "This wand has 3 charges. While holding it, you can\nexpend 1 charge as an action to cast the detect magic\nspell from it. The wand regains 1d3 expended\ncharges daily at dawn.\n", 
        "magicItemMaxCharges": 3, 
        "magicItemName": "Wand of Magic Detection", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wand", 
        "magicItemWeight": 0
    }, 
    "Wand of Magic Missiles": {
        "magicItemCharges": 7, 
        "magicItemDescription": "This wand has 7 charges. While holding it, you can\nuse an action to expend 1 or more of its charges to\ncast the magic missile spell from it. For 1 charge, you\ncast the 1st-level version of the spell. You can\nincrease the spell slot level by one for each\nadditional charge you expend.\nThe wand regains 1d6 + 1 expended charges daily\nat dawn. If you expend the wand's last charge, roll a\nd20. On a 1, the wand crumbles into ashes and is\ndestroyed.\n", 
        "magicItemMaxCharges": 7, 
        "magicItemName": "Wand of Magic Missiles", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wand", 
        "magicItemWeight": 0
    }, 
    "Wand of Paralysis": {
        "magicItemCharges": 7, 
        "magicItemDescription": "This wand has 7 charges. While holding it, you can\nuse an action to expend 1 of its charges to cause a\nthin blue ray to streak from the tip toward a creature\nyou can see within 60 feet of you. The target must\nsucceed on a DC 15 Constitution saving throw or be\nparalyzed for 1 minute. At the end of each of the\ntarget's turns, it can repeat the saving throw, ending\nthe effect on itself on a success.\nThe wand regains 1d6 + 1 expended charges daily\nat dawn. If you expend the wand's last charge, roll a\nd20. On a 1, the wand crumbles into ashes and is\ndestroyed.\n", 
        "magicItemMaxCharges": 7, 
        "magicItemName": "Wand of Paralysis", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wand", 
        "magicItemWeight": 0
    }, 
    "Wand of Polymorph": {
        "magicItemCharges": 7, 
        "magicItemDescription": "This wand has 7 charges. While holding it, you can\nuse an action to expend 1 of its charges to cast the\npolymorph spell (save DC 15) from it.\nThe wand regains 1d6 + 1 expended charges daily\nat dawn. If you expend the wand's last charge, roll a\nd20. On a 1, the wand crumbles into ashes and is\ndestroyed.\n", 
        "magicItemMaxCharges": 7, 
        "magicItemName": "Wand of Polymorph", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wand", 
        "magicItemWeight": 0
    }, 
    "Wand of Secrets": {
        "magicItemCharges": 3, 
        "magicItemDescription": "The wand has 3 charges. While holding it, you can\nuse an action to expend 1 of its charges, and if a\nsecret door or trap is within 30 feet of you, the wand\npulses and points at the one nearest to you. The\nwand regains 1d3 expended charges daily at dawn.\n", 
        "magicItemMaxCharges": 3, 
        "magicItemName": "Wand of Secrets", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wand", 
        "magicItemWeight": 0
    }, 
    "Wand of Web": {
        "magicItemCharges": 7, 
        "magicItemDescription": "This wand has 7 charges. While holding it, you can\nuse an action to expend 1 of its charges to cast the\nweb spell (save DC 15) from it.\nThe wand regains 1d6 + 1 expended charges daily\nat dawn. If you expend the wand's last charge, roll a\nd20. On a 1, the wand crumbles into ashes and is\ndestroyed.\n", 
        "magicItemMaxCharges": 7, 
        "magicItemName": "Wand of Web", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wand", 
        "magicItemWeight": 0
    }, 
    "Wand of Wonder": {
        "magicItemCharges": 7, 
        "magicItemDescription": "This wand has 7 charges. While holding it, you can\nuse an action to expend 1 of its charges and choose a\ntarget within 120 feet of you. The target can be a\ncreature, an object, or a point in space. Roll d100 and\nconsult the following table to discover what happens.\nIf the effect causes you to cast a spell from the\nwand, the spell's save DC is 15. If the spell normally\nhas a range expressed in feet, its range becomes 120\nfeet if it isn't already.\nIf an effect covers an area, you must center the\nspell on and include the target. If an effect has\nmultiple possible subjects, the GM randomly\ndetermines which ones are affected.\nThe wand regains 1d6 + 1 expended charges daily\nat dawn. If you expend the wand's last charge, roll a\nd20. On a 1, the wand crumbles into dust and is\ndestroyed.\nd100 Effect\n01–05 You cast slow.\n06–10 You cast faerie fire.\n11–15 You are stunned until the start of your next turn,\nbelieving something awesome just happened.\n16–20 You cast gust of wind.\n21–25 You cast detect thoughts on the target you\nchose. If you didn't target a creature, you\ninstead take 1d6 psychic damage.\n26–30 You cast stinking cloud.\n31–33 Heavy rain falls in a 60-foot radius centered on\nthe target. The area becomes lightly obscured.\nThe rain falls until the start of your next turn.\n34–36 An animal appears in the unoccupied space\nnearest the target. The animal isn't under your\ncontrol and acts as it normally would. Roll a d100\nto determine which animal appears. On a 01–25,\na rhinoceros appears; on a 26–50, an elephant\nappears; and on a 51–100, a rat appears.\n37–46 You cast lightning bolt.\n47–49 A cloud of 600 oversized butterflies fills a 30-foot\nradius centered on the target. The area becomes\nheavily obscured. The butterflies remain for 10\nminutes.\n50–53 You enlarge the target as if you had cast\nenlarge/reduce. If the target can't be affected by\nthat spell, or if you didn't target a creature, you\nbecome the target.\n54–58 You cast darkness.\n59–62 Grass grows on the ground in a 60-foot radius\ncentered on the target. If grass is already there,\nit grows to ten times its normal size and remains\novergrown for 1 minute.\n63–65 An object of the GM's choice disappears into the\nEthereal Plane. The object must be neither worn\nnor carried, within 120 feet of the target, and no\nlarger than 10 feet in any dimension.\n66–69 You shrink yourself as if you had cast\nenlarge/reduce on yourself.\n70–79 You cast fireball.\n80–84 You cast invisibility on yourself.\n85–87 Leaves grow from the target. If you chose a point\nin space as the target, leaves sprout from the\ncreature nearest to that point. Unless they are\npicked off, the leaves turn brown and fall off\nafter 24 hours.\n88–90 A stream of 1d4 x 10 gems, each worth 1 gp,\nshoots from the wand's tip in a line 30 feet long\nand 5 feet wide. Each gem deals 1 bludgeoning\ndamage, and the total damage of the gems is\ndivided equally among all creatures in the line.\n91–95 A burst of colorful shimmering light extends\nfrom you in a 30-foot radius. You and each\ncreature in the area that can see must succeed\non a DC 15 Constitution saving throw or become\nblinded for 1 minute. A creature can repeat the\nsaving throw at the end of each of its turns,\nending the effect on itself on a success.\n96–97 The target's skin turns bright blue for 1d10 days.\nIf you chose a point in space, the creature\nnearest to that point is affected.\n98–00 If you targeted a creature, it must make a DC 15\nConstitution saving throw. If you didn't target a\ncreature, you become the target and must make\nthe saving throw. If the saving throw fails by 5 or\nmore, the target is instantly petrified. On any\nother failed save, the target is restrained and\nbegins to turn to stone. While restrained in this\nway, the target must repeat the saving throw at\nthe end of its next turn, becoming petrified on a\nfailure or ending the effect on a success. The\npetrification lasts until the target is freed by the\ngreater restoration spell or similar magic.\n", 
        "magicItemMaxCharges": 7, 
        "magicItemName": "Wand of Wonder", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wand", 
        "magicItemWeight": 0
    }, 
    "Wand of the War Mage +1": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While holding this wand, you gain a bonus to spell\nattack rolls determined by the wand's rarity. In\naddition, you ignore half cover when making a spell\nattack.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Wand of the War Mage +1", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wand", 
        "magicItemWeight": 0
    }, 
    "Wand of the War Mage +2,": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While holding this wand, you gain a bonus to spell\nattack rolls determined by the wand's rarity. In\naddition, you ignore half cover when making a spell\nattack.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Wand of the War Mage +2,", 
        "magicItemRarity": "Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wand", 
        "magicItemWeight": 0
    }, 
    "Wand of the War Mage +3": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While holding this wand, you gain a bonus to spell\nattack rolls determined by the wand's rarity. In\naddition, you ignore half cover when making a spell\nattack.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Wand of the War Mage +3", 
        "magicItemRarity": "Very Rare", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wand", 
        "magicItemWeight": 0
    }, 
    "Well of Many Worlds": {
        "magicItemCharges": 0, 
        "magicItemDescription": "This fine black cloth, soft as silk, is folded up to the\ndimensions of a handkerchief. It unfolds into a\ncircular sheet 6 feet in diameter.\nYou can use an action to unfold and place the well\nof many worlds on a solid surface, whereupon it\ncreates a two-way portal to another world or plane\nof existence. Each time the item opens a portal, the\nGM decides where it leads. You can use an action to\nclose an open portal by taking hold of the edges of\nthe cloth and folding it up. Once well of many worlds\nhas opened a portal, it can't do so again for 1d8\nhours.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Well of Many Worlds", 
        "magicItemRarity": "Legendary", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Wind Fan": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While holding this fan, you can use an action to cast\nthe gust of wind spell (save DC 13) from it. Once used,\nthe fan shouldn't be used again until the next dawn.\nEach time it is used again before then, it has a\ncumulative 20 percent chance of not working and\ntearing into useless, nonmagical tatters.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Wind Fan", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": false, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }, 
    "Winged Boots": {
        "magicItemCharges": 0, 
        "magicItemDescription": "While you wear these boots, you have a flying speed\nequal to your walking speed. You can use the boots\nto fly for up to 4 hours, all at once or in several\nshorter flights, each one using a minimum of 1\nminute from the duration. If you are flying when the\nduration expires, you descend at a rate of 30 feet per\nround until you land.\nThe boots regain 2 hours of flying capability for\nevery 12 hours they aren't in use.\n", 
        "magicItemMaxCharges": 0, 
        "magicItemName": "Winged Boots", 
        "magicItemRarity": "Uncommon", 
        "magicItemRequiresAttunement": true, 
        "magicItemType": "Wondrous item", 
        "magicItemWeight": 0
    }
}