{
    "license": {
        "license": [
            "OPEN GAME LICENSE Version 1.0a",
            "1. Definitions: (a)\"Contributors\" means the copyright and/or trademark owners who have contributed Open Game Content; (b)\"Derivative Material\" means copyrighted material including derivative works and translations (including into other computer languages), potation, modification, correction, addition, extension, upgrade, improvement, compilation, abridgment or other form in which an existing work may be recast, transformed or adapted; (c) \"Distribute\" means to reproduce, license, rent, lease, sell, broadcast, publicly display, transmit or otherwise distribute; (d)\"Open Game Content\" means the game mechanic and includes the methods, procedures, processes and routines to the extent such content does not embody the Product Identity and is an enhancement over the prior art and any additional content clearly identified as Open Game Content by the Contributor, and means any work covered by this License, including translations and derivative works under copyright law, but specifically excludes Product Identity. (e) \"Product Identity\" means product and product line names, logos and identifying marks including trade dress; artifacts; creatures characters; stories, storylines, plots, thematic elements, dialogue, incidents, language, artwork, symbols, designs, depictions, likenesses, formats, poses, concepts, themes and graphic, photographic and other visual or audio representations; names and descriptions of characters, spells, enchantments, personalities, teams, personas, likenesses and special abilities; places, locations, environments, creatures, equipment, magical or supernatural abilities or effects, logos, symbols, or graphic designs; and any other trademark or registered trademark clearly identified as Product identity by the owner of the Product Identity, and which specifically excludes the Open Game Content; (f) \"Trademark\" means the logos, names, mark, sign, motto, designs that are used by a Contributor to identify itself or its products or the associated products contributed to the Open Game License by the Contributor (g) \"Use\", \"Used\" or \"Using\" means to use, Distribute, copy, edit, format, modify, translate and otherwise create Derivative Material of Open Game Content. (h) \"You\" or \"Your\" means the licensee in terms of this agreement.",
            "2. The License: This License applies to any Open Game Content that contains a notice indicating that the Open Game Content may only be Used under and in terms of this License. You must affix such a notice to any Open Game Content that you Use. No terms may be added to or subtracted from this License except as described by the License itself. No other terms or conditions may be applied to any Open Game Content distributed using this License.",
            "3. Offer and Acceptance: By Using the Open Game Content You indicate Your acceptance of the terms of this License.",
            "4. Grant and Consideration: In consideration for agreeing to use this License, the Contributors grant You a perpetual, worldwide, royalty-free, nonexclusive license with the exact terms of this License to Use, the Open Game Content.",
            "5. Representation of Authority to Contribute: If You are contributing original material as Open Game Content, You represent that Your Contributions are Your original creation and/or You have sufficient rights to grant the rights conveyed by this License.",
            "6. Notice of License Copyright: You must update the COPYRIGHT NOTICE portion of this License to include the exact text of the COPYRIGHT NOTICE of any Open Game Content You are copying, modifying or distributing, and You must add the title, the copyright date, and the copyright holder's name to the COPYRIGHT NOTICE of any original Open Game Content you Distribute.",
            "7. Use of Product Identity: You agree not to Use any Product Identity, including as an indication as to compatibility, except as expressly licensed in another, independent Agreement with the owner of each element of that Product Identity. You agree not to indicate compatibility or co-adaptability with any Trademark or Registered Trademark in conjunction with a work containing Open Game Content except as expressly licensed in another, independent Agreement with the owner of such Trademark or Registered Trademark. The use of any Product Identity in Open Game Content does not constitute a challenge to the ownership of that Product Identity. The owner of any Product Identity used in Open Game Content shall retain all rights, title and interest in and to that Product Identity.",
            "8. Identification: If you distribute Open Game Content You must clearly indicate which portions of the work that you are distributing are Open Game Content.",
            "9. Updating the License: Wizards or its designated Agents may publish updated versions of this License. You may use any authorized version of this License to copy, modify and distribute any Open Game Content originally distributed under any version of this License.",
            "10. Copy of this License: You MUST include a copy of this License with every copy of the Open Game Content You Distribute.",
            "11. Use of Contributor Credits: You may not market or advertise the Open Game Content using the name of any Contributor unless You have written permission from the Contributor to do so.",
            "12. Inability to Comply: If it is impossible for You to comply with any of the terms of this License with respect to some or all of the Open Game Content due to statute, judicial order, or governmental regulation then You may not Use any Open Game Material so affected.",
            "13. Termination: This License will terminate automatically if You fail to comply with all terms herein and fail to cure such breach within 30 days of becoming aware of the breach. All sublicenses shall survive the termination of this License.",
            "14. Reformation: If any provision of this License is held to be unenforceable, such provision shall be reformed only to the extent necessary to make it enforceable.",
            "15. COPYRIGHT NOTICE Open Game License v 1.0a Copyright 2000, Wizards of the Coast, LLC.",
            "System Reference Document 5.1 Copyright 2016, Wizards of the Coast, Inc.; Authors Mike Mearls, Jeremy Crawford, Chris Perkins, Rodney Thompson, Peter Lee, James Wyatt, Robert J. Schwalb, Bruce R. Cordell, Chris Sims, and Steve Townshend, based on original material by E. Gary Gygax and Dave Arneson."
        ]
    },
    "values": {
        "Ability Score Increase (Dragonborn)": {
            "description": "Your Strength score increases by 2, and your Charisma score increases by 1.\n",
            "name": "Ability Score Increase",
            "race": "Dragonborn"
        },
        "Ability Score Increase (Dwarf)": {
            "description": "Your Constitution score increases by 2.\n",
            "name": "Ability Score Increase",
            "race": "Dwarf"
        },
        "Ability Score Increase (Elf)": {
            "description": "Your Dexterity score increases by 2.\n",
            "name": "Ability Score Increase",
            "race": "Elf"
        },
        "Ability Score Increase (Gnome)": {
            "description": "Your Intelligence score increases by 2.\n",
            "name": "Ability Score Increase",
            "race": "Gnome"
        },
        "Ability Score Increase (Half-Elf)": {
            "description": "Your Charisma score increases by 2, and two other ability scores of your choice increase by 1.\n",
            "name": "Ability Score Increase",
            "race": "Half-Elf"
        },
        "Ability Score Increase (Half-Orc)": {
            "description": "Your Strength score increases by 2, and your Constitution score increases by 1.\n",
            "name": "Ability Score Increase",
            "race": "Half-Orc"
        },
        "Ability Score Increase (Halfling)": {
            "description": "Your Charisma score increases by 1.\n",
            "name": "Ability Score Increase",
            "race": "Halfling"
        },
        "Ability Score Increase (High Elf)": {
            "description": "Your Intelligence score increases by 1.\n",
            "name": "Ability Score Increase",
            "race": "High Elf"
        },
        "Ability Score Increase (Hill Dwarf)": {
            "description": "Your Wisdom score increases by 1.\n",
            "name": "Ability Score Increase",
            "race": "Hill Dwarf"
        },
        "Ability Score Increase (Rock Gnome)": {
            "description": "Your Constitution score increases by 1.\n",
            "name": "Ability Score Increase",
            "race": "Rock Gnome"
        },
        "Ability Score Increase (Tiefling)": {
            "description": "Your Intelligence score increases by 1, and your Charisma score increases by 2.\n",
            "name": "Ability Score Increase",
            "race": "Tiefling"
        },
        "Age (Dragonborn)": {
            "description": "Young dragonborn grow quickly. They walk hours after hatching, attain the size and development of a 10-year-old human child by the age of 3, and reach adulthood by 15. They live to be around 80.\n",
            "name": "Age",
            "race": "Dragonborn"
        },
        "Age (Dwarf)": {
            "description": "Dwarves mature at the same rate as humans, but they're considered young until they reach the age of 50. On average, they live about 350 years.\n",
            "name": "Age",
            "race": "Dwarf"
        },
        "Age (Elf)": {
            "description": "Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old.\n",
            "name": "Age",
            "race": "Elf"
        },
        "Age (Gnome)": {
            "description": "Gnomes mature at the same rate humans do, and most are expected to settle down into an adult life by around age 40. They can live 350 to almost 500 years.\n",
            "name": "Age",
            "race": "Gnome"
        },
        "Age (Half-Elf)": {
            "description": "Half-elves mature at the same rate humans do and reach adulthood around the age of 20. They live much longer than humans, however, often exceeding 180 years.\n",
            "name": "Age",
            "race": "Half-Elf"
        },
        "Age (Half-Orc)": {
            "description": "Half-orcs mature a little faster than humans, reaching adulthood around age 14. They age noticeably faster and rarely live longer than 75 years.\n",
            "name": "Age",
            "race": "Half-Orc"
        },
        "Age (Halfling)": {
            "description": "A halfling reaches adulthood at the age of 20 and generally lives into the middle of his or her second century.\n",
            "name": "Age",
            "race": "Halfling"
        },
        "Age (Human)": {
            "description": "Humans reach adulthood in their late teens and live less than a century.\n",
            "name": "Age",
            "race": "Human"
        },
        "Age (Tiefling)": {
            "description": "Tieflings mature at the same rate as humans but live a few years longer.\n",
            "name": "Age",
            "race": "Tiefling"
        },
        "Alignment (Dragonborn)": {
            "description": "Dragonborn tend to extremes, making a conscious choice for one side or the other in the cosmic war between good and evil. Most dragonborn are good, but those who side with evil can be terrible villains.\n",
            "name": "Alignment",
            "race": "Dragonborn"
        },
        "Alignment (Dwarf)": {
            "description": "Most dwarves are lawful, believing firmly in the benefits of a well-ordered society. They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order.\n",
            "name": "Alignment",
            "race": "Dwarf"
        },
        "Alignment (Elf)": {
            "description": "Elves love freedom, variety, and selfexpression, so they lean strongly toward the gentler aspects of chaos. They value and protect others' freedom as well as their own, and they are more often good than not.\n",
            "name": "Alignment",
            "race": "Elf"
        },
        "Alignment (Gnome)": {
            "description": "Gnomes are most often good. Those who tend toward law are sages, engineers, researchers, scholars, investigators, or inventors. Those who tend toward chaos are minstrels, tricksters, wanderers, or fanciful jewelers. Gnomes are good-hearted, and even the tricksters among them are more playful than vicious.\n",
            "name": "Alignment",
            "race": "Gnome"
        },
        "Alignment (Half-Elf)": {
            "description": "Half-elves share the chaotic bent of their elven heritage. They value both personal freedom and creative expression, demonstrating neither love of leaders nor desire for followers. They chafe at rules, resent others' demands, and sometimes prove unreliable, or at least unpredictable.\n",
            "name": "Alignment",
            "race": "Half-Elf"
        },
        "Alignment (Half-Orc)": {
            "description": "Half-orcs inherit a tendency toward chaos from their orc parents and are not strongly inclined toward good. Half-orcs raised among orcs and willing to live out their lives among them are usually evil.\n",
            "name": "Alignment",
            "race": "Half-Orc"
        },
        "Alignment (Halfling)": {
            "description": "Most halflings are lawful good. As a rule, they are good-hearted and kind, hate to see others in pain, and have no tolerance for oppression. They are also very orderly and traditional, leaning heavily on the support of their community and the comfort of their old ways.\n",
            "name": "Alignment",
            "race": "Halfling"
        },
        "Alignment (Human)": {
            "description": "Humans tend toward no particular alignment. The best and the worst are found among them.\n",
            "name": "Alignment",
            "race": "Human"
        },
        "Alignment (Tiefling)": {
            "description": "Tieflings might not have an innate tendency toward evil, but many of them end up there. Evil or not, an independent nature inclines many tieflings toward a chaotic alignment.\n",
            "name": "Alignment",
            "race": "Tiefling"
        },
        "Artificer's Lore (Rock Gnome)": {
            "description": "Whenever you make an Intelligence (History) check related to magic items, alchemical objects, or technological devices, you can add twice your proficiency bonus, instead of any proficiency bonus you normally apply.\n",
            "name": "Artificer's Lore",
            "race": "Rock Gnome"
        },
        "Brave (Halfling)": {
            "description": "You have advantage on saving throws against being frightened.\n",
            "name": "Brave",
            "race": "Halfling"
        },
        "Breath Weapon (Dragonborn)": {
            "description": "You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation.\n\nWhen you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level.\n\nAfter you use your breath weapon, you can't use it again until you complete a short or long rest.\n",
            "name": "Breath Weapon",
            "race": "Dragonborn"
        },
        "Damage Resistance (Dragonborn)": {
            "description": "You have resistance to the damage type associated with your draconic ancestry.\n",
            "name": "Damage Resistance",
            "race": "Dragonborn"
        },
        "Darkvision (Dwarf)": {
            "description": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n",
            "name": "Darkvision",
            "race": "Dwarf"
        },
        "Darkvision (Elf)": {
            "description": "Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n",
            "name": "Darkvision",
            "race": "Elf"
        },
        "Darkvision (Gnome)": {
            "description": "Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n",
            "name": "Darkvision",
            "race": "Gnome"
        },
        "Darkvision (Half-Elf)": {
            "description": "Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n",
            "name": "Darkvision",
            "race": "Half-Elf"
        },
        "Darkvision (Tiefling)": {
            "description": "Thanks to your infernal heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n",
            "name": "Darkvision",
            "race": "Tiefling"
        },
        "Draconic Ancestry (Dragonborn)": {
            "description": "You have draconic ancestry. Choose one type of dragon from the Draconic Ancestry table. Your breath weapon and damage resistance are determined by the dragon type, as shown in the table.\n\n<table class=\"table table-responsive table-ac-bordered table-hover\"><thead> <caption>Draconic Ancestry</caption> <tr><td>Dragon</td><td>Damage Type</td><td>Breath Weapon</td> </tr> </thead> <tbody> <tr> <td>Black</td> <td>Acid</td> <td>5 by 30 ft. line (Dex. save)</td> </tr> <tr> <td>Blue</td> <td>Lightning</td> <td>5 by 30 ft. line (Dex. save)</td> </tr> <tr> <td>Brass</td> <td>Fire</td> <td>5 by 30 ft. line (Dex. save)</td> </tr> <tr> <td>Bronze</td> <td><Lightning/td> <td>5 by 30 ft. line (Dex. save)</td> </tr> <tr> <td>Copper</td> <td>Acid</td> <td>5 by 30 ft. line (Dex. save)</td> </tr> <tr> <td>Gold</td> <td>Fire</td> <td>15 ft. cone (Dex. save)</td> </tr> <tr> <td>Green</td> <td>Poison</td> <td>15 ft. cone (Con. save)</td> </tr> <tr> <td>Red</td> <td>Fire</td> <td>15 ft. cone (Dex. save)</td> </tr> <tr> <td>Silver</td> <td>Cold</td> <td>15 ft. cone (Con. save)</td> </tr> <tr> <td>White</td> <td>Cold</td> <td>15 ft. cone (Con. save)</td> </tr> </tbody></table>\n",
            "name": "Draconic Ancestry",
            "race": "Dragonborn"
        },
        "Dwarven Combat Training (Dwarf)": {
            "description": "You have proficiency with the battleaxe, handaxe, light hammer, and warhammer.\n",
            "name": "Dwarven Combat Training",
            "race": "Dwarf"
        },
        "Dwarven Resilience (Dwarf)": {
            "description": "You have advantage on saving throws against poison, and you have resistance against poison damage.\n",
            "name": "Dwarven Resilience",
            "race": "Dwarf"
        },
        "Dwarven Toughness (Hill Dwarf)": {
            "description": "Your hit point maximum increases by 1, and it increases by 1 every time you gain a level.\n",
            "name": "Dwarven Toughness",
            "race": "Hill Dwarf"
        },
        "Elf Weapon Training (High Elf)": {
            "description": "You have proficiency with the longsword, shortsword, shortbow, and longbow. Cantrip. You know one cantrip of your choice from the wizard spell list. Intelligence is your spellcasting ability for it.\n",
            "name": "Elf Weapon Training",
            "race": "High Elf"
        },
        "Extra Language (High Elf)": {
            "description": "You can speak, read, and write one extra language of your choice.\n",
            "name": "Extra Language",
            "race": "High Elf"
        },
        "Fey Ancestry (Elf)": {
            "description": "You have advantage on saving throws against being charmed, and magic can't put you to sleep.\n",
            "name": "Fey Ancestry",
            "race": "Elf"
        },
        "Fey Ancestry (Half-Elf)": {
            "description": "You have advantage on saving throws against being charmed, and magic can't put you to sleep.\n",
            "name": "Fey Ancestry",
            "race": "Half-Elf"
        },
        "Gnome Cunning (Gnome)": {
            "description": "You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic.\n",
            "name": "Gnome Cunning",
            "race": "Gnome"
        },
        "Halfling Nimbleness (Halfling)": {
            "description": "You can move through the space of any creature that is of a size larger than yours.\n",
            "name": "Halfling Nimbleness",
            "race": "Halfling"
        },
        "Hellish Resistance (Tiefling)": {
            "description": "You have resistance to fire damage.\n",
            "name": "Hellish Resistance",
            "race": "Tiefling"
        },
        "Infernal Legacy (Tiefling)": {
            "description": "You know the thaumaturgy cantrip. When you reach 3rd level, you can cast the hellish rebuke spell as a 2nd-level spell once with this trait and regain the ability to do so when you finish a long rest. When you reach 5th level, you can cast the darkness spell once with this trait and regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells.\n",
            "name": "Infernal Legacy",
            "race": "Tiefling"
        },
        "Keen Senses (Elf)": {
            "description": "You have proficiency in the Perception skill.\n",
            "name": "Keen Senses",
            "race": "Elf"
        },
        "Lightfoot (Halfling)": {
            "description": "As a lightfoot halfling, you can easily hide from notice, even using other people as cover. You're inclined to be affable and get along well with others. Lightfoots are more prone to wanderlust than other halflings, and often dwell alongside other races or take up a nomadic life.\n",
            "name": "Lightfoot",
            "race": "Halfling"
        },
        "Menacing (Half-Orc)": {
            "description": "You gain proficiency in the Intimidation skill.\n",
            "name": "Menacing",
            "race": "Half-Orc"
        },
        "Naturally Stealthy (Halfling)": {
            "description": "You can attempt to hide even when you are obscured only by a creature that is at least one size larger than you.\n",
            "name": "Naturally Stealthy",
            "race": "Halfling"
        },
        "Relentless Endurance (Half-Orc)": {
            "description": "When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish a long rest.\n",
            "name": "Relentless Endurance",
            "race": "Half-Orc"
        },
        "Savage Attacks (Half-Orc)": {
            "description": "When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit.\n",
            "name": "Savage Attacks",
            "race": "Half-Orc"
        },
        "Size (Dragonborn)": {
            "description": "Dragonborn are taller and heavier than humans, standing well over 6 feet tall and averaging almost 250 pounds. Your size is Medium.\n",
            "name": "Size",
            "race": "Dragonborn"
        },
        "Size (Dwarf)": {
            "description": "Dwarves stand between 4 and 5 feet tall and average about 150 pounds. Your size is Medium.\n",
            "name": "Size",
            "race": "Dwarf"
        },
        "Size (Elf)": {
            "description": "Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium.\n",
            "name": "Size",
            "race": "Elf"
        },
        "Size (Gnome)": {
            "description": "Gnomes are between 3 and 4 feet tall and average about 40 pounds. Your size is Small.\n",
            "name": "Size",
            "race": "Gnome"
        },
        "Size (Half-Elf)": {
            "description": "Half-elves are about the same size as humans, ranging from 5 to 6 feet tall. Your size is Medium.\n",
            "name": "Size",
            "race": "Half-Elf"
        },
        "Size (Half-Orc)": {
            "description": "Half-orcs are somewhat larger and bulkier than humans, and they range from 5 to well over 6 feet tall. Your size is Medium.\n",
            "name": "Size",
            "race": "Half-Orc"
        },
        "Size (Halfling)": {
            "description": "Halflings average about 3 feet tall and weigh about 40 pounds. Your size is Small.\n",
            "name": "Size",
            "race": "Halfling"
        },
        "Size (Human)": {
            "description": "Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium.\n",
            "name": "Size",
            "race": "Human"
        },
        "Size (Tiefling)": {
            "description": "Tieflings are about the same size and build as humans. Your size is Medium.\n",
            "name": "Size",
            "race": "Tiefling"
        },
        "Skill Versatility (Half-Elf)": {
            "description": "You gain proficiency in two skills of your choice.\n",
            "name": "Skill Versatility",
            "race": "Half-Elf"
        },
        "Speed (Dragonborn)": {
            "description": "Your base walking speed is 30 feet.\n",
            "name": "Speed",
            "race": "Dragonborn"
        },
        "Speed (Dwarf)": {
            "description": "Your base walking speed is 25 feet. Your speed is not reduced by wearing heavy armor.\n",
            "name": "Speed",
            "race": "Dwarf"
        },
        "Speed (Elf)": {
            "description": "Your base walking speed is 30 feet.\n",
            "name": "Speed",
            "race": "Elf"
        },
        "Speed (Gnome)": {
            "description": "Your base walking speed is 25 feet.\n",
            "name": "Speed",
            "race": "Gnome"
        },
        "Speed (Half-Elf)": {
            "description": "Your base walking speed is 30 feet.\n",
            "name": "Speed",
            "race": "Half-Elf"
        },
        "Speed (Half-Orc)": {
            "description": "Your base walking speed is 30 feet. Darkvision. Thanks to your orc blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n",
            "name": "Speed",
            "race": "Half-Orc"
        },
        "Speed (Halfling)": {
            "description": "Your base walking speed is 25 feet. Lucky. When you roll a 1 on the d20 for an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll.\n",
            "name": "Speed",
            "race": "Halfling"
        },
        "Speed (Human)": {
            "description": "Your base walking speed is 30 feet.\n",
            "name": "Speed",
            "race": "Human"
        },
        "Speed (Tiefling)": {
            "description": "Your base walking speed is 30 feet.\n",
            "name": "Speed",
            "race": "Tiefling"
        },
        "Stonecunning (Dwarf)": {
            "description": "Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus.\n",
            "name": "Stonecunning",
            "race": "Dwarf"
        },
        "Tinker (Rock Gnome)": {
            "description": "You have proficiency with artisan's tools (tinker's tools). Using those tools, you can spend 1 hour and 10 gp worth of materials to construct a Tiny clockwork device (AC 5, 1 hp). The device ceases to function after 24 hours (unless you spend 1 hour repairing it to keep the device functioning), or when you use your action to dismantle it; at that time, you can reclaim the materials used to create it. You can have up to three such devices active at a time.\n\nWhen you create a device, choose one of the\nfollowing options:\n\nClockwork Toy. This toy is a clockwork animal, monster, or person, such as a frog, mouse, bird, dragon, or soldier. When placed on the ground, the toy moves 5 feet across the ground on each of your turns in a random direction. It makes noises as appropriate to the creature it represents.\n\nFire Starter. The device produces a miniature flame, which you can use to light a candle, torch, or campfire. Using the device requires your action.\n\nMusic Box. When opened, this music box plays a single song at a moderate volume. The box stops playing when it reaches the song's end or when it is closed.\n",
            "name": "Tinker",
            "race": "Rock Gnome"
        },
        "Trance (Elf)": {
            "description": "Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is “trance.”) While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep.\n",
            "name": "Trance",
            "race": "Elf"
        }
    }
}